{"title": "A Real Gas", "author": "Wendy Lee Klenetsky", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>It was Ivy Melissa’s first time alone on a city bus. True, she was only nine years old, but she had proven to be a very responsible young person. Hadn’t she always helped around the house when needed? Didn’t she babysit for her little cousin AND take her sister,Jamie Lynne, home from school each day? Well, her parents felt that today, on her half birthday( the day on which she turned nine and a half) Ivy Melissa should be allowed to go ALONE on the city bus to her friend Dana’s house; only three stops away.</p><p>Ivy Melissa was so excited, and just a bit nervous. She made sure that she had her pocketbook, wallet, money for the bus and for emergencies, and her very own house keys with her. Her mother checked to see that she looked neat and clean and that she had everything she needed. Then, after Jamie Lynne and her mother kissed her good-bye and wished her well, Ivy Melissa was off to meet the bus.</p><p>The bus stop was only one block away from her house, but today, somehow, it seemed to be MILES away. And the time it took for the bus to reach her, also seemed to take FOREVER. But Ivy Melissa confidently got on board that bus and took a seat by a window in the back row. There was no real last seat on the bus, but Ivy Melissa’s seat was as close to being the last one as you could get. The only thing which was behind her was the motor and all the other electrical gizmos.</p><p>The bus started along its run at a normal pace, but something almost automatically seemed to be wrong. Ivy Melissa couldn’t know exactly WHAT was wrong since she hadn’t been alone on a bus before. But she knew that SOMETHING HAD to be wrong because of that terrible SMELL coming out of the back of the bus. It was either coming out of the motor or out of one of those electrical gizmos. She wasn’t sure, but when she saw some of the people sitting next to her suddenly looked as if they were getting sick, or about to faint, Ivy Melissa realized that it probably was GAS- – a GAS LEAK from SOMEWHERE! She HAD to do something..But WHAT???</p><p>She yelled to the bus driver, but he, for some reason, couldn’t hear her. Then she tried to open the windows in the back of the bus, but they were SEALED SHUT due to the air conditioning. “What can I do?”, Ivy Melissa asked herself. “I must TRY to do SOMETHING..ANYTHING..”</p><p>Just then, she looked down, and saw that she was wearing those brand-new rock-hard jazzy high-top sneakers. Ivy Melissa immediately took off one of the sneakers and, with as much strength and she muster up, SMASHED OPEN the window nearest to her, letting out the horrible gas, and bringing the attention of the bus driver to the trouble she and the rest of the passengers were having there.</p><p>Ivy Melissa quickly and carefully helped lead all of the old and sick passengers out of the bus safely, and led them to a bench nearby the bus stop. She was afraid that the driver would have her arrested for breaking the window, and when a policeman came up to the stopped bus, Ivy Melissa was CERTAIN that she was going to be in deep trouble.</p><p>But to her surprise and delight, not only was she NOT arrested (or in trouble of any kind), she was DRIVEN to her friend Dana’s house BY THE POLICEMAN. This was HIS way of saying “Thank you for all of your help in this time of emergency.”</p><p>As soon as she reached Dana’s house, Ivy Melissa shook the policeman’s hand, thanked him for taking her there, and went right over to Dana’s phone and called her mother.</p><p>After hearing the whole story, Ivy Melissa’s mother and sister,Jamie Lynne, said that they were happy that she was okay and that they were VERY PROUD of her.</p><p>I guess you can say that Ivy Melissa’s first bus trip alone was a REAL GAS!!!!</p>"}