{"title": "Abby From Underland", "author": "Doreen Diorio", "level": "9 to12,Teen,", "category": "Fantasy,Original,", "tag": "", "length": "10 - 15 mins,", "body": "<p>The Royal Cook ordered Abby to bring a goblet of foaming starcider to the prince. She knocked, waited, and opened the door, but he didn’t stir from where he sat absorbed in a book. From the look of the volumes that lined the looming shelves, this was a learned prince.</p><p>She widened her eyes until they glowed to study the boy, a twelve-year-old like Abby. Lost in wonder, she spilled the goblet of amber liquid, which fanned across the floor.</p><p>The prince, with his blond brows creased and his blue eyes piercing, pivoted on the throne-like chair. “What’s this?” The purplish gem on his forehead cast a circle of light around the chamber.</p><img src='https://xcx.mdavid.cn/img/Abby-from-Underland-illustration-by-Doreen-Diorio-opt.jpg'></img><p>Abby jumped back and trembled. “I . . . uh . . . !” She shook her head of coppery hair, unable to speak. What’s the use in defending myself? she thought. I’m a hated stranger in his Gemfolk realm. Would the prince call the guard stationed outside to haul her off to prison? It was possible.</p><p>During the last dismal month Abby had lived in the castle. She’d wandered off from a class trip above Underland and had been captured by a Gemguard. The guard called her a spy and dragged her to Gemland. Abby was cleared of the charge, but she couldn’t find her way back home. She became a scullery maid and the castle steward barked about her constant lateness. She slipped and slid across the pearly floors and couldn’t seem to get to any one place—the kitchen, the banquet hall, or the royal chambers—on time. Even the other servants snubbed her as an outcast foreigner.</p><p>Prince Nathan just laughed and helped Abby mop up the spill. Then he motioned for her to take the plush chair beside his desk.</p><p>“Thank you . . . your high . . . ness,” Abby stammered in dumbfounded surprise. She climbed onto the chair, designed for tall Gemfolk, not a girl of her petite stature.</p><p>“I ask those I wish to know better to call me Nate.” The gem, no bigger than a coin, spread a halo of purple across his smiling face.</p><p>“Well, call me Abby.” She returned Nate’s warm smile and squinted at the strange gem joined onto the skin on his forehead. It appeared delicate with its curved facets, still she shielded her eyes from the strength of its beam.</p><p>Nate shrugged. “My gem brightens when I feel . . .” He trailed off as a shy blush colored his cheeks.</p><p>“What do you feel?” Abby ventured to ask.</p><p>“Glad to know you, Abby from Underland!” Nate gripped her hand with a throbbing shake. “I’ve never met an actual Underlander.” He soared up to the topmost shelf, hefted a weighty text, and landed beside his desk.  “Your people should be praised, not scorned,” he said in a matter-of-fact-voice.</p><p>Abby’s heart soared like the winged creatures of Mish, a remote region of dizzying heights. Had she—along with her misunderstood people—found had a royal ally in this prince?</p><p>Nate flipped the pages of the book, ran his finger down a passage, and read out loud: “‘Underlanders, known for their mysterious dreams are a race of cave dwellers. Whilst the Ancients once honored Underland, suspicion of their dream magic drove them deeper into the underground.’”</p><p>“This is something of a joke among us.” Abby leaned over the chair to tap the page. “My people live inside houses my ancestors built into our caves. This myth kept us hidden until we grew apart from the upper world. After many moons, our white eyes glowed in the lightless mazes of our underground home.” Her head dropped to her chest. “Now the rest of the planet despises our dream visions as a kind of dark magic.”</p><p>“It’s high time then.” Nate rubbed his chin as he watched Abby with a thoughtful look. “The world must embrace Underland again.”</p><p>Abby stared out the window and sighed. The spires of Gemland Castle, unlike the softness of her earthy home, clawed the sky like fingernails of glass. She expected nothing in this hostile place where, worst of all, she’d lost the power of her dreams in the light-filled realm. How else could she find her way home?</p><p>“Good prince, it’s enough that you embrace my people,” she murmured.</p><p>“That I do, Abby!” Nate thumped her back and she lurched forward on the seat. “And I honor the gift of your magical dreams.”</p><p>Abby could no longer claim that gift, but Nate’s merry laugh lifted her spirits.</p><p style=\"text-align: center;\">#</p><p>Tension gripped Abby like a squeezing fist as they waited in the throne room. She’d agreed to meet the king and queen, but this had been Nate’s idea. Although Abby longed speak up for her people, she fought an eerie unease. She pondered Nate’s description of his parents as traditional folks who followed the old Gemland ways. Had their traditions prejudiced them against Underland?</p><p>Abby peered from where she hid behind Nate at the glistening thrones across the room. Behind the thrones, a high window stretched to the dome of a vaulted ceiling. A serpentine tunnel wound its way down to an oval courtyard below the window. The tunnel spiraled from the throne room to the top of the castle, the highest spire in the land.</p><p>Abby drew a deep breath as she felt herself shrink within the palatial room. Lights speckled the floor in a myriad of dotted rainbows. The forest where she’d emerged from Underland what seemed like ages before looked faraway through the window. Abby’s parents must have tried to find her, but how could they have crossed the guarded border? They might wind up being captured by Gemguards, too.</p><p>Abby wagged her head at the window in sorrow. She’d snuck off from her class to pick flowers for her sister’s birthday and, dazzled in the sunlit field, had been seized. Ever since, she pined for her family, her friends, and her cozy room at home. To top it off, she felt even more lost without the guiding visions of her dreams.</p><p>Two uniformed guards ducked under the tunnel’s mouth and flew to stand beside the thrones. One blew a gleaming trumpet and thundered, “All hail, King Reginald and Queen Monica!”</p><p>The gemstones on the guards’ and Nate’s foreheads lit with the sweep of their bows. Abby, bowing beside Nate, ground her teeth at the thought of what her people viewed as servile homage. For the sake of Nate’s friendship, she bore the indignity.</p><p>In a swirl of iridescent, white robes, the king and queen swooped out of the tunnel and settled onto their thrones. Like their son, they were fair-skinned, golden-haired, and tall. Unlike their friendly son, frowns sharpened their drawn faces.</p><p>“Why have you troubled us, Prince Nathan?” King Reginald’s question rang out. “We were about to embark on a Royal Hunt.”</p><p>Nate had told Abby how his parents spent most of their time engaged in hunts and lavish banquets.</p><p>“Father, Mother,” Nate met their eyes, piercing blue like his, “I would not have asked for this audience without just cause.” He patted Abby’s hand. “I’ve made a trustworthy friend in Abigail from Underland. I pray you hear us out—”</p><p>“How can you disgrace us like this?” The queen’s gem sparked with pink lights as she clutched her face in her hands. “You were warned of the dark magic of her people!”</p><p>“Prince Nathan, you will not attempt to see this vile foreigner again,” the king snarled at Nate and fixed a glare on Abby. “We rescued you from your dingy Underland to dwell in our glorious kingdom and you poison our son’s mind! Is this how you redeem the name of your roguish people in our eyes?”</p><p>The scorn she’d put up with for six homesick months formed on Abby’s tongue. She raised her eyes to boldly meet the king’s glare and cried out, “Your son alone redeemed your people in my eyes!”</p><p>A shocked silence followed the pulsing echo of Abby’s words. Even Nate nudged her side, but Abby, who’d heard enough—too many—insults, didn’t care.</p><p>The queen slapped the armrest of her throne and demanded her guard to, “Remove this insolent girl from our presence!”</p><p>“Guards, seize the Underlander!” the king ordered.</p><p>“No, Mother, Father, please!” Nate clasped his hands in a pleading gesture. “Abby, I’m so sorry–!”</p><p>The queen’s guard rushed over and thrust out his arm to hold Nate, who flailed his arms.</p><p>“Let him be!” Abby lunged to defend her friend.</p><p>The king’s burly guard lumbered toward Abby and barked, “Hold your tongue, girl.” He dragged her out of the door, which slammed with a deafening clang. He rose in the air and carried Abby in flight down a twisty corridor.</p><p>Nate’s loud protests rang out in the hallway as Abby’s mind whirled. Will I ever see the prince, my only friend in Gemland, again? </p><p>The guard’s coarse fingers dug into her arms until they landed before a padlocked door. “See to our guest’s accommodations.” He jerked his beard at a scruffy gray-haired warden who unlatched the door.</p><p>The guard lifted Abby by the neckline of her tunic and dropped her on the dungeon floor. The door shut with a thud and the guard’s and warden’s boot-steps faded outside. Abby widened her eyes until they glowed with white to scan the musty dungeon. Its cracked stones sloped in a ceiling, which was laced with straggled moss. “Just like,” she sputtered with anger, “but not my home!”</p><p>A solitary tear coursed down Abby’s cheek. How could she survive imprisonment to return her beloved homeland? She wept into her palms, clamped shut her eyes, and, drained by the struggle, lapsed into slumber.</p><p>A vision wove its way into her dream. Nate’s smiling face, lit by the circular glow of his gem, greeted her within the dream. He lifted a finger toward a forest path and Abby took it as a sign of hope. Hadn’t Nate reminded her? She was descended from a race of gifted people. Abby’s path became clear through the seeing magic of her dream. Somehow she would escape to return to her people.</p><p>First she needed to garner her strength, which for any Underlander stemmed from sleep.</p><p style=\"text-align: center;\">#</p><p> </p><p>The door opened with a noisy squeak that woke Abby whose temper surged. “What now?” To awaken a dreaming Underlander was the height of insult.</p><p>“You, cave dweller, a castle soldier’s come to take you to court.” The warden jerked a bony thumb behind him. “You’d better not make him wait!”</p><p>Abby, too groggy to argue, stood on wobbly legs to follow him out of the dungeon. The mustached soldier thrust her head first through a back door. She dropped, her limbs splayed, onto the cobblestones of a grimy alleyway.</p><p>“Yow!” Abby rubbed her stinging chin.</p><p>The moment the warden slammed the door, the soldier bent over Abby. “Forgive my bad manners, Miss Abigail, but your escape must appear believable,” he explained in a hushed voice.</p><p>“Huh?” Abby, baffled by his sudden kindness, squinted from where she sprawled on the ground.</p><p>“There’s not much time before sunrise. Quick, grab hold of my feet,” he instructed.</p><p>Her jumbled thoughts raced as Abby crawled further down the alleyway. The soldier moved toward her and she sidled against a gap in the stone wall. Its opening, big enough for Abby to slip into, was too narrow for the towering soldier.</p><p>Just then, her dream-vision flashed to mind. Maybe this wasn’t another prejudiced Gemfolk who had come to seize her. Abby sensed that she needed to trust the mysterious soldier. She sucked in a deep breath, struggled to her feet, and took a step toward him.</p><p>She knelt to clutch the soldier’s boots and his golden buttons jangled as they flew above the pavement. He maneuvered the dusky maze of alleys and Abby’s bare feet slapped the corners of buildings. She bit her lip to keep from yelping.</p><p>They came to a foggy road and soared over it to the kingdom’s border. Then they alighted on the shadowy edge of the forest. Abby spied a shrouded figure lurking between the trees and gasped. Had she misunderstod her dream-vision? Did the soldier lead me into a trap?</p><p>She backed up, ready to scamper into the forest when the hood fell back to unveil Nate’s smiling face. Abby flung her arms around the prince.</p><p>“I hope you haven’t suffered, my friend.” Nate’s forehead creased with a look of concern.</p><p>“Not much, Nate.” Abby shook his upturned hand. “It took imprisonment in that dark, lightless dungeon to divine the magic of my dreams.”</p><p>“We must make haste now.” Nate patted her shoulder. “The castle guards will seek you out come morning.” He turned to the soldier. “I shall not forget this kindness, captain.”</p><p>The light of their gems mingled as Nate returned the soldier’s bow.</p><p>“Prince Nathan, you will be a great king to usher in a bright future for our kingdom. You are by no means alone in your belief that our world must evolve to embrace all peoples,” the soldier said with a brisk nod in Abby’s direction.</p><p>Nate watched Abby as he answered, “One day our lands of light and darkness will be united.”</p><p>And maybe Abby’s lost sojourn had been in a worthy cause. Nate, the future king of Gemland, would honor her people and the good magic of their dreams.</p><p>Nate drew a yellowed map from the pocket of his purple cloak. “Now, Abby of Underland, let the beacons of your glowing eyes and my gem’s light guide our steps.” He turned and, just like in Abby’s dream, pointed to a path that meandered into the forest. “I’ll help you find your way home.”</p><p>Abby, whose eyes cast a vivid glow into the forest, skipped with joy onto the path. Nate trailed her, laughing out loud.</p><p>“Aah, Prince,” she spun around to exclaim, “your laughter is a delightful stream trickling through a happy garden!”</p><p>That happy garden was Abby’s heart, which thumped with joy. She was going home.</p><p style=\"text-align: center;\">            THE END</p>"}