{"title": "Alien Aje Starts School", "author": "Tina Brescanu", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Aje woke up tired the morning he was starting first class. He didn’t want to start school but his parents had told him this was the way of the humans and as they were visiting from another planet they had to do what humans do to fit in.</p><p>“Aje, it’s time for you to make human friends now,” his parents told him at breakfast.</p><p>Aje had loads of friends, but no human friends, despite having lived on planet Earth since the day he was born. He wasn’t sure how long his parents had lived on Earth but they often seemed more human than of his own species to him.</p><p>“I have friends, loads of friends, good friends,” Aje protested. It wasn’t his fault no one else could see them.</p><p>“Aje, your imaginary friends have served their time, it’s time to become fully human now,” his mum and dad said.</p><p>“I don’t want to be human. I want to keep my friends.” Aje made a sour face and stood up from the table.</p><p>“They are not imaginary, they are real. I wish you were made up!” Aje shouted and stormed off. He didn’t mean it, but aliens could vent all feelings without other aliens taking it personally. His parents gave him both space and freedom to be the alien he was in an earthly world.</p><p>Aje knew that they were just trying to help him make the adjustment easier. Starting school was his first milestone in becoming human, or at least pretending that he was one too.</p><p>Aje had never been lonely even when he was on his own, that was for humans not aliens. He had always dreaded starting school because he knew he would have to change to fit in. No amount of positive storytelling had changed his mind.</p><p>“This is Aje,” said his teacher later the same morning. He stood in front of the class who all knew each other from playschool. Aje was glad to hold the hands of two of his good friends. Some boys started whispering straight away. A few girls started giggling. The negative attention made Aje droop, but his friends picked him up and helped him to his seat.</p><p>At first break the whole class gathered around Aje. They started asking questions.</p><p>“Why do you talk to yourself?”</p><p>“Why do you dress like that?”</p><p>“Why are you smiling all the time?”</p><p>Aje couldn’t answer. He had never seen himself like they did. He didn’t talk to himself. He talked to his friends. He loved colourful clothes. He was always smiling because he was happy. Everyone on his planet was the same. But not here.</p><p>“You are strange,” said a girl.</p><p>“Yes, strange and weird,” said a boy.</p><p>And then everyone laughed; everyone except Aje.</p><p>Everyone in the class started playing tag, but not Aje. No one asked if he wanted to play. Aje was left on his own. His only friends disappeared too as he wasn’t his real self. For the first time in his life Aje wondered who he really was. He didn’t like the feeling of not knowing. At night when he went to his real home he always knew who he was. He was Aje on a mission on planet Earth. But now he couldn’t remember anything. In the short space of a few hours his whole world had been turned up-side down.</p><p>“I wish night time was my day time,” he told his parents when going to bed.</p><p>He thought of his classmates visiting his planet and how strange they would seem to his people, no imaginary friends, no incessant smiling, a strong dislike of his preferred fuel—vegetables, and no talking with trees and no out of party dress up.</p><p>The next day Aje wiped the smile of his face and changed his clothes to more subdued colours and patterns. He also left his imaginary friends at home. His classmates still teased him and left him alone. He was miserable. He wanted to run away from school.</p><p>“I’m not going to school anymore,” he told his parents the second evening.</p><p>“It’ll get better once your classmates get to know you,” his mum said.</p><p>“You have to go to school,” his dad said. His parents were not helpful.</p><p>But nothing changed. No one talked to Aje and his imaginary friends didn’t like school. He felt lonely and unnecessary. At break time he hid behind the old oak tree. Trees were antennas to another world for Aje, his world. As he hugged the tree he tried to remember the reason he had agreed to be born on Earth, the reason he had agreed to be different. He got a faint signal, a whispering of hope from a tree picking up signals from Aje’s real home.</p><p>Aje had never minded being who he was but now he couldn’t understand why he had decided not to be like everyone else. Life would be so much easier if he could just fit in, if he could change and be like everyone else.</p><p>At night when he went home through his dreams, life was sweet. Life was real, but as soon as he woke up and realised he had to play human again he despaired. Each day he shrunk and faded. He might as well not have been there and at that thought Aje decided to be himself again. He liked being who he was, why should he change?</p><p>He decided to take his power back. He’d rather be with his real friends than the one’s forced on him by a dated system. He put on his most colourful clothes and asked his imaginary friends to come with him to school. Together they skipped and jumped and laughed and talked all the way to the school. Instead of going behind the oak tree he greeted the tree from the front, in full view of the school yard, with a big hug.</p><p>In the classroom the teacher told Aje off for laughing in class.</p><p>“My friend, imaginary friend to you, just said something funny,” Aje shared with the class who laughed but this time he didn’t mind. He laughed too.</p><p>At break time a girl from his class, Ute, came up to talk to him.</p><p>“I think I’ve finally figured out who I am,” Ute said as she popped up from behind the oak tree, making him jump. Aje waited to hear the rest.</p><p>“You are an alien, and I’m too.” She had always felt odd, different and not quite part of the group. Aje stared at her mouth wide open.</p><p>“You inspired me to be myself,” she complimented him, but my dad says only aliens’ talk to themselves and laughs for no good reason.”</p><p>“Is that why it took you so long to make contact?” Aje wondered, closing his mouth.</p><p>“Yes, please teach me all you know. Please re-introduce me to my imaginary friends,” Ute said as her face flushed red with excitement.</p><p>“They are not imaginary. They are real.” He had never liked to have to refer to his friends as imaginary.</p><p>“I know. Please,” she pleaded.</p><p>Aje thought for a while before agreeing.</p><p>He showed her how to hug a tree, how to tune in and listen. He asked his friends to find hers and they did. She started talking and laughing like Aje. She also dressed in colourful clothes that didn’t match.</p><p>“We’re a match,” they said and their classmates laughed at both of them.</p><p>They skipped together, holding hands and laughing and their classmates found more pleasure than ever in teasing now when there was two of them.</p><p>“Can you see people who are not there too now?”</p><p>“Did he turn you into an alien as well?”</p><p>Ute took Aje’s hand and together they marched past everyone. He forgave her earlier cowardice immediately; in fact he decided they had just met. They bonded in their differentness.</p><p>“Thanks,” they both said at the same time and Aje wondered who had been waiting for whom. Aje and Ute played in his home after school. They talked about the universe, wondering if it was really a multiverse.</p><p>“Perhaps there are many different versions of the same planets too,” Ute thought out loud and Aje almost cried with happiness at Ute’s outrageous thought tracks.</p><p>“No matter how many versions it’s still just one,” Aje added his own totally out there theory, and together they laughed like none of them had laughed before.</p><p>Ute stayed for dinner, they had vegetables with vegetables and Ute who never even got her five a day tucked in.</p><p>“Why can we only go home through our dreams, why can’t we fly? Why can’t we zoom up to our planets like superheroes do?”</p><p>“Because we are playing humans, dreams are such a clever way of pretending to be human but still having access to the whole universe. Don’t mock your dream world, it’s your reality.”</p><p>They looked at the night sky while walking to Ute’s home.</p><p>“Look!” Aje shouted, that’s our planet, he started buzzing, whizzing and swaying.</p><p>Ute did too, only she pretended but she was on to a good start as Aje applauded her efforts.</p><p>Some days later a few more classmates came to the oak tree to see what they were doing.</p><p>“Hugging trees is a way of talking to other planets, they are like radio antennas,” Aje explained as Ute was still learning.</p><p>“Wow,” some said without laughing, wishing it was true.</p><p>A few more weeks and as the whole class gathered around the oak tree even the teacher came out to see what everyone was doing.</p><p>“Hugging a tree and talking with imaginary friends, you are all being very alien like,” she said and everyone broke out in laughter.</p><p>Soon another child started their class. He was small, dressed funny and talked to people no one else could see, no one except Aje and Ute.</p><p>“Come and play after school, Eso.” Aje invited the new boy and everyone else in the class.</p><p>They played hide and seek because that was Aje’s best game, his imaginary friends told him where everyone was hiding.</p><p>“It’s not fair,” his classmates shouted but Aje, Ute and Eso who were all on the same team shouted back, “Invite your old imaginary friends back, or if you never had any, create some!”</p><p>Aje was happy, he had made human friends but he had also managed to hold on to his old friends. His imaginary, to others of course, friends were very real and very present only he had learnt to keep the balance, to live on Earth even though he was not from Earth.</p>"}