{"title": "Alligator Alley", "author": "Artie Knapp", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Alligator,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Alligator-Alley-opt.jpg'></img><p>At first, nothing seemed out of the ordinary on that Tuesday evening in Belvar. The local bowling alley was packed for the 26th Annual Belvar Bowling Championship.  Everyone was excited for the event to get started.</p><p>“Okay, this is the last call.  Is there anyone else who wants to register for the tournament before we get underway?” asked the mayor.</p><p>The crowd was silent.</p><p>“Well, let’s get started then,” the mayor said.</p><p>The bowling alley erupted in cheers, but then a deep, husky voice said, “Wait. Count me in.”</p><p>At that moment, terror engulfed the entire bowling alley. Parents reached for their children, and the bowlers braced for the worst.</p><p>The mayor, who was now on wobbly knees said, “Ple… Ple… Please leave, sir. We don’t want any trouble.”</p><p>“Relax! I’m not going to hurt anybody,” declared an alligator wearing sunglasses.</p><p>The alligator took off his sunglasses and said, “Look, I’m just here for the tournament. May I please play?”</p><p>“You bowl?” asked a frightened old lady from the crowd.</p><p>“Whenever I get the chance,” said the alligator. “But as you can imagine, there are very few opportunities for me to do so. I read about this tournament and would really like to be a part of it.”</p><p>The mayor, who had finally collected his breath said, “Well, if you behave and promise that you’re just here for the tournament, then I don’t see any problem with you participating.”</p><p>“I give you my word,” said the alligator. “After the tournament is over, I’ll leave as I came, in peace.”</p><p>“Are there any objections?” asked the mayor to the other bowlers.</p><p>None of the bowlers said a word. Why would they? Who would take a chance on upsetting an alligator?</p><p>“Very well then,” said the mayor. “Let the tournament begin.”</p><p>After the alligator thanked the mayor for allowing him to participate, he headed for the shoe racks. Everyone in the bowling alley was watching his every move.</p><p>“What’s your name?” asked a little girl hidden behind her mother’s protective grasp.</p><p>“Al,” replied the alligator. “My name is Al.”</p><p>Al set his bowling ball bag atop the shoe counter. After paying his entry fee and realizing there weren’t any size 9’s, in extra, extra, extra wide, Al walked back towards the lanes to prepare to play. The rest of the bowlers were still watching Al intently.</p><p>“Well, come on. Are we going to bowl or not?” asked the mayor.</p><p>One by one, the bowlers began throwing practice balls. Bosco Wilson, who had won the tournament for six consecutive years, walked up to Al and said, “Hey gator, I don’t know where you’re from, or where you’ve played before, but this tournament is mine. I never lose.”</p><p>Al just ignored Bosco and began practicing with the other bowlers. His first practice throws went straight into the gutter.  No pins.  Bosco laughed at Al and said, “Well, it looks like the only thing we have to fear from you is getting our arms bit off. You’re a horrible bowler, gator.”</p><p>“I’m just warming up,” replied Al calmly.</p><p>“Okay, let’s bowl!” said the mayor. And so they did.</p><p>The total scores after three games would determine the overall champion of the tournament. After the first two games were played, Al was in second place, trailing Bosco by only two pins.</p><p>Since Bosco first won the tournament six years earlier, nobody had even finished a close second. The tight match made the crowd excited.</p><p>It wasn’t that the crowd was rooting for Al, as much as they were rooting against Bosco.</p><p>Bosco, meanwhile, was growing concerned about Al’s strong performance, so he decided it was time to distance himself from his closest competitor.</p><p>As the third and final game was about to begin, Bosco snuck up behind Al and poured water on the floor behind him.</p><p>When Al turned around he slipped and fell face-first. In the fall, Al hurt not one, but both of his hands. The crowd was silent as Al grimaced in pain.</p><p>“You should learn to be more careful, gator,” said Bosco, laughing.</p><p>“Bosco, you behave yourself, or I’ll have you thrown out of this tournament,” said the mayor.</p><p>“I just want to make sure he’s alright,” said Bosco sarcastically.</p><p>The mayor asked Al if he could continue. Al told the mayor that he would finish the tournament, but stated that his hands were hurting too much to use.</p><p>Puzzled by Al’s remark, the mayor asked, “How on earth can you play then?”</p><p>Al whispered something in the mayor’s ear, which caused him to laugh out loud.</p><p>“I see,” said the mayor. “Very well then, let’s finish this tournament.”</p><p>As the final game was about to begin, a voice from the crowd shouted, “You can do it, Al! You can beat him.”</p><p>The same little girl who had asked Al his name was the one rooting him on. Al smiled at the little girl and then picked up his bowling ball – with his tail!</p><p>“What is he doing?” asked Bosco aloud.</p><p>And then to the amazement of everyone in the bowling alley, Al sprinted toward the lane with his bowling ball dangling from his tail. He released the ball and threw a perfect strike.</p><p>Bosco couldn’t believe it. Nobody could, for that matter. Al’s tail provided a powerful grip which enabled him to throw his bowling ball with much more ease and accuracy. Bosco was outraged, but the mayor informed him there were no rules stating one couldn’t use a tail to throw their bowling ball.</p><p>The final game wasn’t even close.  Al easily beat Bosco and was declared the winner of the tournament.</p><p>Even though everyone was happy Bosco didn’t win the championship again, most folks didn’t know how to react to an alligator winning either.  But that didn’t bother Al. To him it wasn’t about winning or losing; all he ever wanted was a chance to play. As he was exiting the bowling alley, the little girl who had rooted Al on pleaded to have her picture taken with him.</p><p>Al was happy to do so, and after the little girl’s mom reluctantly agreed to her daughter’s wishes, the picture was taken.</p><p>Had it not been for that picture, nobody outside of Belvar would have ever believed the myth.</p><p>To this day the people of Belvar still ponder what happened to Al. Is he living in a swamp somewhere? Will he ever come back? Does he still bowl?  One thing is for sure though, on one night in the summer in Belvar, an alligator bowled with the best of them – and won.</p><img src='https://xcx.mdavid.cn/img/AL-opt.jpg'></img><p>Whenever a visitor in town doubts the legend, they’re always directed to a hall inside Belvar’s bowling alley. The hall is nicknamed Alligator Alley, and it’s filled with trophies bearing the name of each winner of the Belvar Bowling Championship.  There is also a picture hanging in the center of the hall that always seems to grab people’s attention. </p>"}