{"title": "Althea’s Journey Home", "author": "Reyna Hurand", "level": "6 to 8,9 to12,Teen,", "category": "Fairy Tale,Fantasy,Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>My name is Althea. I am a young scribe from Malcrest, a small village at the edge of the kingdom. I have not seen my family in over two years. I remember the gentle voice of my mother, the strong embrace of my father, and the unconditional bond I share with my brother. My heart aches for them.</p><p>I had been traveling across the sea with a troupe of other young scribes, when a horrific storm, fed by the powers of a malevolent wizard in the north, struck our vessel. Our ship has sunk, leaving me the sole survivor. I am unaccompanied now, helpless and hollow. The pain I feel inside from losing my companions is not quite as strong to the commitment I have to returning home. I have been through too many hardships to give up now. Not only would my family be disappointed, I would be disgraced with myself. They are what keep me going.</p><p>It is dawn now and I have washed ashore to a place I am unfamiliar with. The ocean in front of me seems large and endless, as if I’ll never find my way back to the edge of the kingdom. Being so alone and isolated discourages me. However, I know with the help of enchanters throughout the land, I will be safe.</p><p>As I trudge across the soft sand of this strange island, I glance around at all the surroundings. The sky is becoming darker, with a slight hint of pink. I see the sun setting in the distance, nearly invisible. The breeze rushes through my hair and the trees lining the island. The sound of the waves lapping against the coast comforts me, as I lay underneath a small tree, curl up, and slowly drift into a slumber.</p><p>Awake and determined the next morning, I gather some resources from the nearby forest and start to build a raft. Breaking a sweat, I construct it just large enough to carry myself. The sun above seems to focus only on me, until suddenly, a shadow emerges. I slowly glance up and see a woman standing and smiling at me. Her teeth are a pearly white, nearly glowing and blinding my eyes, her hair shiny like a new coin. Her brown curls dance around in the wind. She is beautiful.</p><p>“Hello Althea. Fancy meeting you here,” she announces. Her voice is soft, yet strong, her smile never waning. I force a grimace, still listening. “I am Larissa, Enchantress of Lilies,” she continues, tilting her head slightly to the left, revealing a pale pink lily in her hair. I look down and notice she is wearing a white dress, her accessories all related to the exquisite flower. I bow my head and warily begin to speak.</p><p>“It is a pleasure. I did not know there was such a sorceress, but I’m grateful nonetheless. Tell me, is there anything I can do?” I reply, loud and sincere. Larissa snickers.</p><p>“It seems as if you have done enough, Althea. There have been times throughout your life when you have disrespected many enchanters, some being my relatives. Do you really deserve to return to Malcrest? You’re a hero, yet so naïve as to not know who I am and where I stand. I do come across as gentle, but it is my duty to put you to the test. Yes, you are stronger and wiser than your acquaintances ever were. But let’s see if you can succeed without them by your side. Let’s see how much you love your dear family. The only advice I give is that you leave this island right away and continue to seek getting home to Malcrest. Use your wisdom to guide you through these rough waters. And you will soon see what is in store,” Larissa declares. She politely smiles at me once more, turns around, and vanishes.</p><p>I don’t waste a moment after she is gone. I know I have to gain her full respect. So, I push my small boat across the sand into the calm waters, leap on, and sail off into the never-ending sea.</p><p>A few hours drag on and I am still drifting effortlessly west. I am familiar with the land and know exactly where I’m going. I feel very secure. Malcrest remains miles away, but I can still practically smell it. I can hear the crackling fires of my people cooking supper and children’s laughter in the distance; that familiar comfort is all in my reach. But, why isn’t anything happening? Larissa said she was to put me to the test, assessing my power as a hero and my strength to return home. I must stay prepared.</p><p>Suddenly and without warning, water splashes over my face, as my petite, wooden craft nearly flips over. I seize one of my oars to keep balance, lean over the edge and come face to face with a rare, unsettling creature. It has more eyes on it than I can count. It’s certainly not related to the Cyclopes. It has a round head, a long, squiggly body and its color is a pale pink, much similar to the lily in Larissa’s flowing hair. I don’t know what to think. I am panicking, my heart racing faster than an oxen cart.</p><p>Then suddenly, it is very clear; this is the sign Larissa is sending me. This is the test. And in order to return to Malcrest, I must pass it.</p><p>The creature seems harmless, yet it still splashes vigorously, nearly destroying my raft. I think long and hard, wondering. Larissa had stated that she herself looked gentle, but everything is not what it seems. She is the Enchantress of Lilies, a charmer of nature and nature was not to be harmed or destroyed. I have a strong love towards the land and destroying any part of it is something I will never do. I have to trust my instincts, no matter how afraid I am.</p><p>“I must not harm you or fight back. I may be wrong and you may not understand me at all. But, if you must take me now, do it quick. I am not giving up, I am simply strong enough to let go,” I declare, gazing at the creature. It continues to destroy parts of my weak craft and splash around. I still don’t know if this is the right thing to do, sitting here, closing my eyes, and simply not disturbing nature and its inhabitants. What if this “harmless” creature could actually do quite a lot of harm? Is fighting always the answer? If this is the test and I am failing, so be it.</p><p>Prepared to die, I let one tear fall from my eye as I picture my family and never being able to see them again. All of a sudden, I am covered by another shadow, and the wild splashing in the water ceases. I look up, my eyes full of tears, to find Larissa’s glowing, flawless face.</p><p>“Althea,” she starts, staring into my eyes. “You are a true hero, not only strong and substantial, but caring and insightful. I see the longing in your eyes for your family. And I realize the learned concern you have for nature. I am pleased to say that you have proven your loyalty to sorcerers and sorceresses everywhere. Many act without thinking. Too many feed warfare and violence with more hostility. You have learned to overcome that violence with peace. And I’m here to thank you for that, and to grant you home to Malcrest,” Larissa pronounces. I notice her eyes shining with happiness and her teeth radiating even more.</p><p>I smile, my heart warming, still longing for my family and my homeland. I watch slowly, as Larissa, Enchantress of Lilies disappears once more. Still joyful, and a bit dazed, I continue to sail on. Malcrest is in my reach. I can feel it.</p><p>Navigating across the calm waters, I close my eyes. I picture my sweet family and the people of my village in front of me, their faces illuminating the moment they see me. I take them in an embrace and we all cry in joy. I open my eyes, draw a weary breath, and continue sailing.</p><p>I will be home very soon.</p>"}