{"title": "Amber, the little traffic light", "author": "Denise McCabe", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>One day Amber the traffic light was feeling sad.</p><p>‘Why are you sad?’ asked Little Red Car.</p><p>‘I’m sad because my friends Green Light and Red Light have the best jobs.  Everyone loves Red so much that they stop and stare at him for a long time. When Green comes along, he lights up and says, ‘Go’ everyone listens to him before they whizz off. Nobody really knows I’m here. Sometimes they will look at me quickly but they prefer to listen to Green and Red.’</p><p>‘That’s not true,’ replied Little Red Car, ‘every job is important.’</p><p>‘Amber, will you stop talking to that car?’ shouted Green. ‘I have just lit up and it needs to move.’</p><p>‘Oh Green, are you still going on about your brightness, sure you know people would love to stare at me all day,’ boasted Red.</p><p>Day after day, Green and Red argued about who had the best job.  Amber wished that they didn’t fight all the time. Green and Red didn’t even know what job Amber did.</p><p>It was the day of the annual farmer’s truck competition and the traffic got really busy because lots of trucks carrying bales of hay go through the town.  The traffic lights get really excited about this as it means they have to work extra hard that day.</p><p>Amber loves it because she gets to see all the different trucks.  They come in funny shapes and sizes.  She especially wanted to see Dodge the Truck.  He was always nice to her.  He didn’t carry as much hay as the rest of them so he always had time to talk.</p><p>The roar of the engines was heard in the distance.</p><p>‘Ok, I am going to light up first,’ announced Red. ‘We don’t want those other lights at junction Cropper thinking we can’t do this.  I want all the new trucks seeing me.’</p><p>Amber looked at the trucks coming down the road.  It was the finest parade she had ever seen. All the trucks were gleaming and smiling proudly.</p><p>‘Hello Amber, how are you?’ Dodge said, as he pulled up.</p><p>Amber opened her mouth to reply but Green started shouting, ‘Come along now Dodge, it’s my turn to light up and we need to keep the traffic moving.’</p><p>‘Hang on,’ said Red, ‘I was being looked at, it’s not your turn.’</p><p>Green closed his eyes and puffed out his cheeks.  ‘I’ll show you how bright I can get.’  He lit up as bright as he could. ‘Now, you all need to move along,’ he ordered.</p><p>The trucks smiled at Green and began to move along.</p><p>‘Wait there!’ demanded Red.</p><p>He did the same and lit up as bright as he could.</p><p>Dodge was the first to see Red as he was in front of the line. He tried to stop but his wheels kept moving.</p><p>‘Oh no, I’m going to meet the other trucks at the junction,’ he cried.</p><p>Next thing Dodge crashed into the biggest truck of hay coming along the opposite side of him. The hay from the truck tipped over him and covered his windows.</p><p>‘Now look what you did,’ Red yelled to Green, ‘I told you it was my turn.’</p><p>‘You did that,’ snapped Green, ‘I’ll show you how it’s done.’</p><p>Green started to light up but instead his light began to fade.</p><p>‘Hah,’ snorted Red, ‘you can’t light up as much as me.  This is how it’s done.’</p><p>Red closed his eyes and tried to light up but it didn’t work either.</p><p>Amber was watching and became worried. Red and Green’s lights were starting to disappear completely. She had to do something, but what? She was only amber light, so who would listen to her?</p><p>‘Hey what are we supposed to do?’ shouted a steam truck.  ‘Should we move or stay?’</p><p>‘I think we should see what Amber has in mind!’ Dodge yelled out.</p><p>The noise of the horns was getting louder. There was hay everywhere and trucks all piled on top of each other.</p><p>Amber could hear Dodge’s voice, ‘Amber, quick you need to do something!’</p><p>‘What can I do?’ she asked.</p><p>‘You need to turn your light on so we know to slow down.’</p><p>‘But…but no one ever looks at me as they are always too busy looking at Green and Red.’</p><p>‘That’s not true,’ replied Dodge. All the traffic lights have an important job. ‘We look at Amber so we know when to slow down and we know Red is next and we need to stop.  Then we wait for Green so we can go again. You need to shine now and tell everyone to slow down.’</p><p>‘Ok, I will try,’ said Amber.</p><p>Amber closed her eyes and puffed out her cheeks.  She could feel her light shining. ‘Ok, this is it,’ she thought. ‘I know I can do this.  This is what I’ve always been practising.’</p><p>She could hear Dodge calling out, ‘Now everybody, please watch Amber and listen to her carefully.’</p><p>When Amber opened her eyes, she was amazed when she saw that she was finally being watched and that the cars were slowing down</p><p>‘Ok cars,’ she said, ‘keep watching me, and slow your engines down and listen to me carefully, as this is where Red would usually come in and tell you to stop.’</p><p>One by one the trucks started to slow down.  Eventually they slowed down so much that their engines finally stopped.</p><p>‘Great job everyone,’ Amber praised. ‘Now cars, you need to wait here for a bit and let the cars move across at junction Cropper.  Next is where Green would usually tell you to go, but make sure all the cars are completely stopped and there is nothing in your way before you move on though.’</p><p>One by one, the cars at junction Cropper started to move slowly and make their way down the road.</p><p>All the trucks cheered, ‘Hooray! Thank you Amber for showing us what to do.’</p><p>Just then Green and Red’s lights started to light up a bit.</p><p>‘Amber, you saved the day!’ cried Green.</p><p>‘Yes,’ added Red, ‘I suppose you were good at your job today.’</p><p>‘Thank you,’ squealed Amber. ‘Now I know why all the traffic lights are important.  I do get looked at after all!’</p><p>From that day on Amber was never sad again.</p>"}