{"title": "Ashra’s Wish", "author": "Clare O'Dea", "level": "6 to 8,9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Scrape, scrape whoosh. Scrape, scrape whoosh. It was early in the village and most people were either still in bed or just having their breakfast. The old man stopped to listen, leaning against a high garden fence. He knew that sound very well; it was the sound of a carpenter planing wood. His father had used the same tool countless times, leaning and pushing with both hands. As a boy, the sight of those delicate shavings of wood curling up and falling to the ground always pleased him and he used to gather handfuls to play with. He remembered being asked by his father to touch the smooth wood after the planing was done. It felt beautiful. Even his father, who usually didn’t like what he called ‘soft talk,’ agreed and they would share a smile.</p><p>The old man pushed himself straight again and walked over to the workshop where the sound was coming from. He stood at the open door and watched patiently until the carpenter noticed him. ‘Good morning to you,’ the old man said. His voice was gravelly from not speaking for so long. The carpenter placed the hand planer down carefully and prepared to be friendly.</p><p>‘I’m sorry to interrupt your work. I see you are using the old tools,’ the old man continued.</p><p>‘Nothing electric here, my friend,’ the carpenter answered in a foreign accent.</p><p>The old man swayed a little and reached a hand out to steady himself against the door frame. The carpenter noticed and went to him, leading his visitor over to a bench in the corner. ‘My legs are getting weak or maybe it’s my balance. Oh dear, I have many miles left to travel.’</p><p>The carpenter fetched a glass of water for the old man and looked at him carefully. ‘If you don’t mind me saying, you seem like the perfect customer for a walking stick.’</p><p>The old man frowned. ‘I never saw myself as a person with a walking stick. I’ve always been so strong and fast. You know I used to win races when I was young.’</p><p>‘I can picture that,’ the carpenter said, folding his arms and stepping back. ‘But what a pity you do not want a walking stick, because I have the perfect piece of wood for you. I’ve been saving it.’</p><p>The old man seemed a little uneasy. ‘I suppose I could have a look now and come back on a day when I have cash,’ he said. The carpenter smiled. ‘Some jobs are not done for money,’ he said.</p><p>The carpenter was busy but he put his other work aside and quickly finished a stick for his visitor. He made the handle smooth so the stick would be comfortable to lean on and he carved a simple pattern so that it would be nice to look at.</p><p>While the old man waited he drank some more water and ate a scone from the carpenter’s kitchen. Soon he felt the strength returning to his body. The old man thanked the carpenter for his generosity and tried out the handsome new stick, grinning as he strode up and down the room. Just as he turned to leave, he asked: ‘What will you work on next?’</p><p>The carpenter showed him some pale cut wood, the pieces of a chair he had prepared earlier. The old man touched the wood and said: ‘You have shown me kindness. I wish you good fortune in your work. Do you think you could keep the next piece for yourself?’</p><p>‘Better than that,’ the carpenter said. ‘This wood is ash and with it I will make a chair for my daughter Ashra.’ The old man shook hands with the carpenter and wished him well, continuing on his way more surefooted with his stick.</p><p>The carpenter was pleased to have helped the old man and set to work on the chair. It took three days to finish, in between other jobs, and he was pleased with the result.</p><p>Ashra clapped her hands with delight when she saw the pretty little chair in the kitchen on the morning of her birthday. It was just the right size for her, with a seat that could be adjusted as she grew. She knew it had to be meant for her and she ran to her father, almost knocking him over with a big hug.</p><p>Some days later Ashra was sitting at the kitchen table drawing a picture. As usual, she had to manage without the colour red. She had lost the red colouring pencil on the very day she received the set of twelve colours months before. Speaking out loud, she said: ‘This slide should be red; I wish I could find that colouring pencil’. She looked in the tin box for orange instead of red and stopped with a jolt. There lined up in the box was the complete set of twelve colours, including red. Someone must have found it and put it in there but who and when? She was sure one colour was missing when she started colouring and she hadn’t left the table since. Ashra called to her parents but they were outside in the garden and didn’t hear her. She decided not to worry about it and happily coloured the slide in red.</p><p>That evening at dinner Ashra asked if there were strawberries for dessert. She often asked for strawberries, even in winter, because that was her favourite fruit. ‘No my love,’ her mother said. ‘Ask me again in June.’ Ashra sighed and said: ‘I wish we did have strawberries.’</p><p>‘Let me check the fridge for yoghurts,’ her father said, getting up from the table. ‘But there are strawberries here,’ the carpenter exclaimed, turning with a bowl in his hands. Ashra’s parents spent the rest of the evening trying to work out how the strawberries had got into the fridge but by bedtime they gave up trying to solve the mystery. They all agreed the strawberries were delicious.</p><p>That weekend Ashra was having an afternoon snack in the kitchen with her friend Luke. It was raining outside, the kind of cold grey weather that makes you want to stay indoors. Ashra had been reading a book about a little girl who lived in Switzerland and went to school by sledge in the winter. ‘It’s a pity we hardly ever get snow here. We could have such a great time playing in the snow,’ she said. ‘Oh yes,’ said Luke, ‘I love snow.’ Just then the doorbell rang. Ashra went to answer it and there was her neighbour Finn brushing fresh snowflakes off his jacket. ‘Snow,’ he said. ‘Can you believe it?’ Ashra walked outside followed by Luke.</p><p>The children stood on the road and Ashra turned her face to the sky letting the snowflakes land on her cheeks and eyelids. She started to get a funny feeling. It seemed everything she wished for recently came true. Why was she so lucky all of a sudden?</p><p>When the other children had gone home Ashra went into her room for a moment. She saw what she always saw: a total mess – clothes spilling out of the drawers, toys and books scattered on the floor and all sorts of bric-a-brac crowded onto her bedside table. Feeling a little silly, Ashra spoke out loud: ‘I wish this room was tidy’. She waited, holding her breath and looking around with wide eyes. Nothing happened. On to part two of the experiment. Ashra went down to the kitchen and sat on her new chair. She repeated her wish and counted to a hundred. Then slowly she went back upstairs, almost afraid to check her room.</p><p>When she stood in the doorway she could not believe her eyes. She blinked and blinked as she walked around the room with baby steps. The space was immaculate. She pulled open each drawer of her chest of drawers to find neatly folded clothes. The floor was clear for the first time ever and all of her special things – pens, notebooks, shells, figurines, plastic jewellery and pebbles – were nicely arranged on her bedside table. Ashra sat down on the bed and stayed there for a long time, thinking. She was very still on the surface but in her mind the ideas were racing around and bumping into each other.</p><p>Ashra waited until her parents were watching the evening news on television. Over dinner she had asked her father to describe how he made the chair for her. He seemed pleased that she was so interested in his work. Ashra took a folded piece of paper out of her pocket and opened it out on the table. It was a carefully worded wish she had written earlier.</p><p>Ashra spoke her wish quietly and sat back to watch the kitchen clock. If you looked really carefully you could see the minute hand edge from one minute to the next. Two minutes went by, then three. She heard her parents shout. They were calling for her and in their voices she detected a strange excitement. Ashra pushed open the door to the sitting room and squeezed in between her parents on the sofa. ‘You have to see this darling,’ her mother said, clutching Ashra’s arm and leaning closer to the television. Her father was laughing and calling out: ‘It’s over, it’s over!’</p><p>All her life Ashra had heard about the war in her home country. She was only a toddler when it started but when she closed her eyes she could remember the noise and the fear and the smell of those terrifying last days before they left. Her parents never missed the news and she knew they needed to see those reports from home as much as they dreaded them. As her parents kissed and hugged her, their faces wet with tears, Ashra smiled a new smile, the smile of peace.</p>"}