{"title": "The Baby", "author": "Carol Bennett", "level": "9 to12,", "category": "Christmas,Original,", "tag": "", "length": "15 - 20 mins,", "body": "<p>“Leah!  Go to the door!  Whoever it is, tell them there’s no more room!”</p><p>Leah ran quickly to do her father’s bidding. The thick door had been locked and barred to discourage new customers. Leah’s father, the innkeeper, was tired of explaining that the inn was overcrowded — that there just wasn’t any room anywhere.</p><p>Even the tiny room where Leah and her sister slept had been taken for guests. They would be sleeping downstairs by the fire this night. But travelers still kept coming, pounding on the door, begging for lodging.</p><p>“Open the door, girl!  Lazy — that’s what ya are!”</p><p>Leah struggled with the heavy wooden bar and finally succeeded in swinging the door inward.</p><p>“I’m sorry, there’s no room….” she began.</p><p>“Please,” said the man urgently. “We need a place quickly. Anything. My wife needs to lie down.”</p><p>“Every room is taken, sir.”</p><p>“Might I see the innkeeper?  It’s very important.”</p><p>Leah hesitated, knowing that her father would be angry if she let the man in. Then Leah saw the woman on the donkey. Even in the dim light, Leah could see the weariness in her face. In the seconds that Leah was preoccupied with watching her, the husband slipped by her into the building.</p><p>“Wait!”</p><p>“She told you there is no room here!” roared Leah’s father.</p><p>“Please. It’s nearly dark and we have come a very long way….”</p><p>“We all have come a long way!” shouted one man.</p><p>“But my wife is with child,” the stranger pleaded.</p><p>Many of the customers turned to listen. Leah’s mother was making her way between the tables with a tray of food. She thrust the tray into Leah’s hands, then placed her hands on her hips.</p><p>“With child!  We don’t want the woman here!  We’ve got all we can handle now!”</p><p>Leah listened to the conversation as she served the food. She wished that someone would be willing to double up for the sake of the pregnant lady but nobody offered.</p><p>“What about the little shelter that I saw in back?  Is it the stable?  Couldn’t we stay there?  I will pay, of course.”</p><p>“No!” Leah’s mother exclaimed. “I’ll not have the woman here. What if she has her baby?”</p><p>But Leah recognized the greedy look that came into her father’s eyes. She had seen it many times before.</p><p>“Well….” the innkeeper said thoughtfully, “I suppose I could let you stay out there if you’re willing to pay. But we can’t wait on you. We’re too busy as it is.”</p><p>The stranger’s face showed his great relief as he turned to go. “Thank you. We won’t be any trouble.”</p><p>“Wait!” Leah’s father shouted. “I want my money now!  I don’t want ya sneakin’ off in the night without paying.”</p><p>The stranger wearily opened his pouch and handed over the coins, then went out.</p><p>“Get back to work!” Leah felt her mother’s large hand gripping her shoulder and she was shoved into the kitchen area. Leah, knowing that her mother was furious with the arrangement, ducked out of her reach. It wasn’t unusual for the woman to take her frustrations out on the girls.</p><p>“If she has that baby, they’ll get no help from us. We have enough to do. And they needn’t think they will get service out there either,” the woman muttered as she picked up a tray of bread and disappeared into the main room.</p><p>Leah pounced on her older sister with the news. “Naomi!  There’s a woman with child outside! In the stable!”</p><p>“I know. I heard.”  Naomi was a slender, pretty, fifteen year old. She stooped before the fire, stirring the stew that was cooking in a large pot. “They certainly paid enough to be able to have a little food. I’ll give you some to take out later.”</p><p>“The woman looked very tired. I’ll get some blankets for them. It’s cold tonight.”</p><p style=\"text-align: center;\">***</p><p>Hours of work loomed ahead. There was plenty to be done with so many customers in the inn. There was meat to be roasted, bread to be set, meals to be served, dishes to be washed. But Naomi’s fingers flew to make up for Leah’s absence.</p><p>The younger girl made her way to the stable, arms piled with blankets which she had taken from other customers’ beds, one from this room, another from that. They had plenty. They wouldn’t miss them. Or if they did, she didn’t care. The inn was drafty but certainly much warmer than the stable. She even brought cushions from her own pallet. The cushions were old and shabby but she was sure that the couple wouldn’t mind.</p><p>Leah found the man trying to make his wife comfortable. He had arranged a pile of hay and covered it with a blanket that they had brought from home. The woman was shivering as she lay wrapped in another blanket. Apparently, they had only brought two, not expecting to have to sleep in a cold barn.</p><p>Leah struggled to close the door against the wind and the man came quickly to help her.</p><p>“Here are blankets,” Leah said, moving to the corner where the woman lay.</p><p>The woman was very pretty and not much older than Naomi.</p><p>“Thank you,” she whispered as Leah lifted her up and placed a cushion under her head.</p><p>The man covered her with the blankets and tucked them in securely.</p><p>“You should keep one for yourself, Joseph,” the woman said, weakly.</p><p>“I’ll be fine,” her husband told her. Then he turned to Leah. “Tell your father we are grateful.”</p><p>“He doesn’t know, sir. Nor my mother. I’ll bring you some food later.”</p><p>The man understood immediately. “Then we are grateful to you. But any food you bring, I will pay for.”</p><p>A slight groan brought their attention back to the woman. Leah saw that her face was distorted with pain.</p><p>“Joseph,” she said quietly, “It’s time.”</p><p>Joseph’s eyes widened in horror. “Now…here?”</p><p>Leah stood frozen to the spot. The woman was going to have her baby in their stable!  Joseph dropped to his knees beside his wife.</p><p>“This can’t be,” he murmured.</p><p>Another spasm of pain caused her to squeeze his hands tightly. “You should get some help, Joseph,” she whispered.</p><p>“Yes, of course!” He sprang to his feet and addressed Leah. “Is there a midwife?”</p><p>“Yes. My mother can tell you where to find her.”</p><p>Leah dashed back to the inn and burst through the side door. Her mother and sister were busy making meat pastries.</p><p>“Where have you been?” her mother snapped.</p><p>“Mother! The lady is having her baby!”</p><p>Leah’s mother placed her hands on her hips, her usual stance when she was angry. “There! Didn’t I say this would happen?  They can fend for themselves.”</p><p>“Oh, but Mother!  Please….” pleaded Naomi.</p><p>“Can’t I run for the midwife?” asked Leah.</p><p>“No! You’re needed here. Don’t you see that crowd out there?  Besides, she’s ill and of course we have no doctor.”</p><p>“There must be someone somewhere!” cried Leah, hysterically.</p><p>Naomi calmed her little sister with a look. “Please, Mother,” she said quietly. “The woman is away from home in a strange town. It isn’t her fault that Caesar decreed the registration now. And they did pay very well.”</p><p>But Naomi was wasting her time. Their mother set her lips stubbornly and continued twisting the dough and plumping it up firmly. Help, however, came from another source.</p><p>“What’s all the noise in here!  And where is the food?”</p><p>“Father!” Leah said, quickly. “The woman is having her baby!”</p><p>“What’s that to me?  Go out there and serve the customers!  They’re waiting!”</p><p>“Father,” put in Naomi, “They are customers and they’ve paid well. What will  our reputation be if the baby dies?”</p><p>Silence filled the room as the greedy man mulled that thought over. Leah wondered what their  reputation would be if people knew they had put a woman with child in the stable but she said nothing.</p><p>“Babies die all the time!” Leah’s mother finally broke the silence. “It’s not our concern.”</p><p>But the innkeeper had made his decision. “Go help her.”</p><p>“But….”</p><p>“Go.”  He walked out of the room, back to his wine and customers.</p><p>Naomi received a stinging blow across the face for her efforts toward the little family in the stable. Leah knew it hurt but as their mother headed out in a huff, Naomi  sprang into action to collect what was needed for the birthing.</p><p>“Go quickly with water,” said Naomi. “I’ll heat some more.”</p><p>Outside, Leah looked up at the stars for just a second. How beautiful they were tonight. And there was one that was so very bright.</p><p>She didn’t linger long, for as beautiful as it was, the night was very chilly and the wind whipped her robes. And the lady needed her help. She hurried on to the stable with the bucket of water and several towels. She handed over the supplies and paused a moment at the sight of the pregnant woman’s pale, twisted face.</p><p>Joseph paced just inside the door, stopping now and then to absentmindedly pat the handsome horse of a wealthy customer or feed his donkey a handful of hay. Then he would wring his hands and pace some more.</p><p>Leah hesitated, knowing that a little girl shouldn’t address a grown man. Most men didn’t even acknowledge women in public but she thought that such a kind man wouldn’t mind.</p><p>“Sir, what is your wife’s name?”  She had been wondering ever since the couple had arrived.</p><p>He stopped pacing and smiled at her. “Her name is Mary,” he answered, as if the very thought of his beloved wife brought joy.</p><p>“She will be well,” Leah assured him.</p><p style=\"text-align: center;\">***</p><p>Hours later, Leah and Naomi crept out to the stable. Their mother had gone to her room, blustering that it was finally over and that she was ready for a good night’s sleep. She had told them that no one was to disturb her for anything.</p><p>Naomi held a bowl of soup carefully and Leah carried bread and meat for Joseph. The man had refused to eat, refused to leave the stable throughout the long birth. The innkeeper was disgusted for he had hoped that the man would come in and buy much wine in celebration of his newborn son.</p><p>“May we see him?” asked Leah as they entered.</p><p>Joseph nodded happily and motioned toward the corner.</p><p>In the shadows they saw Mary lying in her hollow of hay and blankets. Her face was white and pinched but she smiled weakly. Nestled in her arms was the tiny baby, wrapped tightly in swaddling cloths so that only his little red face could be seen. He was sound asleep. Leah knelt down and touched his cheek very lightly.</p><p>“Let Naomi hold the baby,” said Joseph to his wife. “You must eat this while it’s hot.”</p><p>Naomi took the baby so gently that he hardly stirred.</p><p>“He’s so beautiful,” she crooned as she cradled the infant. “I’ve never seen a newborn before.”</p><p>Joseph lifted Mary up while Leah held the bowl of soup for her. The woman was so weary that she couldn’t even finish.</p><p>“We’ll bring you some more later,” said Leah as Joseph gently eased his wife down again.</p><p>“What shall we do with the child?” he asked. “You need to sleep.”</p><p>They thought for a moment. Then Mary murmured with a weak wave of her hand, “The manger. He will be safe there.”</p><p>“A good idea.”  Joseph carried the wooden trough over.</p><p>Leah helped him clean it out and went to fetch fresh straw. They arranged a blanket so that the prickly straw would not even touch the baby. Then Naomi laid the infant in the trough. They all watched as his mouth pursed as if to cry, then closed again. His eyes never even opened.</p><p>“He’s so wonderful,” murmured Naomi. Then she shook her head angrily and turned to Joseph. “What a place for a baby!  How I wish it could have been different. We would gladly have given our room if it hadn’t already been taken. It’s very small but at least it’s clean.”</p><p>Joseph stopped her outburst. “We’re not angry with your father. We are grateful even for this stable. Mary was sure that Jehovah would provide a place.”  He lifted his hand toward the bruise on her cheek. “Your sister tells us you convinced them that we needed help.”</p><p>Naomi turned back to the manger, embarrassed now. Then she smiled as she watched the baby sleep. “He looks like a little prince, doesn’t he?  Even in this dirty, smelly place.”</p><p>Joseph and Mary glanced at each other, as if startled by the remark. Leah wondered about it. It was as if they knew a secret. But the idea of pretending that the baby was a little prince appealed to her.</p><p>“He’s our prince,” she exclaimed. “Our very own little prince!  Please may we think of him as ours since he was born in our stable?”</p><p>Mary smiled. “Of course.”</p><p>“What is his name going to be?” asked Naomi. “Joseph, I suppose?”</p><p>“His name is Jesus,” said the father.</p><p>“A beautiful name for our little prince,” said Naomi. “Why it even means ‘Savior.’ ”  A sudden thought came to her and she added wistfully, “wouldn’t it be wonderful if he really were a prince…our Messiah…come to save us from our captors?  But how foolish…the Messiah born in a stable. Though the Scriptures do say he is to be born in Bethlehem….”</p><p>Joseph listened to her musings, then said. “That is true.” He took a deep breath, “Naomi, he is the Savior—”</p><p>The door opened just then as a guest came in to care for his animal and Joseph fell silent.</p><p>“We should go,” said Naomi. “You need to sleep, too.”</p><p>“I am weary,” he admitted. “It’s been a very long day but I am thankful for Jehovah’s great care for Mary and I and the little one. And God has used you to help us. We are grateful.”</p><p>He looked over at Mary and they found that she was sound asleep.</p><p style=\"text-align: center;\">***</p><p>The girls tiptoed out. All the way across the courtyard, Leah felt such happiness in her heart at the thought of the little baby inside but suddenly, she heard a loud commotion. It seemed to be coming from out on the street, right in front of the inn. Sure enough, she heard loud pounding on the front door.</p><p>“Drunken men!” said Naomi in disgust, “All that noise! Mary and the baby will be sure to wake up!”</p><p>She headed for the front of the inn, determined.</p><p>Leah, realizing what her sister was planning, ran after her. “Naomi! Wait!”</p><p>She knew that if the drunken men became angry, Naomi might be hurt.</p><p>But when they reached the entrance to the inn, she realized that the voices were not raised in drunkenness but in excitement. The men were familiar to them, common working men, shepherds who should have been out in the hills, not in town at this time of night.</p><p>“What are they doing here?” Leah wondered aloud.</p><p>“Who’s taking care of the sheep?” added Naomi.</p><p>They listened as their father angrily opened the door.</p><p>“What is it! Can’t you see the sign on the door?  We have no room! Why, Jacob!  And Aram!  What are you doing here?  And why all the noise?  I have customers sleeping!”</p><p>One shepherd reached out and grasped his arm. “Answer us this! In your stable!  Is there anyone in your stable?”</p><p>“Is there a baby there?” burst out a boy about Naomi’s age.</p><p>Someone shushed the boy. “Tell us quickly. We’ve been all over town and no one knows of what we speak!”</p><p>“What are you speaking of?  Yes, there’s a baby out there. Travelers came at sunset and they agreed to stay in the stable. There’s no room anywhere else. You know how it is.”  The innkeeper shrugged his shoulders, as if suddenly fearful of his reputation.</p><p>Leah wondered how these men had ever found out. Did they know the baby was a newborn and that her father had allowed it all to happen out in the stable?</p><p>“What is this about?  I demand to know!”</p><p>But the shepherds were already heading for the stable, oblivious to the innkeeper’s shouts. They were talking among themselves.</p><p>“It’s true!”</p><p>“Just as they said!”</p><p>“A baby in a stable!  Who would have thought it?”</p><p>“Is he in the manger, I wonder?”</p><p>“Who said?” shouted Leah’s father. “How could you know this?”</p><p>One shepherd called back over his shoulder, “Angels told us!”</p><p>“Angels! They have gone mad!” said the innkeeper to several of his customers who had come out to see what was happening.</p><p>“What about angels?” asked one.</p><p>“I don’t know!” shouted the innkeeper. “But I’m going to find out!”  He rushed after the shepherds with his customers trailing along behind.</p><p>Leah stopped her friend Eliud, one of the younger shepherds.</p><p>“Eliud.” She grasped his arm, “What is it! What happened?”</p><p>Eliud was just a year or two older than Leah. His dark eyes were wide with excitement. “Angels, Leah! They filled the sky! We were terrified but they told us not to be afraid. They told us they had good news. That a savior had been born!”</p><p>Leah interrupted excitedly, “A savior!  Why, that’s what his name means!  They’re calling him Jesus!”</p><p>“They said we’d find him laying in a manger! That’s why we were looking in the stables! Come on! I want to see him!”</p><p>She hurried after him to see what was going on at the stable. When Leah reached the little building, everyone had already crowded in. They were all very quiet. They hadn’t awakened the baby. The men were just watching him sleep, looks of wonder and reverence on their faces. Mary was awake, however, and was sitting up, her robes drawn around her. After a few minutes, the shepherds told Joseph, in low tones, what had happened and Mary listened closely.</p><p>The shepherds stayed a long while. Eliud talked to Leah, telling in glowing terms about the multitude of angels who had been praising Jehovah and speaking of peace.</p><p>“Peace, Leah!” he told her excitedly. “The Messiah who will bring us peace. No more Romans! Israel will have freedom at last!”</p><p>Leah’s father and a few of the more drunken customers left before the shepherds did.</p><p>“Don’t ya want something to warm ya up, eh?” he had asked hopefully. “Angels!  Sounds like you need a little wine.”</p><p>“No! No! We want to spread the good news. Isn’t it wonderful?”</p><p>“Wonderful! It’s foolish! He’s just an ordinary little baby. And look at the parents. Poor and shabby as any of us. Angels! Bah!”</p><p>The innkeeper stalked out, angry that the shepherds weren’t going to give him any business, but some of the customers stayed and listened to the talk.</p><p>Finally, all was quiet. Leah watched as Eliud and the other shepherds left the courtyard, heading through town to tell the good news to everyone they met.</p><p>A few people whom they told did come to see the baby, but not many, for after all it was midnight.</p><p>When they were alone again, Naomi brought more food.</p><p>“Have some more soup, Mary,” said Joseph.</p><p>She was stronger now, able to hold the bowl herself and also to eat a chunk of bread. Then, at last, the infant woke and the girls heard his lusty cry for the first time.</p><p>“I hadn’t heard him cry before,” said Naomi.</p><p>“We heard him, didn’t we, Mary?  He has a good, strong voice.”</p><p>“You may get tired of his good, strong voice,” Mary laughed. “He’s hungry. Naomi, bring him to me.”</p><p>“Oh, please! May I?”  Leah begged. “I know how to carry a baby.”</p><p>“Yes, bring him,” Mary consented.</p><p>Leah approached the manger. She picked up the squalling baby. For just a moment, as Leah cradled him, he quieted, content with being held. Then he cried out again and Leah carefully placed him in the arms of his mother.</p><p>I have held the Messiah, she thought.</p><p>In that moment, she believed with all her heart what Eliud had said. Angelic messengers had proclaimed it. She didn’t understand why he was here in this stable as a tiny baby and not a grown man come from heaven to drive out Caesar from his palace. But she knew she didn’t need to understand.</p><p>“He’s the Messiah, isn’t he,” she whispered.</p><p>“The Messiah!” exclaimed Naomi. She had missed much of the discussion in the stable.</p><p>“Eliud said so,” Leah replied.“He told me that the angels called him ‘the Christ.’ ”</p><p>Naomi turned to the couple, her eyes wide with wonder. “I don’t understand. There was so much confusion and then my mother called me. I believe that angels came to them. They are honest men and wouldn’t lie but…is he really the Messiah?”</p><p>Joseph nodded slowly. “Many strange things have happened. Mary was visited by an angel and I was spoken to in a dream. Yes, he is the Messiah. There are things we don’t understand either. We only know that Jehovah has given us his Son to take care of.”</p><p>They all watched the wondrous infant as he lay, asleep again, in his mother’s arms, and wondered what it all meant.</p><p style=\"text-align: center;\">***</p><p>Later as the sisters lay beside the fire, Naomi said, “I’ve been trying to think who might be able to help Joseph and Mary. They can’t travel with a newborn baby, but they can’t stay in the stable either.”</p><p>Leah was almost asleep as she murmured, “What about Aunt Salome?”</p><p>Naomi sat up excitedly. “Of course! Why didn’t we think of her before. She could have taken them in and helped with the birthing. If only we had thought. Leah, you must go first thing and tell Aunt Salome about them. I hope that Uncle will agree.”</p><p>“He won’t object.”</p><p>Their uncle, the scribe, did not concern himself with the affairs of the household, as long as his meals were on time. Pretty, kind-hearted, Aunt Salome could have a houseful of guests and he wouldn’t care. The house was big and spacious and beautiful, as an important scribe like him could afford.</p><p>“It’s nearly sunrise. I might as well go now.”  Leah knew she would get no sleep anyway with Naomi so excited.</p><p style=\"text-align: center;\"><strong>***</strong></p><p>They were outside their uncle’s home. Leah kissed the tiny face one last time. Mary was up on the little donkey with Jesus in her arms and Joseph held the rope to guide the animal.</p><p>The couple were heading into the city of Jerusalem to visit the temple. They would then go home to Nazareth with a caravan of other travelers.</p><p>Leah knew she would probably never see her little prince again but she believed that he was a true prince — the Prince of Peace, as the Scriptures proclaimed. And she would be loyal to Him forever.</p><p> </p><p style=\"text-align: center;\">THE END</p>"}