{"title": "Beautiful Wild Rose Girl", "author": "William Hugel", "level": "6 to 8,9 to12,Teen,", "category": "Fairy Tale,Illustrated,Original,", "tag": "Frog,", "length": "10 - 15 mins,", "body": "<p>Illustrated by Jamila Keba</p><p>Once upon a time, there was a poor, sad girl who lived in a swamp. The swamp smelt awfully, was always cold and damp, and all night she had to listen to the Bullfrogs who sang to her: “Trooonk! Trooonk! Trooonk! What a stupid ugly girl! Trooonk! Trooonk! Trooonk! What a stupid ugly girl!”</p><p> Between the swamp and the nearest village lay a field of roses. These roses were fierce and wild, and more beautiful than any roses that could ever be grown in any garden. And so much were they more beautiful than other roses, so their thorns were more sharp and terrible. No one from the village dared to enter the field of wild roses, as they feared they would be torn to bits by the roses’ terrible thorns.</p><p>But the wild roses felt sorry for the poor swamp girl. They parted for her as she made her way to the village, and never once did they prick her flesh, or tear her clothing, as they didn’t want to increase the poor sad girl’s sorrow.</p><p>As she sadly moved among them, the roses perfumed her with their beautiful scent, to take away the awful smell of the swamp, and they allowed her to pick one small basket of them each morning on her way to the village.</p><p>Every day the poor swamp girl went to the village market to sell her wild roses. As they were so beautiful, and as no one else dared to pick them, for each of her roses she received a gold coin. And because she smelled so like her beautiful roses, she was known to everyone in the village as Beautiful Wild Rose Girl. And every man in the village swore that she was even more beautiful than the roses she sold.</p><p>But when gentleman approached her in the market, in hopes of winning her hand, and began by addressing her as “Beautiful Wild Rose Girl,” she heard instead “Stupid Ugly Swamp Girl,” and she lowered her eyes and said nothing and took a step back as she was sure she smelled like the awful swamp. Not knowing what to think the gentlemen went sadly away again, saying to themselves: “She is far too beautiful, she will never want to marry any one of us! All she does is stare at her roses because they are the only company good enough for her!”</p><p>Every morning the people of the village saw her come out of the field of roses, and every evening disappear back into it again, so they naturally assumed that she lived among them, and thought that she was the happiest girl in the world.</p><p>No one knew that beyond the field of wild roses lay the terrible swamp. No one knew, that after the market closed, the poor swamp girl, with her basket full of gold coins, made her way sadly back to the damp and the cold and the Bullfrogs who all night sang to her: “Trooonk! Trooonk! Trooonk! What A Stupid Ugly Girl! Trooonk Trooonk! Trooonk! What A Stupid Ugly Girl!”</p><p>Every evening the swamp girl took the gold coins out of her basket, and put them into a huge sack at the foot of an old tree. And every day the sack got fuller and fuller.</p><img src='https://xcx.mdavid.cn/img/1.-BWRG-under-tree-1280x895.jpg'></img><p>Now, in this same village, there lived a poor shepherd boy. This poor shepherd boy had no money. Nevertheless, he loved to pass through the market, and to look at all the things being sold, and at the crowds of people there. But he especially loved to look at the Beautiful Wild Rose Girl.</p><p>“If only I had a gold coin, and could buy one of these beautiful wild roses! Then the Beautiful Wild Rose Girl would have to lift up her head to me, and for one moment I could gaze into her eyes! Then I would take the wild rose into the field with me and it would be as if we were together… But I am a poor shepherd and I will never have a gold coin…”</p><p>Then, one day, a peculiar sort of thing happened. As the shepherd was passing through the market, a very peculiar sort of moth, perched itself on the poor shepherd boy’s small sack. The sack rested on his back, so that the shepherd didn’t know that the strange moth was there, and that it was about to eat through the sack to steal his bread.</p><p>But when the shepherd passed by the Beautiful Wild Rose Girl, and the moth heard the poor boy’s lament, and his hopeless wish for a gold coin, the strange moth said to himself: “I cannot steal the bread of such a poor boy as this.” Then he thought: “Among all the greedy men in the world, I have never heard such a pure and beautiful wish for a gold coin.”</p><p>The strange moth alighted from the poor shepherd’s sack, flew high into the air, and followed the shepherd boy into his field. There the moth sat all day on a wild reed, watching the boy as he looked after his sheep, and listening to him dreaming aloud about his love for the Beautiful Wild Rose Girl.</p><p>That evening, the moth followed him home, slept on the roof of his poor cottage, then flew with him back into his field. This went on for several days, until one evening, as they were returning from the field together, the moth, as he flew high above, spotted the opportunity he had been waiting for.</p><p>Just ahead of them on the little path, a rich man was making his way down from his castle. A fat sack of money was tied to his waist. The moth landed lightly on the rich man’s sack, and carefully nibbled a small hole. A hole just big enough to let fall one single gold coin.</p><p>The moth then settled onto the gold coin, and waited for the poor shepherd boy. Just as the boy reached him, the moth flew straight up, dancing wildly about in the shepherd’s face.</p><p>“What is it you want, wild moth?” asked the poor shepherd. The moth then dropped back down onto the gold coin.</p><p>“Is it really possible?” exclaimed the poor shepherd, his heart racing with joy. He reached down, picked up the gold coin, with the strange moth still perching on it, and stared in disbelief.</p><p>He was just about to ask the moth what he could do to thank him, when the mysterious moth flew away and disappeared into the sky.</p><img src='https://xcx.mdavid.cn/img/2.-edit-1280x894.jpg'></img><p>The shepherd ran the rest of the way to the market. When he reached the Beautiful Wild Rose Girl he found he was just in time: in her basket there was one single remaining rose.</p><p>“May I buy your last rose?” he asked breathlessly. The Beautiful Wild Rose Girl reached into her basket, carefully took out the last remaining rose, and handed it toward the poor shepherd. As she did she looked for a moment into his eyes.</p><p>The poor shepherd’s heart nearly broke. Tears came rushing into his eyes and before he could stop himself he cried: “But Beautiful Wild Rose Girl! Why do you look so awfully sad? What can be wrong within your beautiful world?”</p><p>Startled, the Beautiful Wild Rose Girl slowly put her last rose back into her basket. She stared down at it for a long time. Finally she said:</p><p>“What did you call me?”</p><p>“Beautiful Wild Rose Girl,” said the shepherd, blushing. “I hope you don’t mind…” “No. But… no one has ever called me that before.”</p><p>The shepherd boy laughed. “How is that possible? Do your lovely ears not hear? It’s how you are known to everyone in the village…”</p><p>The Beautiful Wild Rose Girl stared down at her last rose for a long time. Then, without lifting her eyes, she said sadly:</p><p>“I suppose it’s because I sell these beautiful roses…”</p><p>“Not at all!” cried the shepherd. “It’s because you alone live among the wild roses, and you alone are loved by them, and you alone are full of the same beautiful fragrance, and because…,” his voice was shaking again “…and because everyone agrees that you are even more beautiful than your wild roses…”</p><p>The Beautiful Wild Rose Girl was still staring silently down at her last remaining rose. When she finally looked up again she saw that the poor shepherd boy was still holding out his gold coin.</p><p>“Come back tomorrow evening,” she said. “And then you may have your rose.”</p><p>The poor shepherd raced back to his cottage. All night long he sat on his window ledge, dreaming about the Beautiful Wild Rose Girl. And all night long he stared out his window, toward the field of wild roses.</p><p>Meanwhile, the Beautiful Wild Rose Girl walked slowly out of the village. She passed through the field of wild roses. Then, reaching the swamp, she sat down under a tree. She placed her basket in her lap, the basket in which lay the shepherd’s wild rose.</p><p>The Bullfrogs in the swamp began singing to her.</p><p>But when they saw that she had brought a wild rose back to the swamp, they all came out of the water and gathered around her. The Beautiful Wild Rose Girl listened as they sang:</p><p>“Trooonk! Trooonk! Trooonk! How We’ll Miss Our Lovely Girl! Trooonk! Trooonk! Trooonk! How We’ll Miss Our Lovely Girl!”</p><p>The Beautiful Wild Rose Girl turned to the Frog nearest to her. “Why do you sing thus to me?” she asked him.</p><p>“We have always sung thus to you,” answered the Frog. “ It is a song of joy because you are here with us, and it is a song of sorrow because we knew that one day you would leave us. And because today you have brought this wild rose back to the swamp with you, we know that that day has come.”</p><p>“Yes, that day has come,” said the Beautiful Wild Rose Girl. “Before you go,” said the Frog, “will you do one thing for us?”</p><p>“Whatever you ask for,” she replied.</p><p>“Will you give each one of us poor Frogs a small kiss before you go? It will be a kiss the swamp water will never wash away. And then forever more our song will be the same: It will be a song of joy because you were once here with us, and it will be a song of sorrow because you are here no more.”</p><p>Then all the Frogs lined up, a long line of Frogs winding all around the swamp. The Beautiful Wild Rose Girl gave each one a small kiss, and after she had kissed each Frog it hopped away, back into the swamp. After she had kissed the last of the Bullfrogs the Beautiful Wild Rose Girl took up her heavy sack of gold coins and left the swamp forever. As she walked into the field of wild roses, she heard the Bullfrogs singing:</p><p>“Trooonk! Trooonk! Trooonk! How We Miss Our Lovely Girl! Trooonk Trooonk Trooonk! How We Miss Our Lovely Girl!”</p><img src='https://xcx.mdavid.cn/img/3.-BWRG-kissing-frogs-Large-1280x888.jpg'></img><p>The roses knew she would come, and made room for her as she lay down among them, closed her eyes, and fell asleep. As she slept the roses bathed her in their fragrance, forever taking away the awful smell of the swamp. When she woke in the morning she picked her last basket of wild roses, took her heavy sack of gold coins on her back, and left the field of wild roses forever.</p><p>The weight of the sack was so great that it took her much longer than usual to reach the market. When the shepherd boy rushed by in the early morning he despaired at not seeing her there. But he was a sensible boy and said to himself: Just have patience. She told me to come for my rose in the evening.</p><p>Reaching the market the Beautiful Wild Rose Girl hid the shepherd’s special rose under her basket. She sold out of her roses early, then waited behind her empty basket for the poor shepherd boy to return. Everyone who came to the market noticed her great sack, and they all wondered what could be inside.</p><p>Just as the sun was setting the shepherd came breathlessly down from the fields. But when he saw that her basket of roses was empty he again began to despair.</p><p>The Beautiful Wild Rose Girl laughed. She took his rose out from underneath the basket.</p><p>“Now you may have your rose,” she said. She put the rose into his hand, and leaning forward over her empty basket she kissed him. The poor shepherd’s eyes flooded with tears. He took hold of both of her hands and they gazed for a long time into each other’s eyes.</p><p>But then the poor shepherd looked down and said: “You now know that every rich man in the village wants you for his wife. And I am just a poor shepherd boy who is about to give you the only gold coin he has ever had…”</p><p>The Beautiful Wild Rose Girl came out from behind her stall. “I don’t need a rich man with gold coins,” she said. She took his gold coin out of his hand, put it into her sack, and said: “My back is sore from carrying this sack all morning. Carry it for me back to where you live and we will be married.”</p><p>The poor shepherd boy said with joy: “If that is what you need I could carry a sack tens times as heavy!” He threw the sack onto his back and carried it to his parents’ tiny cottage, where the two were married the very next day.</p><p>The morning after their wedding the poor shepherd hated to leave his beautiful wife, but she said to him: “Tend your sheep one last time, and when you come back you will be a gentleman, and never have to leave my side again.” The poor shepherd boy understood nothing, but he went off to his field with a light and joyous heart.</p><p>As soon as he left the Beautiful Wild Rose Girl reached into the enormous sack and took out a small handful of gold coins. She went around the village hiring every carpenter and bricklayer and builder and before evening they had built for her a lovely brick house. When it was finished and everyone had left, she planted in front of the house the shepherd boy’s wild rose. As soon as she did wild roses sprung up everywhere, surrounding the little house on every side.</p><p>When the shepherd boy returned from tending his sheep, and saw the lovely brick house surrounded by beautiful wild roses, he laughed for joy. The wild roses made way for him, and he ran inside where his wife was waiting and they began to laugh and dance and sing. And as far as anyone knows they are still laughing and dancing and singing today.</p><img src='https://xcx.mdavid.cn/img/4.-Brick-House-1280x897.jpg'></img>"}