{"title": "Bertie and the What Bear", "author": "Peter Levrai", "level": "3 to 5,6 to 8,9 to12,", "category": "Fairy Tale,Modern,Original,", "tag": "Bear,", "length": "10 - 15 mins,15 - 20 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Bertie-Cover-640x1024.jpg'></img><h2 style=\"text-align: center;\">1<br/> <em>A little blue bear</em></h2><img src='https://xcx.mdavid.cn/img/1-Lucy.jpg'></img><p>Lucy was a clever girl who spent a lot of time alone. It wasn’t that Lucy was unfriendly, just that she had a naturally serious face. Unless she made an effort it sometimes looked as if she wanted to be left alone, even though she really wouldn’t have minded talking to someone.</p><p>However, just because she spent time alone didn’t mean she was always lonely. Because she had the time she spent a lot of time reading, pushing her red hair out of the way of her glasses as in her mind she went on great adventures.</p><p>Whenever she got sad, which happened a little more often than it should, she talked to Bertie, her patchwork blue bear. Some would say she should talk to her family or friends and Lucy did that too. But she always found what helped the most was talking to her little blue Bertie, who always listened with the same interested look on his face. They spent a lot of time, Lucy holding his little round paws, explaining the things that needed to be explained.</p><img src='https://xcx.mdavid.cn/img/2-Bertie-looking-forward.jpg'></img><p>Lucy had had Bertie ever since her previous birthday, when her Aunty Beryl had taken her present shopping, a much better plan than Aunty Helena, who insisted on buying the most practical presents. In some ways it was very sweet but in other ways meant Lucy had to try to make the best of a new jumper.</p><p>Lucy had noticed Bertie right away, sitting amongst the other blue bears on the shelf. All the bears were blue patchwork with big buttons connecting their arms and legs. They all had little round ears sticking out the top of their head and black beady eyes above their cute black noses.</p><p>But while in many ways Bertie looked exactly like all the other blue bears in the shop he also looked completely different. His ears were rounder, his eyes were glossier, his patchwork brighter, the gold in it holding an extra shine.</p><p>Although Lucy did not know it at the time this was because Bertie was a special bear. All Lucy knew was that Bertie was the one, and the only one, for her. What she didn’t know was that she hadn’t really chosen Bertie.</p><p>Bertie had chosen her.</p><h2 style=\"text-align: center;\">2<br/> <em>That funny feeling of being watched</em></h2><p>One particularly wet and lonely Thursday evening Lucy was in her bedroom reading a book about spiders. She didn’t particularly like spiders and in all honestly was a little afraid of them but she felt safe enough reading about them in a book and she always felt it was good to try and understand the things that scared you. The more she knew, the less there was to be scared of.</p><img src='https://xcx.mdavid.cn/img/3-Bertie-Sitting.jpg'></img><p>However, as Lucy read she got the feeling that somebody was watching her, that strangle little tickle on the back of the neck.</p><p>She turned and looked at her room but all she could see was her own bed, her shelf of toys, the poster on her wall and Bertie, sitting in his favourite place on the yellow chair in the corner. The door was closed and her curtains drawn. She was alone.</p><p>Lucy went back to her book but soon enough she felt it again, that feeling that someone was watching her, a light feather on her neck.</p><p>She turned quickly this time, hoping to catch whoever it was but there was still no one there. Just her room as it always was.</p><p>She went back to her book again but she couldn’t really concentrate. She was waiting for the feeling again. And when it came, as she had known it would, she did not turn around. Instead she said, “Hello.”</p><h2 style=\"text-align: center;\">3<br/> <em>Bertie says hello</em></h2><p>“Hello Lucy,” came the reply and she almost jumped from her seat with surprise.</p><p>She turned and looked at his room and it was still as it always was. Bed. Shelf. Toys. Bertie.</p><p>She looked at Bertie carefully, trying to remember if his arms had been quite like that the last time she had looked. And the more she looked the more she became sure they had moved.</p><p>“Bertie?” she asked, under her breath, almost talking to herself.</p><p>And she was surprised to see Bertie smile, not so much with his mouth, which didn’t move a bit, but deep in his eyes, an extra shine and twinkle.</p><p>In all honestly though, perhaps she was not as surprised as she should have been. She had always known that Bertie was a special bear. Quite how special she was about to find out.</p><p>“Why are you reading about spiders and not about bears? Bears are much more interesting.” Bertie’s voice was soft and light, fully of curiosity, and Lucy seemed to hear it without it passing through her ears.</p><p>“Bertie?” Lucy asked again, louder this time.</p><p>“Yes?”</p><p>“Are you talking to me?”</p><p>Bertie seemed to take a moment to think. “That seems a rather silly question. There is no one else here. Who else could I be talking to? Besides, you are the only one here reading about spiders.”</p><p>Lucy had to accept that this was true but it still didn’t really tell her what she wanted to know. She thought she’d try again with a different question. “How are you talking to me?”</p><p>“I’m not a doctor, I can’t really explain. I think of the words and out they come. How do you talk?”</p><p>Lucy opened her mouth to answer and then realised she didn’t really know.</p><p>“Exactly,” said Bertie. “I think what you want to ask is why I am talking to you now and not before.”</p><p>Lucy nodded gratefully. That was indeed what she wanted to know.</p><img src='https://xcx.mdavid.cn/img/4-Bertie-Sitting-sideways.jpg'></img><p>“I like to take time to get to know someone. To decide if they are worth talking to. Very many people are not. But you are.”</p><p>Lucy could not help but feel proud about this.</p><p>“Even though,” Bertie continued, “you have very poor taste in books.”</p><h2 style=\"text-align: center;\">4<br/> <em>A lesson in bears</em></h2><p>“Poor taste in books? What’s wrong with spiders?” Lucy asked, the proud feeling disappearing as quickly as it had come.</p><p>“There’s nothing wrong,” said Bertie. “It just seems odd reading about spiders when you know nothing about bears.”</p><p>“I do so know about bears,” Lucy objected.</p><p>Bertie did not look convinced.</p><p>“We did a big thing about bears at school. I know about the polar bears in the north, the koala bears in the south and the brown bears that live in the woods. They like honey”</p><p>“You know that and you think you know about bears?”</p><img src='https://xcx.mdavid.cn/img/5-Bear.jpg'></img><p>“Yes.”</p><p>“My dear Lucy. You only know the very beginning of bears. I, for example, am a blue bear. What do you know about blue bears?”</p><p>“There’s no such thing,” said Lucy, who really did think she -knew a lot about bears already.</p><p>Bertie shook his head with disappointment. “Lucy. Am I a bear?”</p><p>Lucy nodded. She had to admit, Bertie was a bear.</p><p>“And what colour would you say I am?”</p><p>“You’re blue.”</p><p>“So, it would appear as if there are blue bears. And you should know that I am actually the prince of the blue bears.”</p><p>“The prince?” Lucy asked.</p><p>“Yes,” said Bertie.</p><p>“What do you mean ‘prince’?”</p><p>“I mean what I say when I say prince. Of all the blue bears, not that there are so many of us, I am the prince.”</p><p>“So you are the son of the king?” asked Lucy, wanting to make sure she understood.</p><img src='https://xcx.mdavid.cn/img/6-Bertie-Walking.jpg'></img><p>“Ah no. Bears don’t have kings. Or queens. That would be silly as bears are very independent. But each type of bear has a prince or princess.”</p><p>“And what does a prince or princess of bears do?” asked Lucy, trying very hard to keep up.</p><p>“A prince of bears,” said, Bertie, with a sparkle in his eyes, “travels.”</p><h2 style=\"text-align: center;\">5<br/> <em>A what bear?</em></h2><p>“Travels?” asked Lucy.</p><p>“Yes. The princes and princesses of bears are great travellers, as we have to make sure all the other bears are ok.”</p><p>“You mean the polar bears, koala bears and black bears?”</p><p>“My dear Lucy. As I said, you really know very little about bears. There are many other types of bear you will never read about at school.”</p><p>“What kind of bears?” asked Lucy, curious.</p><img src='https://xcx.mdavid.cn/img/7-Pile-of-Bears.jpg'></img><p>“Well, there are plumpy bears, fuzzy bears, grubby bears, roly poly bears, whuffy bears, tufty bears, lazy bears, chubby bears, pooch bears, honey bears, greedybeady bears, what bears, snoozy bears –“</p><p>“What bears?” Lucy asked.</p><p>“Snoozy bears,” said Bertie.</p><p>“No, before that. You said what bears.”</p><p>“That’s right.”</p><p>“What’s a what bear?”</p><p>Bertie looked at Lucy as someone looks at someone who didn’t know the world was round or if you leave toast too long under the grill it burns. “What bears are bears that go what. I would have thought that was quite obvious.”</p><p>“Bears that go what,” Lucy said carefully.</p><p>“Yes. What bears decided the only word they needed was ‘what’ so that is all they say and that is why they are called what bears.”</p><p>Lucy didn’t look convinced. A what bear seemed very unlikely, even when talking to a blue bear.</p><p>Bertie saw the doubt that Lucy had and the twinkle shone brighter in his eyes. “Would you like to meet a what bear?”</p><p>“What?” asked Lucy, this perhaps the most surprising thing Bertie had said so far. Perhaps even more surprising than the fact Bertie was saying anything at all.</p><p>“Princes travel Lucy, and sometimes we take guests. I can introduce you to a what bear if you like.”</p><h2 style=\"text-align: center;\">6<br/> <em>An everso long walk</em></h2><p>“Where do what bears live?”</p><p>Bertie seemed to think. “It’s very hard to explain. It’s not somewhere you would find on one of your maps. It’s not next to anywhere else you might know. I suppose you could say if you looked at a map and then looked behind the map, that is where you could find the what bears.”</p><p>“So how would we get there?”</p><p>I’m afraid it’s a long walk. But to start, lie on the bed and close your eyes.”</p><p>“I thought we were going to visit a what bear,” Lucy said, climbing onto her bed.</p><p>“We are,” Bertie explained patiently. “But while I can travel to see the what bears very easily it is more difficult for you as it is a place you people never really go. I can take you but it helps if you lie down and close your eyes.”</p><p>So Lucy lay down and closed his eyes and she felt Bertie climb onto the bed next to her.</p><p>“So Lucy,” Bertie said softly, “I want you to listen to me and relax and as you relax think about a long road running between tall tall trees. And as we walk along the road the air gets fresher, the light gets greener and you feel more relaxed than a snoozy bear after a big dinner.”</p><p>“What if I fall asleep?” Lucy asked, without opening his eyes, suddenly feeling rather tired.</p><p>“That doesn’t matter,” said Bertie. “You can visit the what bears awake or asleep. Now be a shush bear and listen.”</p><img src='https://xcx.mdavid.cn/img/8-Forest.jpg'></img><p>Bertie kept on talking in his soft voice and as he talked Lucy slowly drifted out of her bedroom and into the land of the what bear.</p><h2 style=\"text-align: center;\">7<br/> <em>At the end of the path</em></h2><p>After a time which could have been a minute or a day Lucy realised that she actually was walking down that path between tall tall trees. Trees so tall it seemed as if they might never stop, leaves the richest green she had ever seen.</p><p>Bertie was walking next to her, humming a little tune. not of any song she knew but which was very familiar even so.</p><p>Lucy opened her mouth to ask a question but before she could ask, Bertie spoke.</p><p>“Now you might find it a little difficult to understand a what bear at first. Just remember that every ‘what’ means something different except the ‘whats’ that mean the same thing.“</p><p>“How will I know a what bear when I see one?” Ben asked.</p><p>Bertie smiled a wide smile. “I think it will be pretty clear.”</p><p>They walked along a little further and the path opened out into a clearing in a wood. There were tall bushes in the clearing that had the biggest strawberries Lucy had ever seen. She looked at the fruit and suddenly realised how hungry she was.</p><p>She went over to the bushes and noticed a curious thing. The bottom half of the bushes had been picked clean of strawberries. There wasn’t a single one to be found, not even one small and green. But just above head height the berries were big and juicy, almost too big to hold in one hand.</p><img src='https://xcx.mdavid.cn/img/9-Strawberry.jpg'></img><p>Lucy reached for the nearest strawberry and there was just enough time to hear Bertie say, “I don’t think that’s a good ide-“ when something knocked her to the ground.</p><p style=\"text-align: center;\">8</p><p>The thing that had knocked Lucy over was a small brown bear with big round eyes and a very big nose. It stood on Lucy’s chest as she lay on the ground and gave her an annoyed look.</p><img src='https://xcx.mdavid.cn/img/10-What-Bear.jpg'></img><p>“What what what!”</p><p>Lucy tried to shrug to show she didn’t understand but it is much harder than you think to shrug while lying on the ground with a what bear standing on you.</p><p>The what bear nodded at Lucy, “What,” and then at the bush, “what,” and then at Lucy again, “what!”</p><p>“Oh,” said Lucy, thinking she understood. “I’m sorry. I didn’t realise they were your strawberries.”</p><p>The what bear seemed satisfied with that and climbed off Lucy’s chest with a final what. It went over to inspect the bushes to see if any strawberries were suddenly available somewhere it could reach.</p><p>Bertie walked over to Lucy and helped her sit. “So you met the what bear.”</p><p>“Yes,” said Lucy, still a little shaken from being pushed over.</p><p>“And you understood the whats, more or less. What bears don’t really own things so it wasn’t that it was his bush. He just loves strawberries and isn’t too keen on sharing.”</p><p>Bored with the bush the what bear came back over and started to sniff around Lucy, letting out little whats as he did so. Lucy was a little nervous but Bertie seemed calm enough so she tried to relax and smiled at the small brown bear as he moved around her.</p><p>After one final sniff the what bear gave a decisive, “What!” and sat down next to Lucy.</p><img src='https://xcx.mdavid.cn/img/11-Bertie-Close-Up.jpg'></img><p>She looked over at Bertie who smiled. “It might be a good idea to give him a stroke,” he said.</p><h2 style=\"text-align: center;\">9<br/> <em>Teaching is harder than it looks</em></h2><p>Lucy slowly stroked the top of the what bear’s head and played between his ears and as she did so the what bear let out little contented whats, eyes getting sleepy. Very soon the little whats turned into little what snores as the what bear drifted to sleep.</p><p>Lucy started to take her hand away and the what bear gave out a long low growled what. Lucy quickly returned to stroking and Bertie chuckled. “Of course,” he said, “once you start stroking a what bear it is quite hard to stop.”</p><p>“How many what bears are there?” Lucy asked, and she didn’t really mind the stroking. The fur beneath her fingers was thick and soft.</p><p>“Nobody really knows,” said Bertie. “What bears can’t count so they don’t keep track of things like that.”</p><p>“What bears can’t count? But counting is easy. I can teach a bear to count.”</p><p>The what bear opened his eyes at that and looked at Lucy curiously. Bertie smiled. “Many people have tried to teach what bears to count. And no one has succeeded.”</p><p>“Well I will,” said Lucy confidently and looked around the clearing. After a moment’s thought she went over to the strawberry bush and picked the biggest five strawberries she could find, reaching for the ones at the very tip top of the bush.</p><p>She then went over and sat opposite the what bear, who was looking at her with interest. Or more properly, who was looking at the strawberries in Lucy’s hand with great interest.</p><p>“So,” said Lucy, aware that Bertie was watching too. “Let’s say you have three strawberries,” and she put the berries on the grass in front of the what bear, who nodded his appreciation. “What. What. What.” He really did like strawberries very much.</p><p>“And if I give you two more strawberries,” the what bear happily whatted twice, “then you will have five strawberries.”</p><img src='https://xcx.mdavid.cn/img/12-What-Bear-and-Strawberries.jpg'></img><p>“What,” said the what bear, nodding his head, very pleased indeed with his sudden strawberry riches.</p><p>“Now”, said Lucy reaching forward for the strawberries, “if I take three-“</p><p>“WHAT!?!” whatted the what bear, and with a flash of teeth and claw Lucy realised it might be a very bad idea to try and take a strawberry away.</p><p>Bertie chuckled. “You see, no one can teach a what bear to count.” And the what bear happily started to eat his five juicy strawberries, the juice running down his chin.</p><p>After he had finished three he looked at Lucy and pushed a strawberry toward her with his paw. “What,” he said gently, and pushed it a little closer to her.</p><p>“Now that is something you don’t see every day,” said Bertie, who had seen a great many things and intended to see a great many more, “A what bear giving away a strawberry.”</p><p>Lucy took the strawberry, remembering to say thank you as she did so, and took a bite. The strawberry was sweet and juicy and the juice covered her fingers. It was the most delicious strawberry she had ever had.</p><p>As she finished her strawberry she saw Bertie looking at the sky and she was surprised to see it was getting dark. Although thinking about it, it had already been dark at home when they left so maybe it shouldn’t be such a surprise.</p><p>“Is it time to go?” she asked.</p><p>Bertie nodded. “Yes. You need your sleep. It’s school tomorrow.”</p><p>Lucy stood and looked down and the what bear and scratched him once more between the ears for goodbye.</p><p>“It was a pleasure to meet you … What.”</p><p>“What what,” said the what bear, and Lucy knew exactly what he meant.</p><h2 style=\"text-align: center;\">10<br/> <em>Waking and Sleeping</em></h2><img src='https://xcx.mdavid.cn/img/13-Bertie-Walking-Away.jpg'></img><p>As Bertie and Lucy walked out of the clearing and back down the path between the big tall trees they didn’t talk. Lucy had a lot to think about and Bertie was concentrating on finding their way home.</p><p>Before Lucy knew it she realised she wasn’t walking, she was lying, back on her bed in her cozy familiar room. She also realised she was very tired indeed, as if she had been walking a long way.</p><p>She looked over at the yellow chair in the corner and there was Bertie, looking at her with that smile in his eyes.</p><p>“Bertie?” she asked, and almost expected no answer at all.</p><p>But Bertie’s eyes flashed a little brighter and he said, “You want to ask a question.”</p><p>“Yes,” said Lucy, trying to hold back a yawn.</p><p>“You want to know if it was real, or if it was just a dream?”</p><p>Lucy nodded, her eyes very heavy now as she struggled to keep them open.</p><p>“My dear Lucy,” said Bertie, his voice warm and full of smiles, “the question isn’t if it was real or if it was a dream. The real question,” and the twinkle in his eyes grew brighter, “is if it is all a dream, why do you still have strawberry juice on your fingers?”</p><p>And Lucy looked down and saw she did indeed have strawberry juice on her fingers. And because she was a sensible girl she get out of bed even though she was everso tired and washed her hands and brushed her teeth. When she got back to her room she gave Bertie a kiss on his little worn nose, worn away by every kiss goodnight. “Good night Bertie,” she said.</p><p>“Sleep well, Lucy. Have the pleaseantest dreams. And there’s one more question you need to think about.”</p><p>“Hmmm?” asked Lucy, already most of the way asleep after a very big day.</p><p>In the darkness the smile flashed in Bertie’s eyes. “Where would you like to go next?”</p>"}