{"title": "Best Kept Secret", "author": "Melynda Miles-Mitchell", "level": "9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p> “Meredith! Wake up! It’s time to go to school!” Meredith rolls over, looks at the clock and quickly pulls the covers back.</p><p>“Alright. Alright. I’m up!” she yells. Today is Secret Santa in Mrs. Morrow’s 7th grade class and Meredith isn’t what you call “Ms. Popular”. She has dreaded this day for the past month, because she knew that she probably wouldn’t get a gift from any of her class mates.</p><p>Dragging her book bag down the stairs, Meredith plops down at the kitchen table.</p><p>“Mom, can’t I just skip school today?”</p><p>“Now Meredith, we’ve already had this discussion and it’s not up for replay. You’re going to school. Stop hiding in the shadows and make friends.”</p><p>Meredith rolls her eyes and proceeds to walk out the door. Her mother kisses her forehead and strokes her hair.</p><p>“I know it’s been a rough year, but you’ve got to make an attempt to be comfortable in your new environment. Your dad and I feel this change would be good for the family. Plus, business is better for his jewelry store in this town.”</p><p>Meredith hugs her mom, puts her backpack on and walks down the driveway. Her mom shouts “Did you get your gift for your classmate?”</p><p>Meredith nods and reluctantly hops on the bus.  As she sits down, she pulls a white box out of her coat pocket. It has the name Kayla written on it. She sighs, “Here goes nothing.”</p><p>The bell rings and Mrs. Morrow’s class settles down. Kayla, the notorious mean girl laughs with her posse as Meredith sits in her seat. Meredith slouches in her chair and looks away.</p><p>“Class, today is Secret Santa. Does everyone have their gifts to exchange?” In unison, the class replies that they had done so.</p><p>“Great! So, at this time I’d like for each of you to go ahead and exchange your gifts, while I get our refreshments ready.”</p><p>Meredith takes a hard swallow and slowly gets up from her desk. She makes her way towards Kayla’s desk and gently taps her on the shoulder. Kayla looks up, rolls her eyes, and flips her hair.</p><p>“This better be good new girl.” Meredith places the white box on her desk and walks away.</p><p>Kayla opens the box and covers her mouth in astonishment. The gold necklace that her dad gave her before he passed away a year ago gently lay in the box repaired, shining like new.  She had lost it a month ago in gym class. She never wore it because the clasp had been broken. Meredith walked upon it and took it to her dad’s shop for repair. She figured since she had pulled Kayla’s name for Secret Santa this would be the best opportunity to give it to her, especially since she wouldn’t have had any other reason to even speak to Kayla from being teased so much.</p><p>Kayla gets up from her desk and goes to Meredith.</p><p>“Hey….look I’m sorry for giving you such a hard time this past year. This is the nicest thing anyone has done for me. Ever since my dad died, I haven’t really cared about a lot. How’d you get it fixed anyway?”</p><p>Meredith smiles and replies “It’s ok. I understand the teasing comes with new girl territory, but my dad owns the new jewelry store in town. So, I had him to fix it for me. Free of charge!” Kayla smiles back.</p><p>“That’s pretty cool. I had no idea. Thanks again Meredith. This really means a lot.” Kayla walks back to her desk. Meredith grins and looks over to Mrs. Morrow who winks in agreement.</p>"}