{"title": "Bingo Girls", "author": "Wendy Lee Klenetsky", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Ivy Melissa and Jamie Lynne were given permission by their mother to attend the special BINGO-MARATHON, held this year at the local firehouse. The girls were very excited and anxious to go and play one of their favorite board games.</p><p>Ivy Melissa told her sister, Jamie Lynne, that in order to get good seats for the game (those seats that were closest to the BINGO WALL BOARD), they would have to get to the firehouse by 9:00 am. It was already 8:45 and Jamie Lynne wasn’t ready yet.</p><p>“C’mon, Jamie, Hurry up or we’ll never make it,” Ivy Melissa yelled.</p><p>“I’m almost finished tying my shoelaces, Ivy,” Jamie Lynne answered. Then within 5 fast minutes, both girls had said their good-byes to their mother, and had raced out the door and down the block.</p><p>The girls reached the line of Bingo-goers at the firehouse by about 8:59 am.</p><p>“Whew, we just made it, Ivy Melissa,” said Jamie Lynne.</p><p>“Now I hope that we can win a game and get one of those great toy prizes,” Ivy Melissa said with excitement in her voice.</p><p>Soon the firehouse door opened up wide, and Ivy Melissa and Jamie Lynne hurriedly walked into the big hall and got good seats down front near the BINGO WALL BOARD. They picked out 5 boards each and scooped up a handful of chips to put down on the numbers. They waited with all the other kids for the games to begin and got their boards ready for play.</p><p>The time came, and the caller started the first game.</p><p>“B-12,” he called.</p><p>“I HAVE IT!, Ivy Melissa,” Jamie Lynne yelled.</p><p>“Not so LOUD, Jamie Lynne,” Ivy Melissa whispered back to her sister. “Don’t yell out until you have 5 numbers in a row, up and down, across or diagonally.”</p><p>“Okay,” said Jamie Lynne, “but I hope I WIN.”</p><p>“I want to win, too,” Ivy Melissa told her, “but there can only be a certain amount of winners per game. If we don’t win, we don’t win. But at least we will have fun!”</p><p>The games continued. Ivy Melissa won one game (diagonally) and her prize was a toy pony. Jamie Lynne needed one number on each of the first 5 games played. She was getting very frustrated.</p><p>“I wish we had never COME to this dumb BINGO game, Ivy Melissa. At least YOU won a prize; I didn’t win..I just keep waiting and waiting for l NUMBER! When is it going to be MY turn to win?”</p><p>“Oh Jamie Lynne, just try to have fun. Maybe this last big JACKPOT game will be the one you win,” Ivy Melissa said, trying to comfort her little sister. “Just keep playing and let’s wait and see. Let’s put it this way: If you don’t win this last game, I promise to let you play with my prize pony. Okay?? Okay. Now let’s listen to the numbers.”</p><p>The caller began… “G-54…..I-17….0-75….”</p><p>“I have those numbers, Ivy Melissa. Do you think I’m going to get my B-3 and N-36?”</p><p>“Shhhh. Just listen…Don’t talk, Jamie Lynne.”</p><p>The caller continued..”B-4….G-46….B-3….”</p><p>“Ivy, Ivy, LOOK..I only need N-36, and I win the big JACKPOT game!”</p><p>The caller slowly (or it SEEMED to be slowly) said “N-36.”</p><p>“BINGO! BINGO! I HAVE BINGO!” screamed Jamie Lynne.</p><p>“BINGO!” called out another girl’s voice from the back of the firehouse.</p><p>“Call out your numbers, loud and clear,” said the caller.</p><p>“B-3,I-17,N-36,G-54 and 0-75,” said Jamie Lynne in a loud, proud voice. The girl from the back of the firehouse hall gave the same numbers.</p><p>“Well,” said the caller, “looks like we have 2 winners for the JACKPOT game. Tell you what. Will the 2 girls who won, please come up to the front, and pick out 4 toys of your own choice. Whatever you choose, you keep as your prize.”</p><p>Jamie Lynne and the other girl each picked out baby dolls, books, doll clothing and painting sets. Jamie Lynne ran back to her sister. Ivy Melissa gave her little sister a congratulations-type of hug. The 2 BINGO GIRLS hurried home to show their mother what they had won.</p><p>“Boy, Ivy Melissa, didn’t we have FUN?!”</p><p>“Sure, Jamie Lynne. B-I-N-G-O was G-R-E-A-T!!!!”</p>"}