{"title": "About a Buoy", "author": "Daniel Henshaw", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Bird,Manatee,Seagull,", "length": "05 - 10 mins,", "body": "<p>Have you ever been to the seaside?</p><p>I’m sure that you have.</p><p>Well if you have been to the seaside then you may have noticed those coloured balls that just seem to float in the sea without moving.  Remember?</p><p>Those floating balls are called buoys, and they’re anchored to the seabed so that they don’t move.</p><p>It’s a strange word, buoy.</p><p>People say “buoy” the same as they would say “boy” so it can get a bit confusing, especially if the buoy isn’t actually a boy.</p><p>Now you’re looking confused.</p><p>Anyway, this is the story of one buoy in particular named Billy.</p><p>Billy was a both a buoy and a boy so that should keep things simple because if I said something like “the buoy was a girl” then you may begin to get things a little bit mixed up.</p><p>Now, for many years Billy the buoy spent his days bobbing up and down in the water without moving from his anchored spot.  Some of you may think that splashing around in the sea all day would be great fun, but it was no fun at all for Billy.</p><p>Billy was a very sad buoy.</p><p>He was sad because he felt hollow inside.  Although, if you think about it, he actually is hollow inside, but what I mean to say is that Billy felt like there was something missing from his life.</p><p>Basically, Billy was a lonely buoy.</p><p>Billy would see the occasional swimmer during the summer and this would make him smile.</p><p>However, during the winter it was very rare that he would see anyone at all except for the odd boat that came a bit too close and scared him.</p><p>Billy was even more lonely during the winter than he was during the summer.</p><p> </p><p>Sometimes Billy would see how long a gap there was between each wave.  It was a game.  The shortest time that he ever recorded was 2 seconds.  The longest time that he recorded was 25 seconds, although there were a few mini-waves on that occasion but Billy didn’t really count mini-waves.  This was Billy’s favourite game but even this could get a little boring.</p><p> </p><p>Billy would tell himself the occasional joke.  But his jokes were very very bad.  Here’s just one example:</p><p>“Knock knock” Billy would say to himself.</p><p>“Who’s there?” he would answer.</p><p>“It’s me”</p><p>“ It’s Me who?”</p><p>“Me.  Billy.”</p><p>Isn’t that a terrible joke?  Even if it was a good joke, Billy wouldn’t have laughed because he already knew the punch line.</p><p> </p><p>Sammy the Seagull, Billy’s only real friend, would come and land on his head at the start of every month.  Sammy never laughed at Billy’s jokes, and he didn’t know the punch lines.</p><img src='https://xcx.mdavid.cn/img/BUOY2.jpg.jpg'></img><p>“Why are you so sad?” asked Sammy one day.</p><p>“I’m lonely” said Billy in a very gloomy voice.</p><p>“But I come to see you every month” said Sammy.</p><p>“Yes” said Billy “and it makes me very happy when you come.  But I’m lonely when you’re gone.”</p><p>Sammy the Seagull thought for a while.</p><p>“Why don’t you look under the water?” said Sammy.</p><p>Billy Buoy, who as far as he could remember had spent every day of his life on the water, had never thought to look what was actually underneath him in the sea.</p><p>So, with a great effort, Billy ducked his huge head under the water and was amazed at what he saw.</p><p>There were thousands of fish and plants and other creatures.  There were yellow fish and orange fish and blue fish and green fish and many other colours too.  There was red coral, yellow coral and the darkest shades of seaweed.  There were jellyfish, sea horses and many other wonderful creatures.</p><p>Billy laughed to himself when he saw this beautiful sight.</p><p>He couldn’t believe that he’d never seen it before.</p><p>After this, any time that Billy felt lonely he would look under the water and gaze in wonder at the beauty that was surrounding him.</p><p> </p><p>This kept Billy happy for a while but there was a problem.  The problem was that Billy couldn’t talk under water and this meant that he couldn’t make friends with the creatures that he saw each day.</p><p>Soon Billy became lonely again with only Sammy the Seagull to talk to once each month.  His games and jokes were getting even worse too.  Some days he would see how many clouds he could count.  This was fun at first but the clouds were always moving and sometimes they stuck together and he couldn’t tell if two clouds were actually one cloud.  He soon became confused and stopped playing this game.</p><p> </p><p>He felt empty again, and on a day when he was feeling particularly sorry for himself he felt something underneath him that tickled.</p><p>Billy looked down and could see a large dark figure floating right next to him.  It looked like a whale or a seal, and it appeared to be nibbling Billy.</p><p>“Excuse me” said Billy.</p><p>“Yes?” said the animal, lifting his whiskery face out of the water.</p><p>“What are you doing?” asked Billy.</p><p>“I’m eating” said the animal.</p><p>“Eating what?” asked Billy.</p><p>“Algae” said the creature.</p><p>“What’s algae?” asked Billy.</p><p>“It’s this green stuff that attached to your bottom” said the animal.</p><p>“Is it some kind of plant?” asked Billy.</p><p>“Similar, it tastes great but it’s not actually a plant” said the animal.</p><p>“So do you creatures eat a lot of it?”  asked Billy.</p><p>“Us creatures?” said the animal “Don’t you know what I am?”</p><p>“Are you a seal?”  asked Billy.</p><p>The animal laughed.  “No, I’m a manatee” said the manatee.</p><p>Now if you don’t know (because a lot of people don’t know) what a manatee is, then I’ll explain.</p><p>Manatees are large water mammals that are sometimes known as “sea cows”.  They have two short flippers at the front and a large flipper at the back.  They have short noses and mainly just eat plants and vegetation but have also been known to eat fish.</p><p>“My name is Martin” said the manatee.</p><p>“And my name is Billy” said the buoy.</p><p>“Nice to meet you Billy,” said Martin “do you mind if I come to eat algae here tomorrow as well?  You see, there aren’t many other manatees in the world and I get very lonely.”</p><p>Billy couldn’t believe his ears, he’d found another lonely person to talk to, or should I say another lonely person had found him.</p><p> </p><p>From that day on Martin came to eat Billy’s algae every day.</p><p>This was the happiest that Billy had ever been.  He had company every day as Martin would come to see Billy and tell him about all of the different things he’d seen swimming around the sea.</p><p>At first Billy loved hearing these tales of adventure as Martin told him about places and creatures that he’d never even heard of.</p><p>However, the feelings of emptiness soon returned and Billy was glum once again.</p><p>Billy felt unfulfilled.  He felt that he had not achieved anything in his life.  He felt that he had not seen anything in his life.</p><p>He was jealous of Martin’s adventures and wanted to be set free.</p><p>How could his life be of any importance?  All he did was bounce up and down in the sea.  Billy felt useless.</p><p> </p><p>The next time that Billy saw Martin, he told him how he felt about these things.</p><p>Martin looked shocked.</p><p>“You must be crazy,” said Martin “do you not realise what you are?”</p><p>“I’m pointless” said Billy.</p><p>“No you’re not,” said Martin “you’re one of the most important residents of this sea, especially to me.  You’re a buoy.”</p><p>“I’m a what?” asked Billy.</p><p>“You’re a buoy, you help to make sure that boats don’t crash into each other.  You direct them, which is great for me because I swim so slowly that I struggle to get out of their way, and if you send them one way then I can swim in the other direction.  You’re very important.”</p><p>As Martin the manatee was telling Billy this, the hollow feeling inside him seemed to disappear.  He was inflated with pride.  He was actually important.</p><p>From that day on Billy bobbed up and down in the sea with extra purpose and pride.</p><p>He didn’t feel empty any more.  He had an important job and he was proud to do it.</p><p> </p><p>He also didn’t feel lonely any more either.  Martin had been for a trip around the seas and had told other animals to visit Billy and thank him for the great job that he was doing.  So then many different animals such as manatees, dolphins, killer whales, and others all came from different places to thank Billy for doing such a great job.</p><p>Although Billy says that it was only sea water, it looked to me like a little tear rolled down Billy’s cheek every time that an animal thanked him for doing such a fine job.</p><p>Billy now also had the chance to try out his jokes on new friends.  None of them have laughed yet.</p><p> </p><p> </p>"}