{"title": "Carlito Roadrunner", "author": "Paul R. Hernandez", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Rabbit,Roadrunner,", "length": "05 - 10 mins,", "body": "<p>Once upon a time in Cactus Hill, Arizona lived Dasher and Honey Roadrunner.</p><p>They were a happy- go- lucky couple that were always seen running through their desert homeland and going up and down the arroyos in their neighborhood.</p><p>Like all roadrunners, Dasher and Honey were so fast that they were able to criss-cross the busy highway that ran straight through their desert without ever worrying that any of the cars that they always saw going faster then the speed limit would hit them.</p><p>Their blazing speed also helped them to avoid being eaten by Sinster Coyote who was always looking for an easy meal.</p><p>In time Dasher and Honey received a little bundle of joy from heaven which they named Carlito.   “Look how cute he is” said Honey, “he has your brown eyes and long legs Dasher, I bet he will grow up to be just like you.”</p><p>But as Carlito grew up they noticed something very strange about him.</p><p>When Carlito was 1 year old, Dasher and Honey noticed that he was not able to run as fast as all the other little roadrunners and that he was always stumbling and falling down.</p><p>Because of this, all the other little roadrunners were always making fun of him and none of them wanted to be his friend.</p><p>Carlito was very sad because he had no one to play with and everyday he just sat around the cactus patch wishing for a friend.</p><p>One morning as he stood around day-dreaming he heard a voice say “Hi there, what are you doing?”</p><p>Carlito turned around to where the voice had come from and there he saw a little bunny rabbit.   “Oh nothing really important.” he said.</p><p>“My name is Skipper,” said the little bunny rabbit, “What’s your name?”</p><p>“I’m Carlito,” he responded.</p><p>“I have been watching you for a while and I noticed that none of the other little roadrunners will play with you, do you want to play with me?” asked Skipper.</p><p>“Oh yes, that would be fun” said Carlito, and all that day they played together until the sun started coming down in the Western sky and they both had to go home.</p><p>They next day Carlito was up at the crack of dawn and went straight to the cactus patch hoping that Skipper would be there to play with him again.</p><p>Carlito did not have to wait very long, “Boo!” said Skipper, jumping out from behind a large cactus plant, “did I scare you?”</p><p>“No, you didn’t scare me, I knew you would be somewhere around here” answered Carlito.</p><p>“Come on,” said Skipper, “let’s play tag.”  “How do you play tag?” asked Carlito.</p><p>“It is a very easy game to play; the first thing you have to do is run after me and try to touch me.   If you are able to catch me, you have to yell ‘tag. your it’ and then it will be my turn to try and tag you.”</p><p>“Gee that sounds like fun” said Carlito.   “Let’s go!” yelled Skipper, “see if you can catch me!” and away ran Skipper with Carlito in hot pursuit.</p><p>Skipper was very illusive, as he ran, he dodged first one way and then another, he skipped, jumped and hopped around in a way that Carlito had never seen, and before long Carlito stumbled and fell flat on his face.</p><p>“What happened to you?” asked Skipper.</p><p>“I always fall down when I run” said Carlito, “that is why none of the other roadrunners will play with me.   I will understand if you don’t want to play with me anymore.”</p><p>“Don’t be silly, I will still play with you” said Skipper.   “It is very strange though, that you have trouble running, I always thought that roadrunners were born runners.”</p><p>“Go ahead and run,” said Skipper to Carlito, “I want to see how you do it.”</p><p>“Ok,” said Carlito and he started running as fast as he could, but in a matter of seconds his legs got all tangled up and down he fell, creating a cloud of dust.</p><p>“Wow, you do have a problem,” said Skipper, “maybe you should learn another way of running.   My dad taught me and my brothers how to run, and we run pretty well.”</p><p>“Look at me,” he said and off he went in a combination of running, skipping, hopping, weaving and jumping.</p><p>“I don’t think that I can do all that,” said Carlito, “it looks very complicated.”</p><p>“You will never know unless you try it, go ahead and give it a shot,” said Skipper.</p><p>So Carlito sucked in all the air that he could and started running as fast as he could, first skipping and hopping and ended up on the ground.</p><p>“You need to take it slowly at first so that you can learn all the steps,” said Skipper, “now go ahead and try again.”</p><p>So Carlito dusted himself off, and slowly started running, skipping, hopping, weaving and jumping, over and over again, until he was able to do it without thinking of the steps.</p><p>As the days turned in weeks and the weeks into months, Carlito practiced his new running skills with Skipper, until he knew that he was able to run faster then all the other roadrunners.</p><p>One cloudy day as Carlito and Skipper played in the cactus patch, they heard what appeared to be a scream coming from the arroyo.</p><p>“Let’s go over there and see what is happening,” said Carlito, and they both ran over in the direction of the sound.</p><p>When they got to the arroyo, they came upon a group of roadrunners standing around nervously.   “What happened?” they asked.</p><p>“We were all playing in the arroyo and all of a sudden Sinster Coyote came out of nowhere and snatched up Crissy Roadrunner and ran off with her.”</p><p>“Didn’t you try and help her?” asked Carlito.   “What could we have done?” they all responded in unison, “We are no match for Sinster Coyote.”</p><p>“Well I am not afraid” said Carlito, “I am going after them to see what I can do,” and off he ran with Skipper trailing behind him.</p><p>In a matter of minutes Carlito was able to see Sinster Coyote running up ahead with Crissy Roadrunner in his mouth and in no time overtook them.</p><p>“Hey there Sinster, you silly old coyote, what do you think you are doing running around with a roadrunner in your mouth?”</p><p>“Umm goooymn tuu ettt hrrr,” he replied.</p><p>“What’s that you said, I couldn’t understand a word?” said Carlito.</p><p>“Umm goooymn tuu ettt hrrr!”</p><p>“Come on you cranky old coyote, open your mouth and speak properly so that I can understand you.”</p><p>“I said that I am going to eat her!” said Sinster Coyote, but as he opened his mouth to speak, out fell Crissy Roadrunner.</p><p>“Run Crissy,” yelled Carlito, and off she went as fast as her legs could take her.</p><p>“Look what you made me do!” snarled Sinster Coyote to Carlito, “Well she may have gotten away, but I am going to eat you instead.”</p><p>“I am not afraid of you,” said Carlito.</p><p>Sinster Coyote’s blazing red eyes narrowed ever so slightly as he looked at Carlito.   His great big teeth forming a menacing snarl as he said,   “You may think that you are going to get away from me, but you are here in my home area, and I am really going to enjoy eating you.”</p><p>With that Sinster Coyote leaped directly at Carlito, but to his surprise Carlito was no longer standing where he had been a second before.</p><p>“Huh, what happened?” he thought, and he looked around and saw Carlito off to the side.</p><p>“Come on you dingy old coyote, what’s the matter, are you getting old?”</p><p>Again Sinster Coyote started running in Carlito’s direction, but Carlito just started skipping, hopping, weaving, jumping and running and was able to stay many steps ahead of Sinster Coyote.</p><p>This went on for many minutes, but eventually Sinster Coyote gave up, completely out of wind and with his tongue hanging out of his mouth.</p><p>“Come on Skipper I don’t think this old coyote will be bothering any of us for a long time.”</p><p>They both ran back to the group of roadrunners to see how Crissy was feeling now that her ordeal had passed.</p><p>All the young roadrunners were standing in a circle around Crissy who was telling them about how Carlito had been so brave standing up to Sinster Coyote and how he had saved her.</p><p>As Carlito came up to them, they turned around to look at him and Carlito could see a look of admiration in their eyes and he felt very good.</p><p>“How is it that you were able to get the better of Sinster Coyote?” they asked.</p><p>“It was with the help of my good friend Skipper.   You see, he taught me a better way to run and now no coyote can catch me.”</p><p>“Do you think that you can show us too?” all the roadrunners asked.</p><p>“Of course, both Skipper and I will show you and then none of you will have to be afraid of Sinster Coyote and his friends.”</p><p>During the following weeks Carlito and Skipper had daily running lessons for all the roadrunners, including Crissy, who had become very close to Carlito.</p><p>Soon all the roadrunners had mastered the new way of running and no longer were afraid of coyotes.</p><p>Carlito became their leader and in time, Carlito and Crissy became a happily married couple and one day they had their own bundle of joy which they called Alfy, but that is another story.</p><p>One of these days if you happen to be traveling down the highway in the desert of Cactus Hill, Arizona and you run across some roadrunners who will be skipping, running, hopping, weaving and jumping, remember Carlito and Skipper who showed us that good friends are worth their weight in Gold.</p>"}