{"title": "Carrot Top", "author": "Patricia Kings", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Carrot Top the scarecrow lived in a sugar beet field spring and summer. Standing still made his arms ache. Blackbird nested in his straw and Harvey harvest mouse curled up in his trousers to sleep. The rabbits used nibble at the sugar beet.</p><p>One day the farmer came with his tractor to dig the beet and didn’t need him any more so he propped him up at the side of the field. Carrot Top felt sad and unwanted.</p><p>“Where are we going to live?” asked Blacky and Harvey.</p><p>Carrot Top did not know what to do. His friends left him and started looking for a new home. It had started to rain, making his straw hat soggy and tweed jacket wet. Tears trickled down his turnip face. He felt all alone.</p><p>When the farmer went to lunch, the scarecrow hopped across into the next field which had cows in it. Carrot Top did not see them until they mooed making him jump.</p><p>“What are you doing in our field?” asked the cows.</p><p>“Farmer don’t want me any more,” replied Carrot Top.</p><p>“We don’t either,” said Bella a big brown heifer.</p><p>Carrot Top went on his way and came to a sheep field. They all stared.</p><p>“Baa, we don’t want you!” they said.</p><p>In the next field was a horse and a young foal (which is a baby horse.)</p><p>“What are you doing in our field?” said the brown mare.</p><p>“The farmer does not want me,” replied Carrot Top.</p><p>“Well you can keep us company,” neighed Blaze, a black horse with a white star on his nose. “Make sure you shut the gate.”</p><p>He made his way to the lane and shut the gate. The sun came out, drying his jacket. He had not gone far when a tractor and trailer came along. Carrot Top thought it was farmer Bates, but it was someone else.</p><p>“You are going to be late, hop in,” he heard.</p><p>Carrot Top did as he was told, but did not know what he was going to be late for. In the trailer were several scarecrows – one was dressed as a policeman with his helmet, another lady one was little bow peep minus the sheep.Two older ones were the two ugly sisters</p><p>“Who are you?” asked Cinderella.</p><p>“I’m Carrot Top, who are you?”</p><p>“I’m Cinders and these are my horrible sisters.”</p><p>“Hey watch it!” they said, kicking out at her.</p><p>“Leave her alone you bullies,” replied Carrot Top.“Where are you going?”</p><p>“To the scarecrow festival silly,” she replied.</p><p>“I did not know about it,” said Carrot Top. I was put out of my field as farmer Bates did not want me.”</p><p>“Oh I am sorry, you can stay with us,” replied Cinders.</p><p>Carrot top glowed inside; it was nice to be wanted. They reached the village and farmer helped Carrot Top and Cinders out. He placed them on the wall in front of the church. It was Sunday and he could hear the singing. When all the people came out they all had a look at the scarecrows. One little girl said he looked scruffy. Carrot Top felt a bit sad and a big tear rolled down his cheek. Anna her friend saw it and said “You’re making him cry!”</p><p>“Scarecrows don’t cry, they are made of straw,” the girl replied. He felt even more hurt.</p><p>“Shall we find him some more clothes?” one asked.</p><p>“My dad has an old jacket he does not wear,” said the other, so the two girls ran off home and were soon back with a very smart leather jacket. They soon had him dressed after much tugging of straw Carrot Top felt snug.</p><p>“He will need a hat,” they said.  They soon brought a cap</p><p>Next day all the villagers walked past including the mayor they poked and prodded him. Carrot Top did not like it, he wished he was back in his field with his friends. All the other scarecrows were all round the village, which was decorated with flowers. One man in the crowd looked at Carrot Top.</p><p>“That’s my best leather jacket,” he cried. The man looked round for his daughter, but she had gone. The mayor said he could have it back after the judging.</p><p>“Wait till I see Becky,” he said.</p><p>Carrot top did not want her to get into trouble, but be could not talk to humans. Later that day the judging began. The best female scarecrow was Cinders and the winner was Carrot Top. He was thrilled and was put on show and had his photo in the local paper. Farmer Bates wished he had put him in the festival himself. Becky’s dad had his jacket back. So if you see a scarecrow on a church wall, it will be Carrot Top.</p>"}