{"title": "The Catacomb Adventures", "author": "Carol Bennett", "level": "9 to12,", "category": "Historical,Original,", "tag": "", "length": "Over 20 mins,", "body": "<p>Note:  I acknowledge that many historians believe that the Catacombs were used for temporary hiding places rather than long-term dwellings.</p><p>Note:  I have taken liberties with the time frame between Paul’s conversion and the first missionary journey.</p><h2> Chapter 1</h2><p>Anna watched as her brother stretched his hand as far as he could, trying to reach their mother. The woman strained for him through the bars of her cell, too, but they couldn’t quite touch each other.</p><p>Their mother didn’t look well. She had a racking cough and no blanket in this cold, damp dungeon. Well, neither did they, but she had been here much longer and she was sick.</p><p>“Mama,” Jacob’s voice echoed in the dungeon. “Mama, you mustn’t give in. Promise you won’t.”</p><p>Anna spoke up then. “We’re willing to die for Jesus, Mama. We’ll be all right. Jesus will take us to heaven.”</p><p>“I know, children.” She broke into another coughing spell and sank back on the straw, exhausted.</p><p>Jesus had warned His followers that they would be persecuted and that persecution had started in a big way. The Jewish leaders hated them. The Romans were throwing them out of their homes, leaving them to live on the streets. To the new band of  Christian believers, it seemed that the whole world was against them. But Jesus had also promised His help and strength.</p><p>“Just when I thought the Roman government could stoop no lower!” came a disgusted voice from the cell across the way.</p><p>The children hadn’t paid much attention to their fellow prisoners since they’d been dragged down the steps and thrown into the cell the night before. Now they observed a strong, muscular man across the aisle. He was dressed in a Roman soldier’s uniform but from the way he was muttering about the government, they understood why he was in prison. Talking like that would get anybody arrested.</p><p>“What do you mean, sir?” asked Jacob, curiously.</p><p>“Throwing helpless men and women before the lions! Why, it should be the gladiators who fight the lions — at least they’d have some chance. And now their new trick of putting young children out there in order to get parents to turn against Christ. I am no Christian but you have the right to believe the way you want. You’re not hurting anyone!”  He angrily shook his head. “It’s sickening. I want no part of this government any longer.”</p><p>“Looks like you’ve got your wish,” laughed another prisoner. He was an old man in filthy, ragged clothes who looked like he had been there for years.</p><p>Just then, the upper door opened and a shaft of light appeared on the stone steps. A burly jailer stomped down the stairs. “It’s time,” he sneered as he put his key in the lock of the children’s cell.</p><p>Anna trembled in spite of her desire to be very brave and bold for her Lord. They were to be taken to the garrison. Often prisoners were sent to Rome to be killed in the  Coliseum. They would be jeered at by thousands of people in the stands before being torn apart by wild animals, just because they were followers of Jesus. But the soldiers here in Jerusalem could be very cruel, too. Could she face whatever the soldiers had in store?    Her knees trembled at the thought of it. Oh, Lord Jesus, give me strength to go through it. Help me to be bold for you. I know You’ll take me to heaven but —</p><p>Suddenly the Roman prisoner gave a shout. “Hey you, I’m thirsty!  Give me water!”</p><p>“Don’t you order me around!  You’re not worthy to wear a Roman uniform!”  The jailer took his keys and unlocked the prisoner’s door furiously, flinging it open. “I’ll teach you!”</p><p>But the jailer didn’t know what hit him. The prisoner knocked him against the wall and down he went, unconscious. The prisoner grabbed the keys, then locked him into the cell. He opened their mother’s door and helped her up as they all looked on in shock.</p><p>He released the children and urged, “Well, come on!  Quiet now. I had jail duty once. I know a way out of here but we’ll have to be quick.”</p><p>“Hey, what about me?” cried the old man.</p><p> “Oh, all right.”  The Roman freed him, too as the children headed for the stairs.</p><p>“Not that way!” exclaimed the soldier. “Come with me!”</p><p>Together they crept along the passage and soon he led them up a filthy stairway, filled with cobwebs and broken stones. It led out into the sunlight of an alleyway.</p><p>“Quick!  Go!  They’ll know we’re gone any minute!  Do you have someplace safe?”</p><p>“Yes, sir. Thank you, sir!” said Mama. She seemed to be in a daze, as if unable to believe their rescue.</p><p>“Then go!” he urged, frantically.</p><p>The old man had disappeared around a corner and soon the Roman prisoner was out of sight, too.</p><p>“Come on,” said Mama. “The Catacombs!  There’s an entrance near here. Other Christians are living there and it’s our only chance.”</p><p>She was so weak that she swayed dangerously, almost falling. Jacob grasped hold of her arm and Anna took the other. Together, they made their way out of the alleyway to the Catacombs, their new home.</p><h2>Chapter 2</h2><p>Jacob and Anna had been living in the Catacombs for several weeks. Since their escape from prison, they had joined the small group of Christians living in the tunnels that passed under their section of the city. The Catacombs also included the local burial place, so many bodies lay enclosed in stone compartments. That had been rather creepy at first but the children had grown used to it.</p><p>What they couldn’t get used to was being inside — and underground — all the time. There were no doors or windows for sunlight to flow through and though they were allowed to explore and roam the dim passageways, it wasn’t the same as going outside to play. Sometimes Jacob and Anna wondered if they would ever see the blue sky and green grass again.</p><p>“We’re safe. That’s what matters,” said Mama. “I know it’s hard but it’s better than prison, or worse, the Games.”</p><p>They understood, of course, and it really wasn’t all that bad. There weren’t many rules since there was no place to go. Even the adults had to follow the main rule to never go above without permission from Zacarias, the leader of their little band. And never betray their hiding place if they did go above. And never go down to the far end of Tunnel Three, for that section was very unsafe and could collapse at any time.</p><p>That last one was the rule that was drummed into all of the children. The other two would never be a possibility since they were never allowed outside. Some of the adults went topside for water and medicine or to meet with the Twelve but the children</p><p>never did. That’s why it was a surprise, when after prayers one evening, Zacarias called them aside.</p><p>Prayer time had been filled with many serious issues that day. Zacarias, a kind elderly man with white hair and beard, along with the thirty adults and ten children, were gathered in one of the larger stone chambers.</p><p>“We haven’t found another water source yet,” said the old man, “So we’ll have to continue going out by night to get water from the well.</p><p>Jonathan, a young man who at the moment was extremely filthy, spoke up. “We thought we had found an opening from above but it was a dead end. I think if we keep clearing away the dirt, we’ll find something, though. We may be directly under the main cistern.”</p><p>For some reason, clean water had run in from above ever since they had been hiding in the Catacombs. They considered it a miracle of God that they didn’t have to sneak out to draw water at the well. But the hole where the water trickled in had dried up and Jonathan and some of the other men had been working on the problem. They obviously hadn’t had time to wash up before prayers.</p><p>“We’ll pray for that and also for food.” said Zacarias. “I hope our brothers above are safe. They haven’t brought food in a while.”</p><p>They spent a good deal of time in prayer, then after Jonathan and the others had cleaned up, the women brought out bread and cheese and figs. No one had as much as they’d like for it was necessary to ration the food as well as the water.</p><p>It was then that Zacarias called Jacob and Anna over to him. Thinking he was calling them for Story Time, for the children loved to hear his stories about the Master,</p><p>they quickly went. But when they saw their mother coming as well, they were surprised. They also noticed the fearful look on her face.</p><p>“Jacob, Anna, I have a task for you, if you choose to accept it.”</p><p>“A task?” asked Jacob.</p><p>“We want to help!” Anna assured him.</p><p>“I know you do. I know you feel there’s not much to do down here but Anna, we’re grateful that you take such good care of the babies. And Jacob, you’re a good faithful worker. But maybe you can help in another way. Your mother has agreed to allow it.”</p><p>Reluctantly, it seemed, from the look on her face. “I still would rather I did it,” said Mama, breaking into a cough.</p><p>“You’re too weak,” said the old man. It was true for although Mama’s health had improved a good deal, she was still very tired. “Besides, you’d be recognized easily. You were a prominent business woman in the marketplace. But if you really have second thoughts about Jacob and Anna doing it….”</p><p>“No, no. As long as you think they’ll be safe.”</p><p>“I would never ask them if I didn’t think so. They’ll be fine as long as they obey my instructions.”</p><p>“But what is it!” exclaimed both children, who had been trying very hard to wait patiently.</p><p>Zacarias chuckled at their eagerness. “I’d like you to go above and buy some supplies. We have money but no one to get the food. Barnabas and the others have been kind and generous but we may not be able to depend on them for long. We have to be self-sufficient down here since they could be arrested at any time. I’d like you to try it and see how it goes. This time, you’ll put on rags so that there will be no chance of anyone recognizing you. I want you to look like common beggar children. Another time we’ll give you a different disguise.”</p><p>They were thrilled at the idea, not just at getting out but also being able to help. Besides, it would be interesting to try to fool everyone in the marketplace.</p><p>“Stephanas, of course, has to go above every day but it’s not safe for him to carry too much food back. You’ll go out with him tomorrow morning.”</p><p>Stephanas was the only man among them who had a job. He would sneak out before daybreak and sometimes stay away several days, changing his route and schedule often so as not to be followed.</p><p>Jacob and Anna could hardly sleep that night for excitement but they finally dropped off. Their mother woke them very early and they smeared dirt on their hands and legs and Jacob put on an old, tattered tunic. Mama gave Anna a faded headpiece and arranged it to partially cover her face. The dress the girl wore was patched in many places. They left their sandals and went barefoot as many beggar children did.</p><p>“Come, we must go,” Stephanas hissed from the doorway of their little chamber. Mama pressed chunks of bread and some dates into their hands for breakfast and</p><p>they quickly followed Stephanas along the passageways. These were lit by lamps all along the way. They looked longingly at Tunnel Three, the passageway that they weren’t allowed to use.</p><p>“I know,” said Stephanas. “That would take us right out near the marketplace but it could crumble at the slightest weight.”</p><p>He led them instead by a long, round-about way. They would have quite a walk once they were topside. He hurried them along for soon it would be daybreak. Finally, they poked their heads up through a hole in the stone pavement and climbed out into a shadowy alley. Sure enough, pink and orange streaks in the sky overhead showed that the sun was already up. The children looked above them in delight at the rosy sky and took long breaths of the cool, clear morning air.</p><p>“You know what you’re to do. God be with you….” And their guide was gone, slipping out to the main road. Jacob and Anna were alone.</p><p>Excitedly they looked at each other, and then at a group of merchants hurrying by to set up shop in the marketplace.</p><p>“Let’s go!” said Jacob and they gleefully ran out of the alley and joined the throng of  people.</p><h2 align=\"center\" style=\"text-align: left;\">Chapter 3</h2><p>Anna and Jacob ran through the crowd that was heading for the marketplace. The two moved quickly in and out between ladies carrying baskets and pots, merchants with bolts of cloth over their shoulders, and farmers pushing carts of vegetables. There were even some herdsmen from outside the city, prodding sheep and goats along with sharp sticks. Roman soldiers on horseback galloped down the narrow streets now and then, scattering them all.</p><p>Anna and Jacob separated. Zacarias had suggested that people might recognize them more easily if they stayed together. As they entered the marketplace, Jacob was careful to avoid any of his old friends and neighbors. It was unlikely that anyone would know them, disguised as they were, but it wouldn’t hurt to be cautious. He watched Anna head for the vegetable stand with her basket. Jacob sniffed the aroma of fresh, hot bread at a nearby shop and drew out enough coins to cover the cost of a dozen loaves. The shopkeeper was so busy waiting on the many housewives bustling around his stand that he hardly noticed Jacob. The boy handed over the coins and stuffed the loaves into a  burlap bag he had brought.</p><p>He headed off to buy cheese at the next stand, and then a new cooking pot for the women. He saw Anna up ahead on the other side of the street. At this rate, they would be finished in no time.</p><p>Other beggars, some lame or blind, sat among the stands, pleading for money. Children were doing the same, begging for a coin to buy a loaf. Some were eyeing his loaves hungrily. He wouldn’t be surprised if one of the boys tried to snatch one out of his bag so he held it close. He felt sorry for them but he couldn’t give anything away. The people back at the Catacombs needed the food.</p><p>At the cheese stand, a man and his wife hurried to fill orders. Jacob got in line, hoping to be waited on quickly. He watched as a teenager herding a small flock of goats passed by. They were probably heading for the other end of the marketplace where livestock was being sold or perhaps they were going to the temple where the goats would be used for sacrifices.</p><p>Suddenly the woman at the cheese stand ran out and snatched a toddler out of harms way. The little boy, no more than two, had wandered into the street.</p><p>“Sarah!” she called sharply. “Where is that girl?  She’s supposed to be watching him!”</p><p>The next shop held pottery vases and cooking pots of all sizes. People crowded around impatiently calling for service. Jacob was glad that there was so much going on. No one seemed to look at him twice. But that all changed in a split second.</p><p>He suddenly caught sight of a large, twenty gallon water pot, jiggling on the shelf of the booth. He looked to see what was causing the jug to move and in horror saw that the toddler had escaped again. The little boy was tugging on the bright cloth covering the booth!  At the same time, customers jostled and bumped the wooden framework. The tall jug swayed back and forth, as if in slow motion, directly above the boy.</p><p>Jacob sprang into action just as it toppled off the edge of the shelf! Dropping his bag, he dived for the boy, shoving him out of the way!  The heavy pot shattered on the cobblestones, and the little boy having fallen and scraped his hands and knees, wailed in fear and pain.</p><p>Everyone was looking and chattering. People were running to see what had happened.</p><p>“You!” cried the pottery owner, pointing at Jacob. “You’re the one that did it!”</p><p>The child’s mother was scooping up the sobbing little boy. Jacob felt strong hands on his shoulders. Worse yet, as he looked back, his bread was disappearing as several beggar children snatched the loaves and dashed away. Across the way, he saw Anna running toward him and tried to motion her away.</p><p>“These beggars!  You’ll pay for this mess, boy, or I’ll see you in prison!”</p><p>“No, you won’t!” came a voice and Jacob realized that the man gripping him was the father of the child. Jacob suddenly found himself being embraced tightly instead of dragged off as he expected.</p><p>“I saw it all!  He saved my son!  That pot could have killed my boy!  It was huge!”  The man was beaming down at Jacob. “Thank you, lad!  Thank you!”</p><p>“Uh….” Jacob moved away from the man, “I’m just glad I saw it….”  He looked around, trying to think of a way to escape. Everyone was crowding around, staring at him. At least Anna was smart enough to stay put once she saw he was all right.</p><p>“I see you lost your bread!  I’ll buy you more bread!  And here!  Take some cheese!“ He thrust a round cheese into Jacob’s hands. “Take more!”</p><p>When Jacob met Anna outside the marketplace, he was so loaded down with bread and cheese and dates and figs — everything the man could think of — that he could hardly carry it all. Anna took some of it and stuffed it in her baskets.</p><p>“There’s enough here to last a good while!” Jacob exclaimed, jubilantly.</p><p>They hurried home. Wouldn’t everyone be surprised?  And they had money left for the next time.</p><p>“The only thing is,” said Jacob, as they entered the secret entrance to the Catacombs. “Every shopkeeper in the area was staring at me. All of Mama’s old friends and business acquaintances. I hope no one recognized me.”</p><p>Zacarias was concerned about that but not so much that they wouldn’t be allowed to go back in a different disguise.</p><p>“It’s God’s provision!” he said. “We’ve just found that our brothers who usually bring us food are in jail. We must be able to get it on our own. This will last many days!  You were right, of course, to help the little boy. We mustn’t be so afraid that we stop being kind and doing good as Jesus taught us to do.”</p><p>Jacob and Anna were happy that night. The group feasted and everyone had plenty to eat for a change. And the children looked forward to the next time they could go above, wondering what adventure awaited them.</p><h2>Chapter 4</h2><p>Anna and Jacob slipped stealthily from behind a large arched gate. They had come up from the Catacombs a different way today, into the garden of a rich friend of Zacarias’. In the damp morning mist they had met the man in the corner of his estate behind a huge olive tree. Even his servants wouldn’t notice them there.</p><p>“There is news,” he told them. “James was killed.”</p><p>The children looked at each other sorrowfully. They had never met the disciple James but they had once heard him preach.</p><p>“But Peter!  What a miracle!  God sent an angel to lead him out of prison!  Past a whole squad of soldiers!  Tell Zacarias he’s left the city for now until the danger passes. How are you people doing down there?  I can’t imagine, in those tunnels….“</p><p>“We’re all right.”</p><p>“If you need a place quickly, you’re all welcome here. I have plenty of room.”</p><p>“Zacarias doesn’t want to put you in danger,” said Jacob. “You’re under suspicion as it is. But he thanks you.”</p><p>“It’s true that I can’t trust all my servants but if there’s an emergency, we’ll manage for overnight, at least. They’ll keep quiet if I give them extra privileges and favors. I’m good to them and they wouldn’t want me in jail and this place taken over by the Romans. But if so, then it’s the Lord’s will.”  The man pressed a small pouch filled with gold coins into Jacob’s hands. “Take this and promise you’ll come to me if you need anything.”</p><p>“Yes, sir. Thank you, sir.”</p><p>The children left the secluded garden and walked from the wealthy section of the city toward the marketplace.</p><p>“There’s a fortune here,” said Jacob, handing some of the gold to Anna and tucking the rest safely into the belt of his tunic.</p><p>Today he was dressed as a Roman. He looked as if he were straight from the home of a wealthy politician. He didn’t cower humbly like a beggar boy. He stood erect, looking firmly and proudly at the Jews around him, as if they were nothing but slaves. Anyone looking at him was sure he would be one of the hated Romans, in authority over them one day.</p><p>Anna drifted away as if she didn’t know him, her silk and satin robes rustling. She, too, haughtily addressed shopkeepers in her role of a wealthy daughter of a Pharisee or scribe out doing some shopping.</p><p>They filled their bags and baskets quickly, planning to meet outside the market place and enter the Catacombs a different way than they had come. Suddenly, however, Jacob saw a familiar face. He ducked back behind a booth.</p><p>It was Sarah, the daughter of the cheese merchant. What was she doing way out at this end of the marketplace. When Jacob and Anna used these disguises, they didn’t visit the same booths as when they were pretending to be beggar children. It was safer that way.</p><p>Jacob was surprised when she followed him around the booth and faced him. “So, it’s the little beggar boy that’s so brave,” she said sarcastically.</p><p>Jacob almost panicked. Lord, help me, he breathed and felt a calmness from God. Aloud he said in the scornful tone of a Roman, “how dare you speak to me in such a manner?”</p><p>“Still playing games?” asked Sarah, undaunted, her hands on her hips. “Something’s not right about you — and your sister. Oh, you think I don’t know she’s your sister? I heard the other shopkeepers talking about your mother who used to sell dyes and cloth right near our booth. She was put in prison and never heard from again. I know who you are!  You’re one of those Jesus followers!”</p><p>Jacob really did panic now. She could betray both him and Anna. And he knew she’d do it. She’d hated him ever since the day he’d rescued her little brother. While the parents were still grateful, pressing food and treats upon him every time he passed their shop in his beggar disguise, Sarah always glared at him with hatred. He thought perhaps she’d been scolded or punished for not watching her baby brother that day. Whatever the reason, it was clear that she despised him.</p><p>“You’re looking much better today,“ she continued, her voice laced with sarcasm. “My, my. Meat?  Chicken?  And a Roman tunic?”</p><p>He glanced down at the chicken he held by the feet. He had splurged and bought beef and fowl since their wealthy friend had given him so much gold. The band of believers hadn’t had meat in such a long time. Would she call a soldier or try to follow him?  How could he let Anna know?</p><p>“But why are you doing the shopping?  Don’t you have Jewish slaves for that?” she taunted.</p><p>“I….” Jacob stammered, not knowing what to say.</p><p>“Oh, I know your secret!”  she hissed, furiously. “And you’re going to be sorry!”</p><p>Suddenly there came a voice from somewhere above. “You!  Boy!”</p><p>Jacob looked up and to his surprise and horror, a Roman soldier on horseback stared back at him!</p><p>“Boy, come with me!”</p><p>There was no place to run. Jacob knew it was all over now. He’d better go quietly. Was this Sarah’s doing?  Apparently not, for he noticed her quickly slipping away through the crowd. He caught the look on her face and for all her bravado, the sight of the tall, muscular Roman in full uniform on his mighty war-horse had terrified her.</p><p>“Please,” the man hissed, more softly now, “follow me. I must talk with you.”</p><p>Please?  How long since a Roman soldier said please to anyone!</p><p>Suddenly Jacob recognized him. It couldn’t be!  But it was. The Roman soldier who had helped them escape from the dungeon!</p><p>Jacob quickly signaled Anna who was looking on in terror. He could tell by her expression that she was wondering how he always managed to get into these things. But she trusted him and caught up quickly. They followed as the man turned his horse and headed out of the marketplace.</p><p>“Who…what….”  She was speechless at this predicament.</p><p>“It’s the soldier that got us out of prison!”</p><p>Her eyes turned to the back of the soldier in amazement. “Are you sure?  What does he want?”</p><p>“I don’t know. I would think he would have been gone out of the city long ago. But it looks like he’s been reinstated.”</p><p>“Maybe he got a pardon.”</p><p>If that was true, they could be in big trouble after all. What did he want with them?</p><p>But there was nowhere to go. They were out of the crowded marketplace now and if they tried to escape, the man could run them down in no time.</p><p>The soldier looked back. “It’s all right. Don’t be afraid. I thought I recognized you the other day. Come with me, please. I need to ask you something.”</p><p>He led them to the gardens outside the city and dismounted.</p><p>“How is your mother?”</p><p>“She’s doing  better. She’s not sick, anymore.”</p><p>“Good, good. And you’re well?”</p><p>“Yes.” Jacob couldn’t conceal his curiosity, “But sir, what about you?” he gestured at the man’s uniform and horse.”</p><p>The soldier grinned. “They think I saved the guard’s life instead of starting the whole thing. I was pardoned by Herod himself for my — indiscretion — that got me in prison in the first place. Really, you needn’t be afraid. I won’t haul you into court for being of The Way.” He smiled reassuringly at Anna who was still very much frightened. “I was so glad to find you. I thought you might tell me about your Jesus. I’ve been thinking a lot about him.”</p><p>The children were astonished. Yet he seemed sincere.</p><p>“I could get someone to help you….” suggested Jacob. Zacarias hardly ever ventured from the Catacombs but he would for this. He would risk his very life to tell someone about Jesus. “We could set a place to meet.”</p><p>The Roman looked disappointed. “I was hoping to find out today. I don’t want to wait. Can’t you tell me?  You both were willing to die for Him. Surely you can tell me what’s so special about Him.”</p><p>So they sat on the grass under a tree, the stallion grazing peacefully nearby. They sipped cold water from the soldier’s flagon and ate honey cakes and fruit from his saddle bags. He told them his name was Marcus and they talked for a long time. Jacob and Anna told him all they knew about Jesus and the ancient prophecies from the Old Testament. He’d heard of Jesus’ crucifixion of course. He’d heard the rumors of the resurrection, as well, but didn’t believe them. Now he wasn’t so sure.</p><p>“You’ve given me many things to think about,” he said, as he rose and mounted  his horse. He grinned. “I’m sure you two aren’t as wealthy as your clothes suggest. Here.” He tossed them each a gold coin. “For your time.”</p><p>“You don’t have to pay us, sir. Not for such a thing as telling you about our Master.”</p><p>“I have a feeling this was the most important discussion I’ve ever had. Take it.”</p><p>And he whirled his horse around and was gone. Jacob added the coins to his pouch and they hurried back into the city. They wound their way through the streets, going a long roundabout way to one of the hidden entrances to the Catacombs. As kind and trustworthy as the solider had seemed, they had been taught to be very careful. They</p><p>didn’t think he  would  pretend to be so interested in Jesus just to betray them but they couldn’t know for sure.</p><p>They wondered what would happen when they arrived back. They had good news and bad news. They had plenty of money to last a long time but two people knew their identity. Would Zacarias let them leave the Catacombs again or would he think it unsafe?</p><p>Whatever the outcome, they were glad that God had used them to tell Marcus the good news of the gospel.</p><h2 align=\"center\" style=\"text-align: left;\">Chapter 5</h2><p>Anna was in a grumpy mood. As she chased little Isaiah down the tunnel yet again, she wished she were any place but here. She scooped the three year old up in her arms, in spite of his yells and squirming.</p><p>“You need to stay in the chamber with the other children,” she scolded. “You can’t just go running off down the tunnels.”</p><p>Oh, she was tired of babysitting. There were half a dozen little orphans whose parents had been executed and several other children as well. As she helped the women each day, she sometimes got weary of being the one who had to run after the toddlers when they escaped from the nursery. Little dark-haired Isaiah was the worst. As cute as he was, he was sneaky. He could slip out and disappear before anyone noticed if they didn’t watch him every minute.</p><p>Anna put the child down and drew a toy from a pocket in her robes. As she gave it to him to play with, he stopped crying and was content for the moment. She leaned back against the cool stone and enjoyed the quiet, away from the busy nursery.</p><p>She knew deep down why she was so irritable. It wasn’t really the children. Most of the time, she liked taking care of them.</p><p>“It’s because Jacob got to go up and I didn’t,” she said aloud softly. “I’m sorry, Lord God. I know I shouldn’t be jealous but I wanted to go so much.”</p><p>It had been a long time since Jacob and Anna had been above. They had been correct in their hunch that Zacarias wouldn’t allow them to go out anymore.</p><p>“You’ve done a good job,” he told them. “but there’s too many people who know who you are. It’s just too dangerous. You could be followed and we all could be discovered.”</p><p>For several months, he had sent others out to buy food and get information but today, most of the women were getting over an illness that had been going around. The men, of course, would be recognized immediately as many had been prominent in the church and government. Stephanas hadn’t been heard from for some time. Though he often stayed out several days, he hadn’t come home from work in over a week. They were afraid he had been caught.</p><p>Due to the fact that there was just no one else, Zacarias had asked Jacob to go buy the food. She knew he had seen in her eyes that she longed to go too.</p><p>“No, Anna,” he said kindly. “It’s just too dangerous now for the two of you to be seen together. Besides, we need you here what with all the women sick.”</p><p>Anna had nodded, trying to keep back the disappointment. After all, he was the leader and knew best. But it hadn’t stopped her from feeling jealous. Now, as she confessed her sin, she knew that God had forgiven her.</p><p>I’ll do the best I can in the job You’ve given me to do, she promised silently to God. Then suddenly, “Isaiah!  You come back here, right now!”</p><p>The little boy had gotten tired of the toy and suddenly jumped up and took off. Anna raced after him. She realized that they were getting close to Tunnel Three.</p><p>“Don’t you dare go in there, Isaiah!  That tunnel is forbidden. It could collapse on us!”</p><p>She grabbed him and lugged him back. In spite of his yells, she sensed movement and looked. Was that a shadow?  Was someone coming out of Tunnel Three?  Maybe the men were checking it, as they did sometimes.</p><p>“Who’s there?” she called.</p><p>No one answered. She stepped forward, putting her hand over Isaiah’s mouth trying to hush him. She listened carefully. It almost sounded like footsteps, then nothing. Finally she shrugged. She must have imagined it. Isaiah wiggled and scrambled away and it took all her attention to get him back to the nursery.</p><p>They had almost reached the chamber when someone came running toward them.</p><p>“Stephanas!  It’s  Stephanas! He’s back!”</p><p>People along the tunnel poked their heads out of their chambers. They came quickly, gathering in the big room where Zacarias was tending to several bruises and a large cut on Stephanas’ face.</p><p>“They got me!  I’ve been in jail all week,” he told them, shakily. “They let me go, finally. I never want to go back there!”</p><p>“You’re safe now,” someone told him.</p><p>It suddenly struck Anna that maybe they weren’t safe. Had she really seen something back at Tunnel Three?</p><p>“We’ll get you something to eat,” one of the women was saying.</p><p>As the group was occupied caring for him, Anna quietly moved toward Zacarias. He always wanted to know of anything unusual but it seemed like such a little thing that she didn’t want to say it in front of the whole group.</p><p>But Zacarias always listened courteously, even to the children. He drew her away to a quiet corner as she told him about Isaiah running off and what she had heard.</p><p>“I’m not really sure if it was anything at all,” she said.</p><p>He looked concerned just the same. “Thank you, Anna. It’s always best to be cautious.”  Then he glanced at Stephanas. He raised his voice over the chatter and said, “Stephanas, which way did you come in?”</p><p>The young man hesitated, as if surprised at the question. Then he said, “why…the front entrance, of course.”</p><p>Zacarias pursed his lips thoughtfully but turned away to speak to Jonathan, one of the other men. Jonathan soon disappeared out the door. Anna supposed he was going to check Tunnel Three. When Jonathan came back, she watched carefully. He shook his head at Zacarias and spoke a low word.</p><p>Obviously, he had found nothing and she should have been relieved. But she wasn’t. She had a strange feeling about it all but she was also rather embarrassed and wished she hadn’t said anything. Would Zacarias and Jonathan think she was silly?</p><p>To make matters worse, she was getting worried about Jacob. He really should have been back by now. Lord, keep us all safe, she prayed.</p><h2>Chapter 6</h2><p>When Anna woke the next morning, she had no idea it would be her last day in the Catacombs.</p><p>At breakfast, Mama told her that they were sending one of the men to check on Jacob. He had not returned the night before and they were all concerned. Zacarias asked Stephanas to go but the young man just wasn’t himself. He quickly refused, apparently frightened at the very thought of going above. As Anna ate her bread and fruit and watched the young man from across the room; he seemed dejected and anxious.</p><p>“His experience in prison has changed him,” said Zacarias, quietly, “but he’ll be all right in time. Jonathan, will you go up and look for Jacob?”</p><p>“Of course.”</p><p>“Be very careful. Everyone knows you were a follower of Jesus. Even though you weren’t one of the Twelve you traveled with them. The Jewish leaders will recognize you.”</p><p>“I’ll be careful.”</p><p>At morning prayer time, Stephanas was very jumpy. Soon they found that there was more wrong than they thought at first. As they gave prayer requests, he said, “I wish I had the courage that the other disciples do. When they’re put in prison they’re so brave. All I wanted to do was get out and hide.”</p><p>“Nobody likes to be in jail, Stephanas,” said their leader. “Nobody likes to be persecuted. But God gave you strength to go through it. You said you told another prisoner about Jesus while you there. That took courage. You’re just tired and scared right now. You’ll feel better in a few days.”</p><p>Stephanas put his face in his hands and groaned. “But there’s more. I must confess to you that I told a lie.”</p><p>“Tell us about it,” said Zacarias, kindly.</p><p>“I put us all in danger. I came in the Tunnel Three entrance instead of the front entrance as I told you.”  He looked at Anna. “You were right. It was me you heard. I didn’t answer when you called out. It was wrong to break one of our most important rules but the soldiers were following me. I suppose they wanted to see if I would lead them to our hiding place.”</p><p>“So you panicked?” said one of the men.</p><p>Stephanas nodded. “I didn’t want to be caught again. I didn’t want to ever go back in that horrible dungeon! So I took the short cut and came down Tunnel Three. It was crumbling all around me. It could have come down on all of us.”</p><p>Zacarias put his arm around the young man. “We forgive you, Stephanas. God does too. And the tunnel didn’t collapse. Jonathan checked and it looks all right.”</p><p>After prayer time, as Anna went to her work in the nursery, she prayed for her brother and tried to keep trusting God to keep him safe. Soon the children took all her attention for they were filled with energy this morning. Isaiah was more wound up than</p><p>ever and raced right out past them all, laughing and dancing out of their reach. Then he turned and ran down the tunnel.</p><p>Anna dashed after the three year old and quickly caught up with him. She scooped the little boy into her arms. “Oh, you’re so naughty. But not today! You’re going right back to the nursery and you’re going to stay there!”</p><p>They were close to Tunnel Three again and she suddenly stopped. What she heard confused her. It sounded like water splashing, although it was actually more like a roar. Why it was water!  She peered around a corner and stared in shock. Far down at the end, near the entrance, it poured in like a waterfall.</p><p>But where was it coming from?  Perhaps the cisterns above had cracked and the water had broken through!  Suddenly a huge chunk of rock broke off and a great wall of water burst in. It rolled and splashed down the tunnel toward them!</p><p>Anna turned and ran, Isaiah bouncing and squealing in her arms!</p><p>“Get out!” she screamed, as she passed several chambers and entered the nursery. “Get out! Tunnel Three! It’s flooded!  The water will be here any minute!”</p><p>Zacarias came running. He took in the situation at a glance. “Go! Everyone!  Now!  No, don’t stop for your things!”</p><p>A thunderous rumbling suddenly turned their attention back to Tunnel Three.</p><p>“It’s collapsing! The whole tunnel’s coming down!  Take the alley entrance!  We won’t make it to the front entrance! Be calm, everyone, but go quickly.”</p><p>Women grabbed babies. Old men hobbled along as fast as they could go. The young boys who had been in class with their teacher, helped the toddlers and widows.</p><p>They hurried along the maze of tunnels as water rushed after them, filling up the passageways as it splashed along.</p><p>Stephanas was in shock. He was crouched near a wall and couldn’t seem to move. “It’s all my fault! I shouldn’t have come down that entrance. It’s all my fault.”</p><p>Zacarias grabbed his shoulders. “It’s not your fault. You probably didn’t help it but something’s going on with the cisterns above us. You didn’t cause the water to come through! Now go!” Their leader forced Stephanas up and pushed him along. “Here, take Isaiah.”</p><p>Zacarias pulled the little boy out of Anna’s arms and shoved him into Stephanas’. The young man came to his senses and ran with the frightened child.</p><p>Zacarias whirled around to Anna. “I have a job for you. When you get above I want you to run to my friend’s estate. Tell him there’s an emergency and that we’re coming there. But we need to give him time to get ready for us. Come back to tell us if all is well.”</p><p>Anna nodded and raced ahead, glad that there was something that she could do to help. She cautiously rose up into the alley. Here there was an old broken-down stone house  where they could all hide.</p><p>She quietly joined the crowds on the way to the market place. Finally, she turned a corner and broke into a run. She looked like any other child who was running along the city streets, going on an errand. It wasn’t long before she reached the estate and was knocking on the door of the large, beautiful house and explaining it all to Amos, the friend of Zacharias.</p><p>She was told to sit and rest a minute. She waited on a luxurious couch and a servant brought her a cold drink. As Amos hurried off to give orders and make things ready, Anna had time to wonder, why did God allow such a thing?  They had lost their hiding place…their home…and all their possessions. They couldn’t stay here for long. It wasn’t a good hiding place since politicians and Jewish leaders visited all the time. Why would God do this to them?</p><p>***</p><p>Jacob was on his way through the city streets, hurrying to get back home. His mother would be so upset. Zacarias would never give him anything to do again!</p><p>Suddenly he spotted Jonathan, so tall that he was head and shoulders above the crowds.</p><p>“Jacob! Praise Jehovah! You’re all right. What happened?”</p><p>“I’m sorry! There’s Romans everywhere. There were soldiers near every entrance until late last night. They’re watching us more and more closely. The governor’s orders, I heard!  I hid in the gardens and fell asleep — and slept all night!”</p><p>“It’s all right,” Jonathan put a hand on his shoulder. “All that matters is you’re safe. Of course you did right to wait. But come, your mother’s worried.”</p><p>They approached the main entrance of the Catacombs and stopped short, ducking behind a wall.</p><p>Roman soldiers! They were everywhere!</p><p>“They’ve discovered us. They’re going down into the tombs!”</p><p>“We’ve got to warn the others!”</p><p>“Come on, around to the alley entrance. Although I don’t think we’ll make it in time to get down and warn them.…”</p><p>Jacob thought of his mother and sister back in that cold, dark dungeon again. Please Lord God, no.…</p><p>But as they fought their way through the crowds and dashed into the alley, there were their friends, climbing up out of the hidden entrance, disappearing into the old abandoned building.</p><p>Jacob’s shoulders slumped in relief. They were safe. “But how did they know the soldiers were coming?”</p><p>Jonathan shook his head. “I don’t know. Let’s go find out.”</p><p>Together they all waited in the dark building for Anna to return with news from Amos. In the meantime, they thanked God for sending the flood that had saved them from the Roman soldiers’ raid.</p><p>One of their teachers would one day say “all things work together for good” and they would know that it really was true. God could use even a flood to help them.</p><p>The question now was what did God have planned for them next?</p><h2>Chapter 7</h2><p>Anna slipped through the shadowy entrance of the old abandoned building. The little band of Christians was eagerly waiting for her.</p><p>“Amos says we are welcome at his estate but he asks that we wait until late afternoon. His head steward is not to be trusted. He’s not a believer and may betray us. Amos has been meaning to send him on a business trip so he’s leaving immediately.”</p><p>Zacarias nodded. “We shouldn’t venture out until after dark anyway. It’s unfortunate that we couldn’t get to the opening near the estate. But thank you, Anna.”</p><p>The girl handed over a large sack. “He sent food.”</p><p>The meat, bread, and cheese that the man provided along with the food that Jacob had bought at the market the day before, was plenty for their noon and evening meals. They didn’t leave their hiding place until late that night. Jonathan went out frequently, scouting the area. He discovered that many soldiers were on patrol.</p><p>“They know we were down there,” he told them. “Our supplies were floating around. They weren’t expecting that flood of water rushing at them and they had to run. They went back later and found our things. They’re very angry that we escaped.”</p><p>Jacob and Anna couldn’t help wondering is someone had betrayed them. Could it have been Sarah, the sister of the little boy Jacob had rescued?  Or perhaps Marcus?  It was more likely that it had been the soldier. They hated to believe that Marcus would do such a thing but you couldn’t trust anybody these days.</p><p>It was nearly midnight before all the people, in small groups, had been led by various routes to Amos’ estate. Jacob and Anna knew the way so they helped Zacarias.</p><p>Amos welcomed them, gave them a meal, and led them to luxurious rooms where they slept on comfortable pallets on the floor. Servants brought blankets and all that they could possibly need. Some of the Christians had never seen such riches. When they prayed together that night, they thanked God for saving their lives and keeping them from the Romans.</p><p>“God’s ways are full of twists and turns sometimes, but in the end He works all things out for the best,” said Jonathan.</p><p>Meanwhile, Zacarias and Amos were making plans. Zacarias knew that they couldn’t stay at the estate for long.</p><p>“Why don’t you get some sleep,” said Amos. “We’ll think more about it in the morning and pray about what He wants you to do next. I have an idea and I sent a runner to get the information I need.”</p><p>Finally, all was quiet as the refugees and their host slept peacefully.</p><p>***</p><p>The Christians enjoyed their day at Amos’ estate. They helped with the work or just relaxed in the beautiful house and grounds. After their many months — and for some years — in the dark underground tunnels, it was good to be out in the open air. But they were wary. If the servants who were on guard came running to say a visitor had arrived, everyone scattered to their rooms and stayed there until it was safe, keeping the babies as quiet as possible.</p><p>Finally Zacarias met with the group and said, “We have decisions to make. I’m wondering if it’s time for us to leave the city. I know most of us have lived here all our lives. God brought us through the terrible persecution of the Jewish leaders and protected many of us.”</p><p>They all nodded. They remembered those horrible days when Saul of Tarsus and others were dragging them out of their homes and killing so many of them.</p><p>“But,” Zacarias continued, “the Romans are tightening their security. Other Christians have left and made new homes in other cities. It’s not totally safe anywhere but in some of those places, we would at least be free to live and work and worship.”</p><p>“You mean go to the Greek cities?” asked one.</p><p>“They worship all kinds of idols. I’ve heard there’s statues everywhere. They do sinful things and believe all kinds of strange ideas,” said another.</p><p>“It’s true that the Greeks live much differently than we do but think of how much</p><p>these people need to hear about Jesus. We would have wonderful opportunities to tell them. They like to discuss new ideas,” said Stephanas. “I’ve been talking to one of the slaves here. He’s a Greek and he told me how happy he was to hear the truth from Amos about the true God.”</p><p>“They are still ruled by the Romans. We will never get away from soldiers.”</p><p>“That’s true but there is a bit more freedom in these places. People of all different religions and beliefs live there.”</p><p>“How would we get there?  We would have to go by caravan and some of us can’t walk that far. And what about the little children and babies?”</p><p>Zacarias held up his hand. “If we choose to do this, Amos will provide wagons to get us to the coast and pay our passage so that we can go by ship.”</p><p>There was a gasp. “For all of us?” asked one man.</p><p>That was a lot of money. Amos truly was a generous man.</p><p>“How can we ever thank him?” they murmured.</p><p>“He wants to do this for us. He wants to do it for the Lord,” said Zacarias, “And he has some friends in one of the cities that’s right on the coast. It’s called Perga. They would help us get settled. Just think, we could work and make our own money again and live like normal people. But if we want to stay in Jerusalem, he will help us find safe places here.”</p><p>There was much discussion and prayer and finally most of them decided to take Amos’ offer. The runner that Amos had sent to Caesarea to check on times and fare had returned with all the information they needed. The ship would be leaving the next day.</p><p>“You’ll have to start at dawn to get to the coast. The ship leaves in the afternoon,” Amos told them.</p><p>Jacob and Anna were very excited. They had never been out of Jerusalem and the thought of traveling by ship to a whole new life in a Greek city thrilled them.</p><p>Mama was enthusiastic, too. “Everyone needs cloth. We’ll be able to start our business again!”</p><p>The plans went on. Amos sent his servants out to buy some new clothes and he provided blankets and bedrolls for them to take on the long trip. Everything was going perfectly—it seemed.</p><p>They were all in the big parlor when Jacob and Anna looked toward the door startled. Remus, the Greek slave, came running in, interrupting his master right in the middle of a discussion with Zacarias and the other men. The women and children on the outskirts of the group, moved closer to hear better.</p><p>“Sir! Forgive me!” He tried to catch his breath.</p><p>“What is it, Remus?” asked Amos, quickly rising from his seat. The servant girls he had sent to the market came rushing in as well.</p><p>“You are betrayed, sir. Sosthenes didn’t go on the business trip. We saw him outside the garrison talking with both Roman soldiers and Jewish leaders. They’re coming!  They’re on their way!”</p><p>Amos took charge. “Remus, go hitch up the wagons. All of you must leave now. Disguise yourself any way you can and head for Caesarea. The ship I’ve booked passage on will be ready for you to board.”   He shook his head, sadly. “Sosthenes is a good steward but very greedy. He knows he can get a reward for turning you in. Go. I’ll hold the Romans off.”</p><p>“Sir,” said Remus. “You must go, too. They’ll arrest you.”</p><p>“But….” “You must, sir,” the slave insisted. “We heard them talking, didn’t we!”</p><p>The servant girls nodded excitedly.</p><p>“Yes, I suppose you are right,” Amos gave in sadly, then looked around at them all. “Well, go! There’s no time to lose!”</p><p>Everyone scattered and within a few minutes, they were squeezed into several wagons and on their way. Most of the servants were coming, too, for they would be arrested and perhaps tortured for information if they stayed.</p><p>Jacob and Anna wondered what would happen to the beautiful estate. As they rumbled through the city gates, they also speculated if they would ever see Jerusalem again.</p><p>They turned onto the road to the coast. They would travel all night and perhaps be able to get safely on board ship and hidden before daylight.</p><p>“The captain is a friend,” said Amos. “He will let us board early and stay below deck.”</p><p>Jacob and Anna were glad that Amos had so many helpful friends but they also knew that it would take more than human friends and human strength. All along the way God had been protecting them and they were sure that God would continue to keep them safe.</p><h2 align=\"center\" style=\"text-align: left;\">Chapter 8</h2><p>“I don’t like not knowing where we’re going,” complained an old lady as they jounced and jolted over the road to the coast. “I’m too old for this.”</p><p>“Perga!  Perga! We’re going to Perga!” shouted little Isaiah. He couldn’t sit still and was bouncing around even more than usual.</p><p>“I know we’re going to Perga,” said the old lady, dejectedly, “but we don’t know anyone. We don’t know what we’ll do when we get there. I’m tired of moving around and having to trust strangers. I hate never knowing if someone’s going to betray us or not.”</p><p>“God has provided in so many ways,” said Zacarias gently. “And Amos knows people there. We’ll be all right.”</p><p>Anna knew that the old lady had reason to be disheartened. She had been in the Catacombs ever since the first persecution, since the stoning of Stephen. Her husband and grandson were still in jail, having been betrayed by neighbors.</p><p>“Sometimes I wonder if it’s worth it. It seemed so right when the Lord was here, preaching to us all and healing and doing miracles….”</p><p>“That’s what I wondered when I was in jail,” said Stephanas. “But it is worth it. We’ll be in heaven with the Lord someday and until then I want to help as many people as I can to know Him!”</p><p>Stephanas seemed much better since he had made friends with Remus, the Greek slave. Remus seemed to glow with excitement about knowing the true God. He told them all that it was as if he had turned from the darkness of sin and idol worship to the light. One of the Twelve sometimes spoke of Jesus as being the Light of the World so they understood what Remus was talking about. Anna was glad God had given Stephanas a new friend to encourage him.</p><p>“Jesus told us we would have tribulation,” Zacarias was saying. “He told us that families would betray each other and friends would betray friends. We must expect it but remember what else He said….”</p><p>Everyone enthusiastically repeated the familiar words of Jesus with their leader, “‘Be of good cheer, I have overcome the world!’”</p><p>At that moment, the gates of Caesarea came into view. As the group made their</p><p>way through the streets of the city to the docks, they stared and stared, trying to see everything at once.</p><p>For some it was the first time they had seen the ocean. It seemed to go on forever!  Jacob and Anna watched the ships and fishing boats and all the activity as supplies and goods were loaded and unloaded.</p><p>After a few questions, Amos quickly found their ship and talked to his friend, the captain. He paid the gold that was required for all of them to book passage and got permission to board early so they could get out of sight below deck.</p><p>“It’ll be dark and smelly and cramped,” he told them, “but once we’re out to sea, it will be safe to come back up.”</p><p>“Isn’t this wonderful after being underground for so long!” cried the old lady.</p><p>Anna was glad the woman was happier now. As for herself, she thought she could never get enough of the fresh smell of the sea air and the pleasant wind whipping at her mantle. Reluctantly she followed Jacob as they all headed for the ladder that would take them below to the hold.</p><p>Suddenly they heard a commotion on the wharf. Soldiers on horses were galloping towards them. Sailors, slaves, and merchants scattered to let them pass. The soldiers were coming straight toward their ship!</p><p>“Quick!  Get below deck,” urged the captain, but before they could move, the soldiers skidded to a stop and brandished their swords.</p><p>“Stop!” shouted the commander. “You are under arrest!”</p><p>Jacob grabbed Anna’s hand, protectively. They couldn’t believe this was happening again!</p><p>A group of men came rushing up behind the soldiers. Jacob and Anna recognized them as Jewish leaders from Jerusalem. They had been followed!</p><p>“That’s them! Heretics! Blasphemers! Arrest them!”</p><p>All was confusion for a moment. Until a Roman soldier emerged from the captain’s chambers where he had apparently been eating a meal for he still held a chunk of bread in his hand.</p><p>“What’s happening here?”</p><p>Hearing a familiar voice, Jacob and Anna whirled around. It was Marcus!  They looked at each other in dismay. So he had betrayed them. And the ship captain must be in on it, too!</p><p>But suddenly Marcus met their gaze, saw their mother next to them and seemed to recognize her. He put down the bread, walked over to the rail and called, “Centurion!  What is all this!  Who are these men?”</p><p>The commanding officer of the group of soldiers instantly saluted. “Sir, they’re members of the religious council in Jerusalem. They tell us these people are traitors against the Roman government. We’re here to arrest them.”</p><p>“But they are already my prisoners. I am taking them to Rome for trial before Caesar. You may go.”</p><p>The group of believers tried their best not to look shocked at this. They realized that this soldier, who was a stranger to most of them, was trying to help them.</p><p>The centurion looked uncertain. “Sir,” he ventured, “I see no chains. Why aren’t they bound?”</p><p>“Look at them!” roared Marcus. “They’re sick and weak. There’s old people and little children. Does it look as if I need to bind them?”  He turned to the believers. “Get in the hold!  Now!”</p><p>The group turned and headed down the ladder, trying to look as meek and downtrodden as they could.</p><p>“See?  They will be no trouble, especially when we’re out to sea. I don’t know where you got your information but these people are already in my custody.”</p><p>“Yes, sir.”  The centurion and his men quickly wheeled their horses and trotted off. As Jacob and Anna watched, waiting their turn at the ladder, they couldn’t help laughing at the sight of the Jewish leaders racing after the soldiers, calling, “Wait!  Wait!  There’s been a mistake!  You must arrest them!”</p><p>They didn’t look at all dignified at the moment as their coats flapped in the wind. Soon they all were gone.</p><p>“All our passengers are here and our supplies loaded. I don’t think it would hurt  to be off a bit early, do you?” asked the captain with a twinkle in his eye.</p><p>“A very good idea,” agreed Marcus. “Let’s be on our way. They’ll be back when they check the orders.”</p><p>Jacob came forward and introduced him to Zacarias.</p><p>“Sir,” said Zacarias, “I can’t say that I condone lying, even to keep us out of prison, but thank you. We are most grateful for what you have done.”</p><p>“What are you doing here?” asked Jacob.</p><p>“I’ve been transferred to Ephesus, one of the Greek cities. That should be interesting, I like seeing new people and places.”</p><p>“That’s not far from where we’re going!” said Jacob.</p><p>“This is wonderful,” grinned Marcus. “I was disappointed to be leaving Jerusalem before I saw you two again. I wanted to talk more about Jesus. I have many questions. This is your leader?  How fortunate. Perhaps your God had a hand in all this! ”</p><p>The men and Jacob went off to talk with the soldier while the women excitedly set about getting their supplies and food in order. The captain shouted out orders to his men and they prepared to set sail.</p><p>The old lady, with tears of joy in her eyes at their wonderful rescue, said, “yes, God did have a hand in this!  I won’t doubt anymore.”</p><p>Anna gave her a hug. She was sure they would find a good place to live and work and believers to worship with in Perga. And she had a strong feeling that soon Marcus would know the true God, too.</p><h2>Chapter 9</h2><p>Jacob gave the customer her change while his sister handed over the bolt of bright colored cloth. Mama was busy filling another customer’s order. They were certainly doing well in their new business.</p><p>The small group of Christians were settling into life in the coastal city of Perga. The voyage from Caesarea, after it’s frightening beginning, had been very calm. They had all felt secure for the first time in a very long time. They knew that soldiers might be waiting for them when they docked but for the moment, out in the middle of the ocean, they were safe.</p><p>Marcus had long discussions with Zacarias and the other men and sure enough, it wasn’t long before he became a follower of Jesus, too. They had been allowed to have worship services on deck. Marcus and the captain attended, though most of the other passengers and sailors weren’t interested.</p><p>Finally, upon arriving in Perga all was quiet and they found Amos’ friends very kind. The group was welcomed into homes and the believers in Perga helped them find places to live and get work.</p><p>Now Jacob looked out into the busy marketplace from their little booth. He thought about the business man in the Perga church who had trusted them and lent them the money to restart their business. They were doing so well that it wouldn’t take much longer to pay him back.</p><p>They missed Father, though. Jacob and Anna worked very hard to take his place</p><p>in the business. Anna did the housework during the mornings, then when Jacob got out of school, they both joined Mama in weaving and dying the cloth in order to have enough to sell. But they didn’t mind the work. It was wonderful to be living like normal people again and making their own money.</p><p>For the most part, the believers in Perga were able to worship in freedom and safety. Some of the Greek people didn’t like the Christian teachings and there were Jewish leaders here, too. But they weren’t as cruel and hateful as in Jerusalem.</p><p>Marcus had gone on to his new post in Ephesus but had promised to visit. So far, he had written several letters already. He was thankful that his commander didn’t mind if he was a Christian as long as he did his job well. There may be trouble later for it was expected that Roman soldiers worship the emperor. But for now all was well. The large church in Ephesus had welcomed him and he was learning many things about his new God.</p><p>Suddenly Jacob’s thoughts were interrupted.</p><p>“He’s coming! He’s coming! He’s just outside the city. Don’t forget to come early!  We’re all going to have supper together!”  One of the young girls from the Perga church hopped up and down excitedly outside their booth as she gave this message to Mama; then she ran on to tell others.</p><p>Jacob and Anna glanced at each other. Their family wasn’t as excited at the coming of the visitor as the Christians from Perga were.</p><p>“Well, let’s pack up then,” said Mama. “Most everyone’s done shopping for the day, anyway. We need to stop at the house to get the food I prepared for the feast</p><p>tonight.”  She looked at her children and smiled bravely. “We can do this. I know it’s hard but God has forgiven him and so can we.”</p><p>***</p><p>A while later, the small group of Jerusalem Christians smiled politely in welcome but the Perga Christians were nearly beside themselves with excitement.</p><p>“If it hadn’t been for him, none of us would know about Jesus!”</p><p>“He’s gone through great persecution! He’s been all over telling people about Jesus!  He’s so brave!”</p><p>“He started our church here. If it wasn’t for him, there would be no church!”</p><p>“Here he is! It’s Paul!. And Barnabas!  Is the food ready? They must be hungry and tired! Have them come in!”</p><p>The men were gathered together, ready to greet the travelers. The women and children stood nearby. The Jerusalem Christians were glad to meet the great preacher, too, but the others loved him like a father. He was their teacher, the one who had led them to know the truth. In the family of God, it was as if they were his spiritual children.</p><p>Jacob was up with the men. He had had his birthday on shipboard and now that he was twelve, he was considered a man. He could sit in on their Bible study times and discuss the Scriptures with them.</p><p>The men surged forward and greeted Paul and Barnabas and the others. The great teacher wasn’t very tall. He looked tired and they knew from letters that he had been</p><p>through many difficult things in his travels. He had been beaten and nearly stoned to death. He had gone up through Ephesus and Galatia and was on his way back to Jerusalem now, visiting all the little churches he had started. He was eager to see how everyone was doing. He wanted to teach them some more of God’s truths and answer their questions.</p><p>The Perga men stepped aside to let those from Jerusalem come forward. Zacarias was introduced and he greeted the guests. Stephanas and Amos and Jonathan and the others eagerly said hello.</p><p>Then it was Jacob’s turn.</p><p>But he couldn’t do it. The man seemed kind and gentle but….</p><p>“And this is Jacob….” said the pastor from the Perga church. “Hello, Jacob,” Paul started to greet him but Jacob suddenly pulled</p><p>back, a frown on his face. Angrily, he turned away. He just couldn’t talk to this man. The anger that surged through him was so great that he couldn’t even force himself to be polite.</p><p>There were murmurings from the Perga Christians. He heard some of their whispers. “Well!  And we thought he was such a nice boy…that he loved God and wanted to honor him…what an insult to our guest!”</p><p>The men from Perga looked horrified that Jacob would offend their guest in such a way. With hospitality and courtesy to visitors so important in their culture, he knew  that he was in disgrace.</p><p>But then he sensed Zacarias behind him. The man gently put his hands on</p><p>Jacob’s shoulders.</p><p>“Our Jacob is a godly young man. We appreciate his love for the Lord and all he’s done to serve God and our little group. He’s been very brave and loyal.”  Zacarias took a deep breath and continued quietly, “but we also understand his feelings right now. We know God has used our brother Paul in a mighty way to bring many to salvation but you see, back when he was known as Saul of Tarsus, he was the one who killed Jacob’s father.”</p><p>There was a gasp and everyone suddenly understood, even Paul, who looked very shocked and saddened.</p><p>“Even so,” somebody finally spoke up, “Paul is different now.”</p><p>Jacob saw that they felt he should forgive and forget. But how could he?  Nothing anyone could say would ever bring his father back.</p><h2 style=\"text-align: left;\"> Chapter 10</h2><p>How can I forgive when it hurts so badly?</p><p>That was the big question for Jacob. It seemed that he had pushed his father’s death back into the deepest part of his mind. What with the pressures of just trying to survive the last few months, he hadn’t had time to think about it. Now that things were somewhat back to normal all the sorrow and anger had suddenly come flooding back. And the arrival of Paul certainly hadn’t helped.</p><p>As Jacob slumped in a chair in their little rented house, he wondered if  the pain would ever go away. Paul had been to visit them, telling them all how sorry he was and asking their forgiveness for giving the order to have their father killed. Mama and Anna spoke to the man kindly, telling him that although they missed Father terribly, they knew he was with the Lord and the grief was slowly getting better. Of course, they forgave Paul.</p><p>But Jacob just sat, listening numbly. He was able to control himself while Paul was there but once the man left, his anger spurted out again, this time directed at Anna. As Mama went out into the courtyard to check on the vats of dye for the cloth, he turned on his sister.</p><p>“How can you forgive him?  Do you even remember what happened that day?”</p><p>“I remember,” she said quietly. “I still have nightmares about it.”</p><p>Jacob felt badly. Of course she remembered. She was only two years younger than him. Mama hadn’t seen it at all for she had been knocked unconscious by a soldier but the children had  seen the whole thing. Paul and the temple police had shown up, along with some Roman soldiers, who often came along in case they were needed, As usual, they had stormed into the homes of Christians, dragging them out to be taken to prison. That day their persecutor was especially vicious. Paul suddenly turned to Father who was being held tightly by two of the temple police.</p><p>“What about you!” Paul had sneered. “You call yourself a Jew! You’re a blasphemer, that’s what you are!  But turn from this Jesus right now and I’ll spare you.”</p><p>“No, never,” said Father, calmly.</p><p>Paul’s face turned red in his fury. “Kill him,” he told his men.</p><p>Jacob had closed his eyes then and a few minutes later, neighbors had swiftly whisked him and Anna out of sight. The last thing he’d seen was both his mother and father lying on the ground motionless. Then of course, a few months later, the temple police and Roman soldiers had stormed into the house where he and Anna were staying. They had taken them off to the same dungeon as their mother, hoping to use them to persuade her to recant.</p><p>Everyone knew, of course, that the Jews weren’t allowed to execute people. Paul could have gotten into big trouble that day. But the Roman soldiers standing there had let it all happen.</p><p>“I’m sorry,” Jacob said to Anna. He put his head in his hands and sighed. He just wished it would all go away — the anger, the grief, everything.</p><p>“I understand. I really do,” she said, “But Father wouldn’t want us to hate Paul. Besides he’s so different now.”</p><p>“I know. I’ll try.”</p><p>Everyone in the Perga church rallied around Jacob. He knew they loved him and understood. He was glad of that but he still couldn’t seem to stop being angry.</p><p>Sometimes it was easier to just pretend that everything was all right. Zacarias seemed to know it wasn’t though. And so did Paul, who often looked over at him so sadly that Jacob wished he could forgive.</p><p>Sometimes, as Jacob prayed about it and told God that he really wanted to forgive, he felt better and was able to look at Paul without being angry. Then something would trigger his thoughts about his father and it would start all over again.</p><p>“I know you’re struggling with this, Jacob,” said Zacarias one day.</p><p>“Sometimes it just takes time. What’s important is that you want to please God and He will help you.”</p><p>***</p><p>They all continued to meet together to hear Paul’s stories about his journey and ask questions about the Scriptures. One day, a commotion from the doorway interrupted them. Everyone whirled around to look. One of the young men from the Perga church dashed in.</p><p>“Paul’s in danger!” he gasped. “The Jewish leaders have stirred up a mob. They’re coming!”</p><p>“I’m so sorry,” said Paul. “You’ve had some peace and freedom here. Now I’ve ruined it by coming back!”</p><p>But the men rose quickly. “Don’t worry about us. Come quick! We’ll hide you!”</p><p>“The rest of us had better go, too,” said Zacarias, as the Perga Christians just sat around, looking rather stunned.</p><p>“They’re after Paul and Barnabas not us,” someone said. “These people are our friends and business acquaintances.”</p><p>But the Jerusalem Christians, who had seen this kind of thing before, hustled the group out and they all scattered.</p><p>Suddenly they heard the mob. How had the Jews gotten together such a violent, angry crowd?  The people carried sticks and stones and weapons and were rushing down the main street of town, searching alleyways and houses along the way. As they saw the Christians running, they shouted with glee and raced after them.</p><p>The believers cried out to God — and at the same time, ran as fast as they</p><p>could!  They ducked into hiding places and houses where unsaved friends, who not  understanding what was going on, quickly pulled them in.</p><p>Somehow, suddenly the street was empty of Christians. God had helped them all!</p><p>Jacob had gotten separated from his family. He headed down an alley. Coming out on a back street, he ducked behind a wagon. Suddenly he saw Paul running alone. He must have gotten separated, too. But at least he was safe. Or was he?  Jacob suddenly realized that the direction the man was going would bring him right out in plain view of the angry mob.</p><p>But did he really want to help him?  Maybe he should let Paul get a taste of what it was like to be persecuted.</p><p>Jacob suddenly felt sick. What is wrong with me? Who do I think I </p><p>am?  Do I think I’m God that I should punish him?  Do I really want that mob to kill him?  </p><p>He remembered the Old Testament Scriptures about revenge. Jacob knew that it was God’s job to avenge and punish. Besides, Paul was forgiven. Jesus had taken the punishment for all his sins, even the murders he had committed. Jacob remembered, too, that Paul already knew what it was like to be persecuted. He’d been yelled at or beaten or arrested in nearly every town he’d visited.</p><p>Suddenly Jacob heard voices. They were drifting from the direction he had just come. He saw the angry mob turn the corner into the alley.</p><p>Jacob sprang up and ran between some wagons and the wall of a warehouse. Perhaps he could reach Paul before the mob saw him.</p><p>“Sir,” he called, softly. “Brother Paul!”</p><p>But Paul was looking back and forth frantically, knowing he was cut off. He didn’t hear Jacob. The mob came closer as Jacob sprang out from behind the wagons and jerked Paul around the corner of the building. They clambered over a low wall and sank into a dusty lumberyard. The mob filled the alleyway and rushed by, looking here and there. As the two sprawled on the ground, pressing as close to the wall as they could get, Jacob saw the surprise on Paul’s face when he realized who his rescuer was.</p><p>Then he smiled. “So…I guess this means you’ve forgiven me…since you saved my life.”</p><p>Jacob grinned back. He suddenly realized that he did truly forgive the man. And it felt good to have love and forgiveness in his heart instead of hate and anger.</p><p>The last of the mob raced by and Jacob said, “come on, this way.”  They entered the warehouse and Jacob saw that it was filled with logs and half cut planks. It was apparently a ship building business for two small fishing boats, nearly finished, set on blocks.</p><p>Fortunately the building was deserted. The workers were all out watching the excitement. Jacob and Paul dodged around the obstacles. When they reached the opposite side of the long building, Jacob peeked out a front window, raising his head just above the sill.</p><p>“They’re gone.”</p><p>Paul clambered out the window after him and they hurried through the streets to the house of one of the pastors. There they met up with the rest of Paul’s group and some of the other Christians.</p><p>“Paul! Where have you been?  We were so worried!” “If it hadn’t been for Jacob, I would have been in the hands of that</p><p>angry mob!”</p><p>Everyone stared at Jacob in surprise. Then they smiled and clapped him on the back.</p><p>Paul and his companions felt it best to leave and not put the Christians in any more danger.</p><p>“They followed me from other towns and stirred up the Jewish leaders here,” Paul said. “They’ve been doing that all along the way.”</p><p>One of the Perga Christians said, “my friend, who’s a lawyer, thinks it will all die down. He says the Romans aren’t happy about uprisings like this and the Jewish leaders in town might get into trouble for this riot. As long as we mind our own business and continue to be law abiding citizens, he thinks we’ll be safe.”</p><p>The next day, as everyone gathered to see Paul off, he paused to say good bye to Mama and Jacob and Anna.</p><p>Jacob had been thinking and praying about something very important. He had a question for Paul. “May I join you on one of your journeys?  I’d like to travel with you. Zacarias says he will help me learn to teach the Scriptures so I’ll be ready. If the business is going well and my mother and Anna can handle it, that is.”</p><p>“I would like that, Jacob. I think you will be a great help in our missionary work.”</p><p>After they had left and the people were making their way back to their homes and jobs, Jacob caught Anna’s expression of longing and hope. He suddenly realized that she wanted to come, too!  Women traveled with Paul’s group, helping in many ways. Women had gone with the Master on His travels. So why not?</p><p>Their mother smiled at them. “You both will make good missionaries some day. Jesus told us to go into all the world and preach the gospel. Whatever God wants for you two, I’ll be all right. The business is going well and I’ll have enough to hire a helper in a few years when you’re ready to leave.”</p><p>They trooped back to town, glad that Mama was always willing for them to follow God’s path. There might be hardship and danger in the future but they knew God would see them through.</p><p style=\"text-align: center;\"><strong>The End</strong></p><p> Scripture taken from the New King James Version. Copyright  1982 by Thomas Nelson, Inc. Used by permission. All rights reserved.</p><h2> Definitions</h2>"}