{"title": "A Change of Coats", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Crab,Lobster,", "length": "01 - 05 mins,", "body": "<p>Two mischievous little gnomes were walking along the beach one day and as they came to a pile of rocks they heard voices. One of the little gnomes put his finger to his lips for silence and peeped cautiously around the largest stone. There he saw a crab and a lobster sitting upon a bunch of sea-weed in the sunshine.</p><img src='https://xcx.mdavid.cn/img/063.jpg'></img><p>The other little gnome tip-toed up and joined his brother and when they had listened a while they winked at each other and quietly walked back to the beach. After whispering together a moment one of the little gnomes ran up the beach and over a sand dune.</p><p>The other gnome again crept up behind the large stone and listened to the lobster and the crab.</p><p>“Yes,” said the crab, “I agree with you, Mr. Lobster! While our coats are just a plain green they are still quite beautiful!”</p><p>“Ah! You speak the truth, Friend Crab,” the lobster replied, “Green is a lovely color and I am very glad that we are not purple!”</p><p>“I am very glad that we are green, too.” the crab said, “Just suppose we were colored blue! I know I should not be able to stand it! Would you, Friend Lobster?’</p><p>“No indeed!” the lobster cried, “Nor would I care to change to any other color, would you, Friend Crab!” “It is nice to be satisfied! Isn’t it, Friend Lobster?”</p><p>“Yes! Especially when we are as satisfied as we are!” The lobster answered.</p><p>The little gnome listening behind the large stone winked at himself and smiled. He knew the lobster and the crab would give anything if they were of a different color, for he could tell by their conversation they were dissatisfied with their green coats.</p><p>Soon the other little gnome appeared over the sand dunes carrying a large kettle, and when he got to a spot on the beach where the crab and the lobster could see and hear him he began shouting in a sing-song manner: “Old clothes changed to new! Old clothes changed to new! Old clothes changed to new!”</p><img src='https://xcx.mdavid.cn/img/064.jpg'></img><p>“Pooh!” said the lobster. “Who is foolish enough to wish to change their natural coats?”</p><p>“Hmm!” said the crab as he sidled towards the beach. “Let’s go over and talk with him, anyway, and ask him if anyone ever changes the color of their clothes. Not that I wish to change my lovely green coat, you understand, but—”</p><p>“It would be interesting to hear about it, anyway!” the lobster replied, as he crawled after the crab.</p><p>The little gnome with the large kettle sat upon the beach and pretended he did not see the crab and lobster, but continued crying: “Old coats changed to new! Green ones changed to red! Old coat changed to new! Old coats changed to new!”</p><p>When the crab and the lobster came up quite near the little gnome pulled a number of pieces of colored cloth from his pocket and placed them upon the sand.</p><p>“How pretty!” said the crab.</p><p>“Very lovely!” said the lobster.</p><p>“Do you wish your coats changed in color?” asked the little gnome.</p><p>“Ah, no, thank you!” the two hypocrites said. “We were just looking around a bit!”</p><p>“Well, I am glad to have your company,” said the little gnome as he took a piece of scarlet cloth and laid it over the lobster’s back.</p><p>“How do you like that?” he asked of the crab.</p><p>“It looks fine!” said the crab. “Try it on me!”</p><p>The little gnome placed the scarlet piece of cloth over the crab’s back.</p><p>“How do you like it?” he asked the lobster.</p><p>“Did I look that well in that color?” asked the lobster by way of reply.</p><p>“I think both of you will look far better if you let me change you to scarlet. It’s in far better taste, too!” the little gnome added, pinching himself to keep from laughing.</p><p>“Shall we change?” the crab asked the lobster and the lobster asked the crab.</p><p>“You will find the color a great deal warmer,” said the little gnome. “Green is decidedly cold, you know!”</p><p>So the little gnome gathered an armful of drift-wood and built a fire. Then he dipped the kettle into the sea and placed the crab and the lobster in the kettle of water and put the lid on.</p><p>“Be sure and make us a brilliant scarlet!” cried the lobster and the crab, as the little gnome placed the kettle over the fire. An hour later the two little gnomes lay upon their backs upon the sand and yawned contentedly, their little round stomachs almost bursting their belts. Near them was the upturned kettle, and scattered all about them on the sand were lovely pieces of scarlet lobster and crab shells.</p><p>“It’s funny,” one little gnome said drowsily, “how one sometimes will become dissatisfied with the way he was made by Mother Nature and try to improve upon her work! It usually leads to misfortune.”</p><img src='https://xcx.mdavid.cn/img/065.jpg'></img><p>“Yes, that is true,” the other little gnome replied, “We should be satisfied and contented just as we are!”</p><p>“Well, I for one am satisfied!” the little gnome said, stroking his fat stomach.</p><p>“So am I!” his brother laughed.</p>"}