{"title": "The Christmas Visitor", "author": "Sharon Krager", "level": "6 to 8,9 to12,", "category": "Christmas,Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Christmas was fast approaching. Everyone was busy buying gifts, baking cookies and decorating for the holidays. Since I was only twelve, there was only so much that I could help with. Mom let me help bake some cookies and we did put up some decorations, but Dad did a lot of the outside ones.</p><p>We all loved this time of year. It had snowed right after Thanksgiving and we were expecting another snow tonight. The prediction was six or more inches. That would really put us all in the Christmas spirit.</p><p>My sister and I had a sled that we liked to play with when we got a nice big snow. There was a hill in back of our house near the woods that was perfect for sledding. We would stay out for hours until our feet and fingers grew numb. Most of the time that didn’t even stop us, we would finally go in when Mom or Dad said it was time to quit.</p><p>That evening we got all of the tree decorations out. We had gone to the attic to fetch our artificial tree and we were ready. We had ornaments that dated back years ago. Some of them were handed down from our Grandmothers and some of them were homemade. By the time the tree was finished with decorations and lights, you could hardly see the tree. The shiny star that we placed on the top was perfect. We were set. I could tell all of my friends that we had put up our Christmas tree.</p><p>After the decorating, we decided to pop some popcorn and settle in with a movie we had been waiting to watch. About one hour or so into the movie, we heard a faint knock on our back door. We were not expecting anyone, because the weather was getting bad and the snow had already begun to fall. There were several of inches of snow outside already.</p><p>Dad went to the back door, to find an elderly gentleman standing on the top step. I was right behind him.</p><p>“Hello,” said Dad. “Can I help you?</p><p>“Yes sir,” the gentleman replied. “Could you tell me where I could find the nearest motel? I am stranded right now. Just about a mile down the road, my car stalled and I cannot get it started.”</p><p>Dad asked him to step inside as the temperatures had dropped and the wind was blowing pretty fast. The snow coming down was now much harder and the accumulation of six or more inches would not take long.</p><p>The gentleman stepped inside on our back porch. He was dressed in clothes that were torn and wrinkled, and he looked like he had not eaten in several days.</p><p>“There is a motel at the edge of the next town,” Dad told him. “But that is about five miles from here. With all of this snow and cold weather you would not be able to get there on foot. Excuse me while I talk with my wife for a moment.”</p><p>Dad left the gentleman on the porch and we all followed him back into the living room where he and Mom discussed the situation.</p><p>“We don’t know this person,” Mom whispered to him. “I’m not sure what we should do.”</p><p>“I know that,” said Dad. “We cannot let him walk that far in this weather. I will get the jeep out of the garage and drive him there myself. Unless, you think it would be alright for him to stay in the room above the garage until morning.”</p><p>“Well I guess that would be alright,” Mom slowly said. “He could be a robber or something. I have never seen him around here before.”</p><p>“It is probably dusty up there in that spare room, no one has been up there for a while,” she added.</p><p>“He looks harmless enough,” Dad said. “I think it would be the kind thing for us to do for this fellow. I will take him to the garage and get him settled in that room for tonight. Tomorrow I will drive him into town to see about that motel. I will also see about getting his car into Smith’s Garage to see what is wrong with it.”</p><p>We all followed Dad back onto the porch. We said hello and introduced ourselves to him. Mom offered extra blankets and pillows if he needed them. She also sent a cup of hot chocolate and some cookies with him when they went to the garage.</p><p>He seemed very happy with both the room and the refreshments.</p><p>The next morning we got up fairly early to find about eight inches of snow had fallen and drifted over our driveway. Dad went out to shovel the snow so that he could get our visitor into town. It didn’t take him too long. When he went up to the room over the garage he took some breakfast with him. After about ten or so minutes, Dad and our visitor came down, got into the jeep and headed for town.</p><p>We didn’t hear from Dad for a long time. When he came back, he had the visitor with him. They stopped by to let us know that a tow truck was coming to pick up the stalled car and Dad was going back to town again to try and help get the car fixed.</p><p>While they were gone, we cleaned and planned on our shopping trip in the next couple of days. We called some relatives to invite them over for Christmas Eve. The plan was to have a little party, sing Christmas songs and see some of the people we had not seen in a long time. Christmas was a good time for families to get together. Since Christmas Eve was only six days away, we thought we had better get our plans in order.</p><p>Later that afternoon Dad came home again. He still had the visitor with him. He explained that the down on his luck visitor was worse off than we had thought. Dad said that he had no money, the car that broke down was falling apart, and he had no place to stay until he could get one of his friends to come and get him.</p><p>It wasn’t the news we had hoped for. Having someone in your house that you didn’t know was odd to say the least. The man was pleasant. He had manners, was polite and didn’t seem mean in any way.</p><p>Needless to say, he stayed in our garage room through the Christmas season. His friend that was coming to pick him up could not make it until after the New Year, and only if the weather was good. He had no other family to help him which was kind of sad.</p><p>We invited him to join in on our Christmas Eve party. He really seemed to enjoy that. When I was in the kitchen fetching more cookies, he told me that this was the best Christmas that he had ever had. He said that even when he was growing up the holidays were difficult, there was hardly any money. No gifts for him or his brothers and sisters. There was only fruit and candies if they could afford that. He reminded me of the wonderful family I had and how lucky we were to be together this happy season. I noticed his friendly blue eyes and wonderful smile.</p><p>“I am not sure about your guest,” Grandma told Mom. “He seems like a nice person, but can you trust him to live above your garage these next few days?”</p><p>“I have prayed about it,” Mom said with a smile. “I think we all feel like this was the right thing to do. We were able to help someone along their way here at this blessed time of year. I think he was led to this house.”</p><p>“I understand,” Grandma said with a smile and a twinkle in her eyes.</p><p>Mom and Dad made sure that our wayward visitor even had a gift. Dad had gotten him a real nice hat, scarf and gloves. I thought that was a very good thing for Dad to do.</p><p>He never made any of us or our guests feel uncomfortable. He just blended in with the rest of us, like part of the family. Mom found him some clothes of Dads so he could have some fresh clothes. He was very thankful for them.</p><p>During the time he was with us, I have several times to talk with him. He told me of his life, his jobs, travels, family and how he got to this point in his life.</p><p>Finally, the day came that one of his good friends came to pick him up. He packed up what few items he had, and thanked us for all that we had done for him. He said that he was blessed to have wandered up to our back door. His car was not good enough to be repaired, so he was leaving that with the mechanic’s shop for parts or to go to the junk yard. His old ragged clothes were thrown in our trash barrel. He was leaving us with big hugs and a friendly smile. The friend that came to pick him up also thanked us for being so kind.</p><p>Our visitor said that we would keep in touch. I asked if he would like our phone number. He said that he didn’t have a phone so there was no need to write that down. It took him awhile to say all of his good byes and to get out the door. It was as if he just didn’t want this time to end. Dad grabbed one of his nice winter coats and put it around his shoulders.</p><p>“Here,” said Dad. “You could use a nice warm winter coat. I haven’t worn this one in a couple of years now. There is no need for it to be hanging in my closet if I’m not going to wear it. I never really like that color on me anyway.”</p><p>We watched them get into his friends car and slowly leave the drive way. The visitor rolled down his window and said “thank you for everything” and they drove away.</p><p>We looked at each other, turned to go into the house. As we looked back one more time, the vehicle with our visitor and his friend had completely disappeared.  We just stood there looking in that direction for a long time. We all made comments about it, but none of us had a good answer. From our front steps you could see a long way down the road. There wasn’t anywhere for them to go. How could they have just vanished like that? That was very mysterious. We turned and went on into the house.</p><p>When   Mom and I went up to the room our visitor had stayed in to straighten up, we found this note lying on the bedside table:</p><p>“GOD BLESS YOU AND THANK YOU FOR WHAT YOU DID FOR ME THIS OLD COLD SNOWY CHRISTMAS SEASON. I WILL ALWAYS REMEMBER IT. MAY YOU BE RICHLY REWARDED FOR YOUR LOVING AND THOUGHTFUL KINDNESS.”</p><p>SIGNED, THE CHRISTMAS VISITOR</p>"}