{"title": "Circus Girl", "author": "Dianne Bates", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Chimp,Lion,", "length": "05 - 10 mins,", "body": "<p>My mum can fit inside a jar. SHEILA SPANGLE THE AMAZING CONTORTIONIST reads the sign on our caravan.</p><p>Papa’s Herman the Mighty Magician. And my older brother Anthony is a trapeze artist.</p><p>I’m Cassie, the Family Disappointment. Can’t fold my body into a tiny ball. Can’t produce coins from behind people’s ears. And unlike Anthony, I’m terrified of heights.</p><p>My only skill is I play the violin.</p><p>“Like an angel,” says Madam Zizinski, my music teacher.</p><p>“Like a squawking bird,” says Anthony.</p><p>“You’re a circus girl, Cassie,” Mama says. “Circus girls don’t play the violin.”</p><p>“You’ve a rare gift,” says Madam Zizinkski.</p><p>I believe her. Between acts, she tells fortunes with her crystal ball.</p><p>After Tuesday night’s show I’m practising my music when the circus owner stands outside our van talking to Papa.</p><p>Usually Mr Sharman speaks with a cheerful voice. Tonight he sounds serious.  “Profits are down,’ he says. ‘I’m going to have to let some of our people go.’</p><p>I wonder if Mr Sharman is going to sack our whole family. Then where would we go? The circus is our life.</p><p>Next day I find Madam in her van packing a suitcase.</p><p>“Where are you going?” I ask.</p><p>Madam reaches out and draws me to her.  “Oh little one,” she says in her heavy accent. “I will miss you so much. Mr Sharman has given me my marching orders.”</p><p>“You’re marching? Are you in a new act?”</p><p>Madam smiles. “No, ma petite. I am leaving the circus.”</p><p>It’s too much! I burst into tears.</p><p>Madam croons soft and low in my ear as she rocks me.</p><p>“I want to go with you,” I blubber.</p><p>“I’m going to visit my family in Europe,” Madam says. “It is a good thing.”</p><p>“Not for me.”</p><p>Madam sighs. “You will be sad for a while. But, dearest Cassie, it will not last.”</p><p>“Yes it will. You’re my best friend.”</p><p>Madam Zizinski slips me off her lap. “Look, little one. Look into the ball.”</p><p>When Madam peers into her crystal ball, she can see into the future.</p><p>“Ah!” she says. “Here you are. I see many happy people around you.”</p><p>I peer into the ball.  “Where am I?”</p><p>“In a good place,” says Madam. “The angel has played her music. And soothed the savage beast.”</p><p>Next day I want to be happy. But I feel lost when Madam leaves.</p><p>Mama gives me Calipso, our youngest chimp. “Look after her; like you would a baby.”</p><p>Mr Sharman sold Calipso’s mother to a zoo. I hug my new pet and mutter angry words about Mr Sharman.</p><p>Calipso pokes her fingers into my mouth. And up her nose. Even though he makes me laugh, I’m still sad. I’m even sadder when Mr Sharman sacks Shortie, the lion tamer.</p><p>“Herman,” the boss tells Papa, “I want Cassie and Calipso to be part of your new act.”</p><p>Papa has to teach Calipso tricks. I have to play the violin.</p><p>I’m scared. I don’t want to perform.  My music isn’t good enough.</p><p>That night, all night, our circus elephant Ellie trumpets. Nobody can sleep.          “Shut that jumbo up,” Mr Sharman tells Papa.</p><p>Papa talks softly to Ellie. But still she trumpets.</p><p>“Go play her some music, Cassie,” says Mama.</p><p>I grumble as it’s cold outdoors, but do as I’m told. I play a polka and then a waltz. Soon Ellie has calmed.</p><p>“Look,” says Papa, “She’s dancing!”</p><p>It’s true. Ellie’s swaying in time with my music.</p><p>For the first time ever I don’t feel like the Family Disappointment.</p><p>Mama fits Papa and me with colourful clown outfits. I have a red, plastic nose and a purple wig.</p><p>Calipso claps his hands and somersaults when he sees me. He curls back his lips and bobs his head up and down.</p><p>“Don’t laugh at me, you naughty boy!” I say.</p><p>I’m so scared about performing. Mama hugs me. “Do your best,” she whispers.</p><p>In the Big Top the show goes on. Mama squashes herself in her jar. Then Anthony, so strong and handsome, flies on the trapeze.</p><p>I’m on next.</p><p>“Presenting Cassie, Calipso and Charlie, the Incredible Clowns!” announces Mr Sharman.</p><p>The three of us hurtle into the ring. Papa and Calipso tumble while I play a cheerful tune. Then they chase one another while I play as fast as I can.</p><p>When I stop, Papa bellows, “What’s this?” He pulls a bunch of flowers out of a boy’s ear.</p><p>It’s a trick, of course. But the kid is amazed.</p><p>Calipso grabs Papa’s flowers and races off. Papa chases him. I play again. My music is sweet and the people are swaying in time with it.</p><p>People love Calipso’s antics. And Papa’s magic. If only Madam Zizinski was here to hear me play. She’d enjoy our act so much!</p><p>While we entertain, workers build a cage in the ring for the big cats.</p><p>When it’s finished, Papa, Calipso and I bow and leave.</p><p>“You were wonderful, Cassie,” says Mama, waiting in the wings.</p><p>Papa and I stay to watch the big cats. All day they’ve been roaring, pacing up and down.</p><p>“They miss Shorty,” says Papa. “I don’t like the look of them.”</p><p>Down the chute the four of them go. Snarling and showing their razor- sharp teeth.</p><p>Sheila the tigress looks extra mean. She snaps at Mr Sharman. He bellows at her. Flicks his whip on her rump.</p><p>Now the lions are perched on their stands. When Mr Sharman tries to get Big Boy to jump through a hoop, he refuses.</p><p>“He’d do it easy for Shorty,” I whisper.</p><p>The audience starts a slow hand clap. Mr Sharman yells at Big Boy and whips him, hard.</p><p>In a flash Sheila leaps from her stand. She crashes into Mr Sharman and knocks him down.</p><p>“Oh no!” the audience cries.</p><p>Papa charges into the cage.</p><p>“Don’t go, Papa!” I scream.</p><p>Now Anthony is going in, too!</p><p>Papa grabs Mr Sharman’s whip and flicks it at Sheila and Big Boy. Mr Sharman is lying still on the ground. People are screaming. Calipso has his hands over his eyes and is whimpering.</p><p>Sheila bares her teeth. Marcelle paces back and forth, roaring.  So do Big Boy and Roman. They’ve never been so angry. So fierce. So scary.</p><p>I wish there was something I could do.</p><p>Then I remember: “You will sooth the savage beast,” Madam Zizinski said.</p><p>I tuck my violin under my chin, raise my bow, and play the sweetest music I know.</p><p>Anthony pulls Mr Sharman to the cage door.</p><p>Papa is trying to herd the cats into the chute but they won’t go. They don’t seem to hear my music. For sure Sheila is going to leap onto Papa. Tear him to pieces.</p><p>Not one of the cats is doing what Papa tells them. Shorty would have sorted them out in a flash. But Papa has never worked the cats before. They’re fierce and so, so mean.</p><p>I close my eyes and focus on my music. But the cats don’t seem to hear it.</p><p>All alone, Papa is struggling for control. The cats bellow at him, refusing to do as he says.</p><p>Now, remembering how my music calmed Ellie, I start up a waltz. Da Da Da, Da Du Da Da!</p><p>Now Sheila comes to the side of the cage, roaring. I would like to yell at her to behave herself. But I need to concentrate on my tune.</p><p>One of Sheila’s ears is raised. She looks straight at me. She hears my music!  Marcelle, Big Boy and Roman are quiet now, too. The people are hushed. Papa’s whiplash sizzles in the air.</p><p>I keep playing my waltz. Da Da Da, Da Du Da Da!  The audience begins clapping in time. The spotlight swings onto me.</p><p>Sheila’s tail slaps against the cage bars. It’s as though she’s clapping, too. When she growls, it’s a good growl, a way of saying something nice. I smile at her.</p><p>Marcelle now plods towards the chute. Big Boy follows her. And Roman, too. Before they pass the door, each of them turns and growls, as though saying “Thank you, Cassie.’</p><p>I want to cry and to thank them for being good.</p><p>Now only Sheila is left in the ring.</p><p>“Come on, girl!” Papa shouts.</p><p>As meekly as a kitten, Sheila pads over to the chute, turns, and growls kindly at me.</p><p>When her tail disappears, I stop playing and stretch my aching fingers. I’ve never played so long before. Nor as good.</p><p>Papa closes the chute door, smiles at me and bows to the audience. People start clapping and foot-stamping and calling, “Circus girl! Circus girl!”</p><p>They’re cheering me! Me, Cassie Spangle.</p><p>Papa grins. Mama sweeps me into her arms and hugs me. “Well done, Cassie, well done!”</p><p>“I’m proud of you,” Anthony says.</p><p>Calipso claps.</p><p>“Bow,” whispers Papa.</p><p>I bow.</p><p>Madam Zizinski would be so proud.</p>"}