{"title": "Courtney and the 42 Ears of Corn", "author": "Savannah Hendricks", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Cow,", "length": "01 - 05 mins,", "body": "<p>One morning, Courtney, a white cow with the smallest of black spots, wandered off. She was not supposed to leave the pasture. But that day she headed straight into the corn fields. Courtney’s family watched her disappear through the tall stalks.</p><p>“Why did Courtney go in there? She knows better,” the brother calf mooed.</p><p>“What is she thinking?” mooed the Daddy cow, slowly shaking his head.</p><p>“Maybe she is looking for adventure,” the older sister cow mooed with a grin.</p><p>It was certain that no one in the family knew why Courtney had wandered off. The family watched the top of the stalks wiggle as Courtney weaved her way through them. No one wanted to go after her. They knew the rules of the farm. Going into the corn fields was defiantly not okay.</p><p>“I’m hungry,” Courtney mooed, looking at the corn stalks.</p><p>She wandered here and there and there and here. Slowly Courtney was becoming lost in the corn field. The smell of the corn, hidden by rough green husks, was making her even hungrier. Courtney’s stomach started making noise. Then the rumble grew louder. Courtney couldn’t stand it anymore. She had to eat.</p><p>“Maybe just one piece of corn,” she mooed.</p><p>Courtney took her front hooves, pounced on the stalk of corn, and pulled an ear off. After she finished the first ear of corn she craved more.</p><p>“One more wouldn’t be so bad,” Courtney mooed.</p><p>Courtney munched on another ear of corn. With only two ears of corn in Courtney’s stomach she wanted more.</p><p>“A couple more ears of corn won’t hurt,” she mooed.</p><p>Finally Courtney started to feel full, but now she had eaten forty-two ears of corn!</p><p>“How could I have eaten all that corn?” she mooed, looking at her new larger stomach. “Maybe I should lay down for a quick nap.” Courtney laid down between the stalks of corn.</p><p>While she slept the sun grew very hot. Eventually the sun became so hot that it woke Courtney up.</p><p>“I am too full to get up,” she mooed. “And my stomach feels funny.”</p><p>Courtney waited a bit, and then used all of her strength to stand up. That is when she heard a POP. Then a POP, POP.</p><p>“What is that popping sound?” Courtney mooed.</p><p>POP, POP, POP.</p><p>Over the popping Courtney heard her name.</p><p>“Courtney, come home,” her family mooed from the pasture.</p><p>POP, POP. POP, POP.</p><p>Courtney slowly began to find her way out of the corn field. She weaved back and forth around the corn. She was scared about the popping sound coming from her stomach. Courtney made it out of the corn field and over to her family in the pasture. They all gathered around.</p><p>POP. POP, POP. POP.</p><p>“I’m popping. Do you hear that?” Courtney asked her sister.</p><p>POP, POP, POP, POP.</p><p>“Yes,” she mooed with a giggle.</p><p>“What have you done?” mooed brother cow.</p><p>POP POP. POP POP, POP POP.</p><p>“I ate the corn from the stalks,” Courtney mooed.</p><p>All of the cows hung their heads in shame of Courtney’s actions. Courtney knew that she never should have wandered off.</p><p>POP. POP. POP, POP. POP.</p><p>“The corn must be popping into popcorn because of the heat,” Daddy cow mooed.</p><p>Courtney’s stomach went POP, POP, POP, the rest of the afternoon.</p><p>In the evening the sun set and it grew dark and cool.</p><p>“I think the popping has stopped,” Courtney mooed.</p><p>Late that night, when the stars started to twinkle, Courtney’s stomach started to feel better and she began to fall asleep.</p><p>“That is the last time I ever wander off where I shouldn’t,” Courtney mooed quietly, just before she started to snore.</p>"}