{"title": "The Cover", "author": "Michael Kozubek", "level": "9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Laughing loudly, the four boys, ranging in age from 10 to 16 in an assortment of heights, stood menacingly inside the small drug store. Their roar interrupted the graveyard silence of the frigid January night. Outside the store a neon light beamed Giuseppe’s through the darkness.</p><p>The shop owner Giuseppe, a frail, gray-haired man, knelt picking up and rearranging paperback books on a rack one of the boys had just toppled. As he did so, the man looked over his shoulder and cried: “Get out of my shop, you juveniles. Get out and don’t ever a come back.”</p><p>The leader of the group, Frank, was a tall, beefy teenager wearing a leather jacket and dirty jeans. He carried a cigarette between his fingers, and it was apparent by the scars on his rough face that he had been in a number of street fights. The other boys had tough-looking faces, too, and tattered clothes.</p><p>Rising painfully, Giuseppe shook his fist at the boys and thundered again: “Get out a now, you scum.”</p><p>All of the boys except Frank dashed out the door. As he sauntered slowly in defiance of the old man, the shop owner rushed toward him like a wounded bear. Giuseppe grabbed a broom, standing against the ice cream freezer, and swung it hard at the rowdy. It swept only air as the youth lunged back. Frank, quickly removing an egg from his jacket pocket, heaved it at Giuseppe, who was hit in the stomach by the splattering missile.</p><p>Surprised, the proprietor stopped momentarily, then roared: “Why, you a insolent brat!” Missing Frank again in a final swing, he slammed the door and sat down in exhaustion.</p><p>Placing his hands into his pockets as he strolled into the frozen night air to join his shivering gang, Frank laughed and said: “I knew that egg would find a good use.  Boy, wasn’t that guy mad after I toppled his rack! You guys will have plenty of laughs sticking with me.”</p><p>One of the boys, George, a thin fellow with a pale face, replied, “Sure, it was funny then, Frank. Now, I’m not so sure.”</p><p>“What? Don’t tell me you pity the old slob,” said Frank sharply. “No, of course not, it’s just…” answered the younger boy.</p><p>The gang remained talking across the street from the store. Several minutes later two policeman in a squad car, answering Giuseppe’s call, stopped on the street. They warned the boys about trespassing and ordered them to go home.</p><p style=\"text-align: center;\">______________________</p><p>One week later at night, a beige Ford rumbled down a dark country road, covered with snow and ice. Giuseppe was returning from a visit to his daughter. The ten mile drive had been slow and tedious because of the ice and the fallen white flakes, but the old man was just minutes from home now. As he made a slow turn on the narrow road, however, the back wheels of his car began to spin in a deep rut in the ice hidden beneath the snow. Giuseppe climbed slowly out of the car and moved toward the rear to take a closer look. After a few steps he slid on a slick patch of ice and tumbled hard to the cold ground. Groaning, he lay there in pain. It felt as if an ankle had been broken.</p><p>For twenty minutes he lay there, though it seemed nearly forever, shivering and unable even to sit up. Finally the lights of a car appeared in the dark. It crept down the narrow highway toward him. Giuseppe wept for joy.</p><p>An old red Chevrolet stopped before him. The first person to exit was the driver Frank, hatless, followed by his three friends. Because of the slippery condition of the snow and ice, they walked cautiously toward the injured man.</p><p>“Please help me,” beseeched Giuseppe in a weak voice. “I think my ankle’s broken.</p><p>“Don’t worry, old man, we will,” replied George, assuring the man.</p><p>“Why should I help him?” shouted Frank in angry. “Because of him, the cops will be watching us forever now.”</p><p>“Have you no heart?” asked George sharply.</p><p>“No. C’mon. I’m freezing. Let’s go,” said Frank scornfully.</p><p>Frank’s words had been so unexpected that the three remaining youths remained in the road speechless. Not hearing any response from his friends, Frank shouted, “Suit yourselves. I’m leaving. So long, chumps.”</p><p>The three boys watched the tail lights of the Chevy as it crept away. But they soon remembered the suffering man needed their attention.</p><p>The boys tried to make Giuseppe as comfortable as possible. One of the boys took off his jacket and wrapped it around him. They offered him the only food they had, a Snickers bar, and some water, and tried to reassure him that he would be all right though their own hearts were pounding. One boy pulled out his smartphone but out in the wilderness, he couldn’t connect even for an emergency call. They looked out into the cold dark and were not sure what to do.</p><p>Then George said, “Giuseppe needs a doctor, but I think the nearest phone is a few miles from here. Someone should start walking to get an ambulance.”</p><p>Two boys immediately started the trek. The harsh wind whistled past them and bit their cheeks as they trudged silently along the road a mile scared and anxious. For the first time, they thought of their leader, leaving an old man to die in the cold, as cruel and pathetic, his soul as harsh as the cover of the person he revealed to others. They worried about getting help in time. They worried about frost bite and becoming lost themselves.</p><p>When they spotted flashing red lights in the distance approaching, however, they stopped. As the lights finally crept nearer, they were able to see two vehicles: an ambulance, followed by an old, red Chevrolet. There were never any happier nor more thankful boys.</p>"}