{"title": "Cuddlemuddle in the Monsters’ School", "author": "Andrea Tillmanns", "level": "3 to 5,6 to 8,", "category": "Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Once upon a time, there was a little monster called Cuddlemuddle, who liked nothing more than lying on the grass in the garden in front of his parents’ house and looking into the sky.</p><p>When he grew up, Cuddlemuddle, like all little monsters, had to go to school and learn everything a big monster had to know. He learned the 3 Rs – reading, writing, and arithmetic; also monster studies and monster history. He got to know all about the most important monsters of the last millennia and about the most brilliant inventions of the monsters’ world.</p><p>And being a member of the large family of chaos-monsters, he had to learn particularly how to cause perfect chaos. For this purpose, he was happy to get a practical training course from his great-uncle Twiddeltwaddel who was a very well-known and reputable chaos-monster.</p><p>When Twiddeltwaddel took along Cuddlemuddle for the first time in order to cause perfect chaos in a child’s room just around the corner, Cuddlemuddle was very excited. Now he would cause his own chaos for the first time! He could hardly wait to get there.</p><p>Both monsters made themselves invisible, in case any human beings were around – for chaos-monsters were not allowed to be seen by humans, Cuddlemuddle had learned this in school. Then they sneaked in to the empty child’s room – surely all children were outside at the swimming pool in this wonderful weather, Cuddlemuddle thought, or they were outside, lying on the grass and looking into the sky …</p><p>“Now, get started”, Twiddeltwaddel interrupted the little monster’s thoughts.</p><p>Cuddlemuddle nodded and looked around. Actually, he thought, his task was quite easy – he only had to pick up all the toys and other things lying around and tuck them away anywhere else to cause perfect chaos. At first, he took the football out of the corner and dropped it on the sports bag, and then he pulled out the puzzle from under the bed and put it in the shelves. He picked up the book from the bed and laid it on the bedside table, put the shoes into the cupboard, arranged the pencils and the school book on the desktop, and so he worked on with ardent zeal and vigour until finally each single thing had found its new place. He looked around and nodded contentedly. Yes, this really was what he called a mess!</p><p>But looking up to his great-uncle, the little monster became worried. Twiddeltwaddel had turned pale and shook his head with disbelief. “No, really”, the well-known and reputable chaos-monster murmured, “but you tidied up the room completely … you really have a lot to learn.” He sighed in deep dismay. “Something like this in my own family … No, no, no …” Twiddeltwaddel was still shaking his head and sighing when they both returned home.</p><p>Cuddlemuddle decided to cause a much better chaos the next time, but it didn’t work – each time he set off with his great-uncle, the big monster shook his head afterwards and murmured: “No, no, no … you really do have a lot to learn.”</p><p>And so by the end of the school year, Cuddlemuddle got a lot of “Monsterly marvellous!” on his certificate, but in the subject “Arranging chaos”, there was only a “Middle-monsterly”.</p><p>But this didn’t upset his parents at all. “Surely you inherited this from your Grandma”, Cuddlemuddle’s mother considered, “she had worked in a large park and chased away the people who wanted to steal flowers or who broke twigs off trees.”</p><p>This, Cuddlemuddle thought, sounded like a great idea. And later-on, when he grew older, he really did find a nice park just around the corner in which he could look after the flowers, chase dogs away from the flower-beds and watch the children playing. And in between, when it was calm and nobody disturbed him, Cuddlemuddle lay on the grass, looked into the sky and enjoyed his monster-life.</p>"}