{"title": "Dad’s Stupid New Job", "author": "A. Joseph Black", "level": "6 to 8,9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,10 - 15 mins,", "body": "<p>Have you ever moved house? I have, and this is the story of it. Oh, BTW, my name is Martin Kelly, just so’s you know, and I’m nine years old.</p><p>Of course, being nine, what I think doesn’t count for much when these things are decided. Mum and Dad held family meetings, sure, but they were to tell me what was happening, not to ask me what I wanted. Mum and Dad and Nuala (my big sister) had already decided what was happening. The family meetings were just to keep me quiet. Nuala is only five years older than me, but it seems fourteen is the age that you’re allowed to help your parents with “major life decisions” (Dad’s words, not mine).</p><p>So why are we moving, I hear you ask? (Don’t worry if you didn’t: I’m going to tell you anyway.) Well, it’s Dad’s job, that’s why. Dad’s stupid new job.</p><p>“Great news Martin!” Mum told me, as casual as asking the time, one day when I arrived home from school. “Dad’s got a big promotion.”</p><p>Whoop-de-doo. I don’t even really know what a promotion is. I think it means you start being the boss of the people that you work with, and I can’t really see why that’s such a big deal. I looked pleased because I thought I should, but Mum wasn’t finished yet.</p><p>“It means we have to move to the city, Martin. Dad’s new office is right in the city centre, beside the City Hall – remember where we went to see the Christmas lights being turned on?”</p><p>I did remember, but suddenly that didn’t seem important. Almost without noticing, Mum had just turned my life upside down.</p><p>“What?” I spluttered.</p><p>“Beside the City Hall, remember?”</p><p>“Did you say we’re moving house?”</p><p>“Yes, dear, we have to. In fact, Dad and I have picked out our new house already. Martin? Martin?!” Mum shouted after me as I felt my eyes sting and my bottom lip wobble and I bolted out of the kitchen like a scalded cat (as Gran used to say).</p><p>When he came home from work that night Dad found me – like he knew he would – standing under the holly tree in the back garden. I don’t even know why I like that spot so much, but I do, it’s my favourite, and Dad knew that. It’s where I go when Mum and Dad, or Nuala, or someone in school, is unfair to me (usually Nuala).  When I was very wee, my holly was a jungle, then it was a castle, then a pirates’ ship, and now it’s the flight deck of my atomic intergalactic space cruiser. That holly tree is my hidey hole, when I just want to get away from it all. From them all. And now I had to leave it behind. My holly.</p><p>“Are you all right, son?” Dad asked, after standing beside me in silence for a minute. He obviously hadn’t spent the minute thinking what to say next.</p><p>“No, Dad, I’m not,” I replied, still fighting back tears. “I’m not all right at all.”</p><p>“It’s the move, isn’t it?”</p><p>“Of course it’s the move Dad! You didn’t tell me anything, ask me anything. Then all of a sudden we’re moving to Belfast. I have to leave my school, all my friends, everything. It’s not fair.”</p><p>“Ah, Martin. You know what’s happening in the world son, right?”</p><p>“Global economic meltdown,” I said wearily. “I know, Dad.”</p><p>Dad smiled to hear me use those words, but they’d been everywhere recently – the telly, newspapers, teachers in school wanting to talk about it, teachers in school actually striking over it one day (I supported the strike, I decided, as I lay on the sofa all day in my pyjamas eating crisps and playing video games).</p><p>“Well, son, lots of families’ Dads and Mums are losing their jobs, but I’ve managed to get a better one. That’s a good thing, right? But it just so happens that this better job is in the city.”</p><p>“Can’t you do the job without us moving, Dad? Travel up and down every day?”</p><p>“That wouldn’t work, Martin.”</p><p>“Dad -” I placed my hand on his arm in the way I saw him do with Mum when they were talking about something they didn’t want me to hear (like moving house). I hoped it made me look grown up and serious. “Dad, don’t do it. You don’t need a better job. What’s wrong with the old one? Can’t everything just stay the same as it is now?”</p><p>Dad smiled at me, but his eyes were kind of sad.</p><p>“Has Mum told you about the new house yet?” he asked.</p><p>“Just that you’ve already picked it.”</p><p>“It’s amazing, Martin. You’ll love it. Your room is twice the size of the one you have here. We’re going to fit out one room as a den – you can have your games consoles, music, all of your stuff in there – and there’s a massive park just five minutes down the road where you can skateboard or bring your bike. And that’s before you even think about all the museums and galleries and playgrounds and cinemas and big shops that you have in the city. You’ll love it Martin. I promise.”</p><p>He sounded like he was trying to persuade himself rather than me.</p><p>“What about school?” I asked, although if I was entirely honest school was rarely, if ever, a major consideration for me. “I won’t know anyone in the class, or the teacher, or the books. What if they use different books, Dad?”</p><p>“They don’t, son. All the schools use the same books. You won’t see any difference.”</p><p>“But I won’t know anybody, Dad. And I’ll never see Niall, or Declan, or Cathal EVER AGAIN.”</p><p>“Yo will of course, Martin. We’ll be back here all the time visiting your Nanny and Granddad. You’ll see the gang loads. Nearly as much as you do now. Tell you what, when we get settled in at the new house we can bring Declan and Cathal and all the rest up for a sleepover. You could use the den. Play video games and eat pizza. What do you think?”</p><p>“I think I want to stay here,” I said and walked back into the house.</p><p style=\"text-align: center;\"> #</p><p> The next few weeks were a bit of a blur. Gradually, everything in our house disappeared, replaced by big tower blocks of boxes, marked with odd labels such as “Good Room –  BREAKABLE!!!” and “Kitchen – not needed immediately”. I have to admit that playing with the miles of bubble wrap and the empty boxes was fun, and Mum and Dad definitely let me away with stuff that usually I’d have got into big trouble for. Breaking “Nanny’s Vase” while I was playing Godzilla, for example: smashing the Belleek Vase that Nanny had bought Mum and Dad for a wedding present , would – usually – have been the kind of thing that got me grounded for a week minimum, with no Nintendo and no computer. And no pocket money, either. But when I told Mum, “Nanny’s vase is broken” (it’s important when you tell parents stuff like this not to say “I broke the vase” – they usually work that out for themselves pretty quickly – just say “it’s broken” or “it broke”), she just smiled tiredly and said, “Don’t worry, love. Accidents happen. I shouldn’t have left it out unwrapped like that.” This made me very suspicious and I wondered if perhaps this news “hadn’t sunk in yet”, as I always hear people on TV saying.</p><p>So the weeks leading up to the move weren’t as bad as I thought. School was weird – everyone kept saying to me, “When do you go?” and “Are you not afraid?” and even (I was thrilled to hear) “You’re so lucky, Kelly. I wish I lived in the city”.</p><p>Declan, Cathal, Niall and I made sure we got the most out of those last few weeks. We went swimming at the lakes, played in the old quarry in the hills behind our house (which I was banned from doing, but I figured at that stage that all bets were off, as Dad would say, although I was never too sure what it meant) and spent hours and hours in each others’ bedrooms, often just talking about nothing, and what life would be like for us all after the move.</p><p>Finally, the big day arrived. Mum asked me if I was excited, and in truth I was, but I couldn’t tell her that. It was impossible not to be excited: the boxes, the big vans with the removal men who drank SOOOOOOOO much tea, the neighbours bidding tearful farewells, the promises to keep in touch – it was all so different and odd. It was sad, but it was exciting. I just couldn’t admit it.</p><p>By 4 o’clock, all the furniture and boxes had been loaded onto the vans. The only things left in the house was me, Nuala, Mum and Dad, and a single letter that had arrived for the people who were moving in (I thought it was very cheeky of them to have a letter for them sent to our house when we were still living there). As Mum and Dad fussed over the last few bits and pieces that were going in the car with us, I sneaked out the back door and headed for the bottom of the garden, to my holly. I just wanted to stand there one last time, and remember the days when I was an intrepid jungle explorer, a heartless pirate or an intergalactic space captain. I could feel my eyes starting to sting again and from the house I heard Dad shouting “Where’s Martin? We’re ready to go here.” Mum replied, “Give him a minute love. He’ll be ready in a minute.” I walked backwards toward the house, to keep my holly in view the whole time. When I got back to the kitchen, Dad said, “Martin, where – “, but then he saw my red eyes and stopped.</p><p>It took over an hour to drive to the new house and Nuala annoyed me every second of every minute of that time.</p><p>“I don’t know why you’re always crying about moving, Martin.” she said.</p><p>“I’m not always crying,” I told her. “I’m just going to miss everyone and everything from the old house.”</p><p>“Everything from the old house is already in the new house, Martin,” Mum said. “All of your things will be in boxes in your new room and the den. As soon as we get there, I’ll help you unpack. We’ll get your Star Wars and Spiderman stuff up and it’ll look just like your old room, you’ll see. Only bigger.”</p><p style=\"text-align: center;\"> #</p><p> “Martin? Martin?!” Mum shouted from the back door of the new house. “Where is that boy?”</p><p>I heard her, and since it was the third time she’d called me, I went.</p><p>“Here, Mum” I said as I entered the strange new kitchen.</p><p>“Oooh,” Mum replied, in the embarrassing voice she sometimes used for no reason. “And who’s this with you? Hello, love.”</p><p>“She lives next door, Mum. She’s nine, and she’s in my class at the new school. The teacher told them about me coming and when her Mum saw the vans, she sent her in here to meet me. She likes Star Wars, Mum, and Nintendo, and she’s got a wicked bike, you should see it!” I couldn’t keep the smile off my face.</p><p>“And does this pretty young lady have a name, Martin?”</p><p>“Oh,” I said, embarrassed at realising I hadn’t even asked her. “Sorry, what’s your name?”</p><p>“Holly” she replied, and smiled the most brilliant smile I’d ever seen.</p><p style=\"text-align: center;\"> END.</p>"}