{"title": "Daisy’s Dilemma", "author": "Kevin Bannigan Jr.", "level": "6 to 8,9 to12,Teen,", "category": "Modern,Original,", "tag": "Mosquito,", "length": "Over 20 mins,", "body": "<p>It’s amazing how quickly life can become uncertain. There I was, out for a drink; here I am, scrambling for my life. The way I came in is blocked. I’m trapped now. All I want to do is get back home, back to the creek I was born, back to my family.</p><p>How is it that I got into this situation in the first place? Let me explain.</p><p>Two days ago I was lucky enough to find a nectar plant that had yet to be claimed by our rivals, a.k.a. those yellow and black bullies. I shared my find with my brother, mother, and father, and we all filled our tummies, then just relaxed and admired the bright white moon that resided in the sky.</p><p>“You did wonderful Daisy,” my mother said, which made me feel amazing.</p><p>You probably don’t believe me, but if we could get by on nectar all the time, we’d have no need to suck the flesh of humans or animals. But of course Dad—especially Dad, who’s five months old now—and Greg need the nectar more than Mom and myself, so us females often find more plentiful sources of nutrition.</p><p>All in all, my kind has such a bad rep. Sure, there are a few bad seeds among us, but that’s no different than any other species. Thanks to the internet our secret, how we are the deadliest species on earth, is now a well-known fact. But many of us are different, and I proudly include myself in this category. I come from a good, healthy family. Our genes are among the best of our species, and we age not only very well, but very slowly compared to others mosquitoes. My mom has been sucking for four months now and has yet to infect anyone with malaria or yellow fever or any of those other horrible diseases my species is known for. Besides, with how rare those cases are, it’s nothing compared to the risk we must take just to enjoy a simple meal. What happens to my kind is far harsher than what we do to others. One good swat and it’s bye-bye skeety. When we are fortunate and the swat falls on empty air, most of us are gone from with this world in a month or so. I understand that we can be quite annoying, but we are only that way because that’s the way God made us.</p><p>One time, my dear friend Angela made the mistake of sucking a fat boy’s blood right above the knee. I was circling the boy and looking for a nice settle down for lunch when his chubby hand smashed Angela to mush right in front of me. Angela, so intoxicated by the boy’s protein and iron that she was dead before she knew what hit her. I feel bad for Mr. and Mrs. Swanson, who died without the pleasure of having grand squitoes.</p><p>The taste of human blood is like the greatest drug in the world. Comparing it to animal’s blood is like comparing French fries to oysters. But nothing is worth your life, even the finest blood humanity can offer.</p><p>Dad’s always told me to learn a lesson from every situation. As unfortunate as Angela’s death was, it proved my parents right.</p><p>“Always go for an obscure spot honey,” my dad told me before my first outing.</p><p>“Like what?” I asked.</p><p>My mother chimed in, saying, “The middle of the back is the best place. Humans naturally can’t reach there. My favorite part is right behind the knee. The blood tastes so sweet when you drink it, much sweeter than somewhere like the back of the hand.”</p><p>“Why is that?” I asked.</p><p>My father, the consummate teacher, answered my question with: “Why were you born a mosquito?”</p><p>My third time ever out feeding was an early summer morning with a girl named Julia who was born the same week as me. I didn’t like her much at all. This was not because she carried Dengue, as that wasn’t her fault, but because she was proud of it. Julia told me her reasons, though I didn’t agree with her at all.</p><p>“My great grandmother saw her entire family killed by a woman who was so scared of a few harmless insects that she sprayed them with Raid! Even the boys, who were just out with their family having a good time!”</p><p>“But of course a human can’t tell the difference between a male and a female,” I pointed out.</p><p>Julia buzzed around and asked me, “Whose side are you on here Daisy?”</p><p>“I’m just saying that going through life holding a grudge is no way to live.”</p><p>“Easy for you to say. You’re father has been alive since my great-great grandfather’s time.”</p><p>“That’s not his fault!”</p><p>Julia ignored that. “My Grandma told me that she never felt better than when she was watching someone she’d infected. She’d come back a few days later and see them through their windows with a wet rag on their foreheads. She got one guy so bad that he spent two days with his head in the toilet!”</p><p>After flying east for a while we switched course and came upon our feed. We approached a woman walking down the road. She was pushing a baby girl in a stroller. The woman was pushing the stroller with one hand and talking on a cell phone with the other, completely unaware of Julia and I.</p><p>Right as my stomach had that sour feeling I saw the look on Julia’s face and knew what she meant to do. She buzzed around the woman’s head for a moment and then moved down towards the baby.</p><p>“Julia, stop!” I yelled.</p><p>She looked up at me, confused.</p><p>“That baby has done nothing to deserve a disease. You might kill her, for Gods sake!”</p><p>“And how many of us will this baby grow up to kill?” Julia asked. She settled down onto the baby’s arm. The mother was looking straight ahead, oblivious to the fact that her baby’s health was in danger.</p><p>I couldn’t let this happen. That baby was innocent. I flew as fast I could and rammed into Julia, knocking her back off the child’s arm before she could start sucking.</p><p>“I won’t let you!” I yelled.</p><p>Julia flew in place for a few seconds. She had a stunned look on her face, at least as much of one as a mosquito is capable of. “You’re a real pain in the rear, you know that?”</p><p>It took me a moment to realize that Julia wasn’t going to retaliate. Eventually she flew off without saying anything. I decided that I lost my appetite for the day and headed back home the long way, which is how I happened upon the nectar. Throughout the night neither of my parents mentioned anything about it, so I assumed Julia would keep quiet and stay out of my way. I could only hope that what I said struck a chord with her.</p><p>A few days later her brother visited our home and informed us that she’d been clapped by an elderly man whose neck she tried to suck. My parents offered their condolences, as well as a taste of our nectar supply. I acted sad but couldn’t force myself to mourn for Julia.</p><p>Anyway, after our nectar feast two days ago, I was hungry again, this time for blood. But that wasn’t what made my hunt exciting. Tonight I was going to come back with a full belly so I could try to lay eggs. I’ve always wanted to give my parents grand squitoes before they pass, and since Dad isn’t looking like he’ll make it to his sixth month, I decided to go for it today. My family hasn’t had the best of luck with breeding. Those of us who have been born have been remarkably healthy, but our family tree is unspectacular. Before Greg and I were born, my mother had twice lost her eggs. From the batch that Greg and I came, we were among only four—out of roughly one hundred eggs—that made it to the larvae stage. Our other two would-be siblings never entered the pupal stage. So it was vitally important to fill up with blood today, as I may need numerous chances to accomplish what I wished.</p><p>I navigated around the mile radius of which I was allowed to fly. I came across a frog but wasn’t interested in risking my life, so I flew on. The first human I came across—an oldish woman sunbathing her backyard—I passed on. She, or the frog for that matter, would have sufficed on a normal feeding day, but I wanted the jackpot today. Not to mention to feed off the woman would cause me to be dangerously close to grass; aside from bats, large patches of grass give us mosquitoes the most cause for concern.</p><p>I decided to go a bit outside my normal area, as this was a special occasion and I figured the small risk would be forgiven if I should lay my own eggs. I stopped on a street lamp and rested for a moment. The summer dusk was gorgeous. For most mosquitoes it is our favorite time of the day. The night is cool enough that people will often hang outside, having a few beers and cooking burgers on the grill. And because the dusk lasts a while, my kind has no fear of suddenly being swooped down upon by a bat, which is the way my great grandmother bit the dust. Dawn is okay, but there is truly nothing like the pinkish color the sky will turn as the sun slowly drops. With a bit of sadness, I thought of my father. The man has a passion for a perfect dusk that borders on obsession. I would have given anything to have shared this dusk with him.</p><p>After resting, I lifted off my perch and headed west a couple hundred feet. I caught the scent of carbon dioxide and followed it for a minute until I saw the person whom I knew I wished to lay eggs by. She was an extremely pretty, middle-aged blonde woman who was just leaving her car. Dressed in a pants suit, she had apparently just gotten home from work and carried two bags of groceries, one in either hand. Because her hands were full, I decided I could easily take a draw from either the back of her hand or her neck. Even if she dropped one of the bags of groceries and tried to bludgeon me to smithereens, I would be finished my feeding and on my way home. I would need to fly quickly to grab some of her blood before she entered the home.</p><p>As I closed in on the woman, I decided to go for the back of the neck. It was an obscure spot where I’d probably have no trouble avoiding the dreaded death-by-smashing. I waited until she’d dropped both bags and went in for the feed while she was unlocking the door. I fed and filled up enough to go home and give my parents the good news. I had already flown away from the woman by the time she smacked at her neck. My deed was done. And yet . . .</p><p>I couldn’t resist filling up completely. Her blood. It was the best quality I’d ever come across. It was a bitter-sweet taste so incredibly invigorating that I lost all control. With the mixture of her body heat, the woman’s taste had possessed me. When she lifted her bags I settled onto her neck again. I tried to keep my mind clear, though I was only partly aware of my urges to not end up in the house with her, but I immediately resorted to classic, addict-like excuses. I’ll find a way out. I’ll settle into a corner until she falls asleep and she’ll forget about me. Even while my mind was screaming at me to get away from her, I couldn’t force myself away from the intoxication of her blood. All of my normal fears were irrelevant. I had found the perfect feed and was simply overpowered by its effect. I knew she was walking into the house and I was going straight in with her, and yet my stomach was still not totally full; even the hand of a human with deadly intent coming towards me would not have given me enough power to resist filling my stomach to the brim. Luckily, she didn’t swat just then.</p><p>The woman dropped her bags as my stomach was nearly full. By sheer luck, her slap landed with me just inside of the safe space between the index finger and thumb of her right hand. I finished filling and was able to buzz my heavy body away from danger as her hand smashed down a second time. Because her palm landed square on the lump I had left on her neck, I knew for certain that this slap would have been Daisy’s demise. It snapped me back to reality.</p><p>I needed to get out of here. Now.</p><p>The woman lifted her bags and went into the kitchen. She dropped them on the kitchen table and itched her neck with her left hand. I quickly searched the triple window on the front wall of the house but they were latched shut; indeed, the house was considerably cooler than the night outside, which probably meant the house as a whole had been locked tight. It was too dark to see, but I sensed danger all over the place. Sure enough, the woman came back into the living room, fly swatter in hand, and proceeded to make her intentions obvious. She turned on a lamp in the corner. The worst case scenario happened then, as the force of a one-hundred-watt fluorescent light bulb filled the room. Even if the era of LED lights, this woman still kept the older style in this particular lamp.</p><p>Before I had been a bit scared; now, I was officially terrified. The woman stood next to the lamp, swatter in her right hand, smacking it into the palm of her open left hand as if to say, “Get your butt over here and get what’s coming to you!” I wanted my father more than anything, but he was over a mile away from me.</p><p>Resisting the light is something every mosquito fears. The attraction to fluorescent light is something rooted deeply into our genes and psyche. Before the attraction became unbearable I zipped behind the curtains of the front window. The only thing that saved me was the fact that the street lamp outside shed the tiniest bit of light, just enough to keep my attention diverted from the doom of the fluorescent bulb.</p><p>After a minute my curiosity got the better of me. I had not heard any sound that gave me reason to think it was okay to come out, but then if I didn’t look I might be stuck here for a while and, my belly being so full and all, I might actually fall asleep. I flew to the top of the curtains and had barely a second to react before noticing the square head of the swatter headed straight for me. Thinking fast, I elevated myself towards the ceiling. The good thing was the woman would need to swing upwards and would have less of a chance of smashing me to smithereens. But the bad part is that a mosquito on a bright white ceiling sticks out like a sore thumb. I skittered along the ceiling as the woman whacked at the area I had just been.</p><p>I made my way to the far corner of the room. On the way I must have come too close to the fluorescent light. It attracted me as if it was a magnet and my wings were made of metal. I knew it would give me away but couldn’t help it. As it would turn out, it’s the move that saved my life. I guess mosquitoes experience irony too.</p><p>The woman came towards the lamp with the swatter in hand. I rested on the top right of the lampshade. The woman swung again, missing me by inches. The force she swung with was enough to knock over the lamp. The bulb smashed and the lamp landed sideways on the end table beneath. There was a blinding flash and then the house was dark again.</p><p>“Darn it!” the woman said. She let out a grunt of frustration, and I took off to nowhere in particular, eventually landing atop a picture in the kitchen. The woman flicked on another light, but this one was an LED. Thank God.</p><p>Normally, when a mosquito is in a “panic situation” we are supposed to wait it out. This is especially true at night. Generally, traveling during dawn, or even the afternoon if necessary, is much safer than after the sun goes down. But I had a belly full of what I hoped would be my parents’ grand squitoes, and I intended to make it back to the creek tonight in order to lay my eggs.</p><p>The woman scanned the living room once more and then went about her evening, but not before muttering, “Dumb mosquito.” The woman then put away her groceries, slamming the cabinet doors instead of quietly closing them.</p><p>She went over to the stove and pulled out a pan from beneath it. I watched her gather the ingredients needed for her dinner, catching my breath. I wanted to wait for consistent noise so I could fly around the house and look for an exit without worrying about checking behind me every other second. Luckily the woman enjoyed listening to music while preparing her dinner. After putting water on the stove to boil, she switched on the radio and the sound of smooth jazz filled the house.</p><p>The music was soft, my belly was full, and I was already physically tired from the trip here, not to mention mentally drained from the life-threatening chase that has just taken place. I would have welcomed the opportunity to take a nap right there on the step, but, not only would it be dangerous, I would never reach the creek in time to lay my eggs. I needed to find a way out, and quickly.</p><p>It took me maybe 15 minutes to scour the entire house. I searched every window, but just like the triple window in the living room, they were shut and locked. The back door gave me the tiniest crack to fit through, but decided against it because my belly may have popped, and even if I made it through this crack, there was no guarantee that I could be so lucky with the screen door behind it. Talk about bad luck. I had managed not only to get myself trapped inside a house, but one with central air conditioning and an owner who actually insulated properly. I settled on top of the wooden clock hanging in the living room. It hung on a wall with no lights too close, so I figured it was my best bet. Plus I had the added benefit of watching the front door.</p><p style=\"text-align: center;\">**********</p><p>I don’t know how long I was asleep. A slightly-high-pitched sound woke me from one of those dreams that you are certain was bad can not remember anything about once you’re awake. What woke me up was the woman I’d fed from earlier shouting, “Coming!” from somewhere off in the distance. Before I knew what was happening the woman was walking past me and opening the front door. Thinking faster than my freshly-woken brain normally would I lifted off from the clock and flew towards the door. The woman said, “Hi,” to a good-looking man on the other side of the screen door. I was closing in on them when the man opened the screen door and let himself inside. He was a tall fella, and I had to fly over his head. I quickly darted back down and to the right as the screen door was rushing to a close. I wasn’t sure I would make it so I closed my eyes and kept on trucking. The door slammed shut and I opened my eyes. I sighed with relief; nothing but night surrounded me now. I turned back to face the house just as the woman, oblivious to being outmaneuvered (or maybe just focusing on something else), was closing the front door. I was free.</p><p>I settled down upon a branch in the front yard to calm my nerves. I would need to make the flight back home in one trip if I had any hope of laying eggs. My problem wasn’t the energy I would expend getting back home. I knew the way back and I felt fairly confident about making it. But the night sky was dark. Looking upwards I saw nothing except a clear, gorgeous sky, but I knew that could change in an instant.</p><p>My family was no doubt huddled beneath our tree down by the creek, Greg wondering if Jill and he would get to go out flying again, my parents worrying about their daughter’s fate. It made me smile. Family was such an important part of our short lives. Right then I knew I would make it, would give birth to children. My parents would know the joy of spoiling grand-squitoes with nectar and showing them around our world.</p><p>Taking a deep breath, I lifted off the branch and didn’t start moving forward until I had elevated high above the roof of the house I’d been trapped in such a short time ago. I flew gracefully, marveling at the night-time views that us mosquitoes so rarely experience. I thought to myself that after I had children I would have to take them night flying. Mom and Dad had never done so with Greg and I—not that I fault them for that—but I wanted my children to experience as much as possible in their lives. Everything was swell. I was making excellent time, but then something terrible happened.</p><p>When I started my trip home I had that feeling inside of me, that certainty that something was going to go wrong; unfortunately, I was right. About three quarters of the way home I heard the sound that every mosquito dreads. It’s practically our funeral song. From somewhere not too far—certainly not far enough—above my head, I heard the distinctive chirp chirp chirp that could only have come from a bat. I tried not to panic. All mosquitoes knew what to in this situation, just like humans know what to do if their house catches fire. I lowered myself in mid-flight until I was about halfway down the trees I passed. Hopefully the branches, plus my lowered flight path, would be out of sonar range and I could stay undetected.</p><p>After another hundred feet I could see my home. It was still far enough away that I couldn’t make out the exact location of my family’s home, but close enough that I could almost breathe a sigh of relief. The only problem now was the couple-hundred-foot stretch of open air that I needed to make it through in order to reach my family. I settled on the last possible branch. I wanted to relax, but I wanted to get home, but I didn’t want to end up a bat snack either. I didn’t know what to do. It turned out the decision was made for me.</p><p>The earth suddenly seemed to come crashing down on my branch. I was knocked off my perch and the sound of the bat’s hiss was much too close behind me. I flew for all I was worth and I’m pretty sure I was screaming as loud as I could. I would say the experience I had was similar to a person falling from a very high building. You know your life is over and there’s nothing you can do about. I couldn’t out-fly this bat on my best day and its worst day. I would be dead in seconds. No babies, no grand squitoes . . . just death . . . coming any second . . .</p><p style=\"text-align: center;\">**********</p><p>The sun was bright when I woke. The summer day was hot and humid. The moisture in the air felt blanketed to my body.  I felt lethargic.</p><p>I saw my mother’s face. She looked simultaneously happy and heart broken. Kendall, the closest thing we had to a nurse, was by my mother’s side. They helped me get out on the waters surface.</p><p>“Drink honey,” my mother said softly.</p><p>I think I said something unintelligible and did as she said.</p><p>The nurse said something I couldn’t make out.</p><p>Everything went black again.</p><p style=\"text-align: center;\">**********</p><p>The next time I woke I smelled the sweet aroma of nectar. I lay there with my eyes open for a moment, unsure of where I was or who I was or what was I doing; nothing made sense at that moment. But after a little while my mind began to release the fog and things became clear.</p><p>I heard my brother’s voice shout: “She’s up Ma!”  Greg gave me a hug and told me we had plenty of nectar.</p><p>My mother buzzed over and landed in front of me. With her help I turned myself upright. She hugged me tight and whispered, “Congratulations Daisy, you’re a mother.”</p><p>“I am?”</p><p>My mother smiled and gestured to the water, where there was a raft. My babies, dozens of them, were nestled all around it. I can’t explain the sense of excitement that came over me. I started crying and hugged my mother so tightly it’s a wonder we didn’t end up stuck together. She kissed my head and held me. It all came back to me then. The bat, the chase, the certainty of death. How had I done it?</p><p>“Congratulations to you to mom. You’re officially a grandmother. Where’s dad?”</p><p>Over my mother’s shoulder I saw Greg turn away suddenly. The feeling I’d had in my stomach when I first heard the chirping of the bat came back. As the fog continued to disappear, I vaguely remembered nearing my home and knowing it was over. And then . . . yes, something flew by close overhead in the opposite direction. I remembered that whatever it was yelled something loudly, as if asking for attention. Unless I was still too groggy to remember correctly, I could have swore I heard my name being shouted before I passed out. Wishful thinking? Maybe so.</p><p>“Your father loved you so much honey. Don’t you ever think for one second that he didn’t love you with his whole entire heart?”</p><p>My mother and I stayed locked in our hug for a long time, crying until it was simply no longer possible. My father managed to teach me one final lesson before his death. He taught me the joy of having children, and how a loving parent will go to the end of the earth for there kids; how a loving parent will always protect their children, even if it means endangering themselves. I understand his actions, because I too would gladly sacrifice myself for my children.</p><p>I ended up with nine healthy, disease-free, beautiful children. We even found a way to be happy again, and my mother lived out the rest of her days as joyous as I’d ever seen her. She never dated again. I think it’s because, after loving my father, no man would be able to cut it.</p><p>I however did find a father for my children. He’s a wonderful influence to them, and I must say he’s quite the handsome mosquito as well. My six girls are exactly what I hoped they’d be, and the three boys admire their Uncle Greg on a level I wouldn’t have thought possible. My boys, especially Jack, look more like their grandfather every day. It reassures me that my father will never be forgotten. Whenever I teach my own children a valuable lesson, I make sure they know that Grandpa taught it to me first. I’m three months old now, and I’m looking forward to the future, hopefully to grand-squitoes of my own.</p><p>And that’s my story. I hope it inspires someone who finds a mosquito feasting on their arm to flick rather than smash. We can deal with a soft flick once in a while.</p>"}