{"title": "The Dandruff Prank", "author": "Evelyn B. Christensen", "level": "3 to 5,6 to 8,9 to12,", "category": "Funny,Illustrated,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>I was not the youngest in my family. But when it came to teasing, for some unknown reason, at age seven I seemed to be the favorite target. The three oldest––Eric, Lara, and Adam––were experts at it. They seemed to know exactly what to do to get under my skin.</p><p>And speaking of skin, that just happened to be their target one day––the skin on my scalp, that is.</p><p>“Hey, Evelyn, has your head been itching lately?” Adam asked in that falsely innocent tone I always hated.</p><p>“No. Why?”</p><p>“Ummm. Just wondering.”</p><p>“Why should it be itching?” I was getting suspicious. Adam had that smug look on his face that always meant trouble––trouble for me.</p><p>“Have you ever heard of dandruff?”</p><p>“Of course, I’ve heard of dandruff. What of it?”</p><p>“I think maybe you’ve got some. Want me to check your head to make sure?”</p><p>Mortified at the thought that I had enough dandruff to be noticed by somebody else, I let down my guard and meekly nodded, “Yes.”</p><p>“Sit down so I can see better….ummm, this looks bad. Lara, come tell me what you think.”</p><p>“Yeah, it looks bad to me, too. Eric, come help us decide.”</p><p>I cringed as the three of them poked around in my hair. Finally, Eric said, “Well, the best way to tell for sure is for you to lean over the coffee table, Evelyn. Scratch your head and we’ll see if any dandruff comes out.”</p><p>“Yeah, that’s a good idea,” agreed the other two.</p><p>Trustingly, I followed their directions. I knelt down beside the table, leaned over, and started scratching. To my horror, white stuff began pouring onto the table!</p><img src='https://xcx.mdavid.cn/img/dandruff-illustration-opt.jpg'></img><p>“Ohhhh noooo!” I wailed. Scrambling to my feet, I raced into the kitchen, grabbed my mom around the waist, and burst into tears.</p><p>“What on earth is the matter, Evelyn?”</p><p>“Oh, Mom! It’s terrible! I’ve got the most horrible dandruff! What am I gonna do?”</p><p>“Calm down,” she soothed. “What makes you think you’ve got horrible dandruff?”</p><p>I grabbed her hand and tugged her into the living room. Shame-faced, I pointed to the coffee table.</p><p>She glanced at it for less than half a second and then noticed Eric, Lara, and Adam trying to disappear down the hall. “Hold on, you three!”</p><p>They turned back as Lara tried unsuccessfully to hide the saltbox under her sweater. Their bottled-up laughter spilled over as they confessed, “Oh, Mom, we know we shouldn’t’ve done it, but it was so funny!”</p><p>Mom shook her head and let out a long-suffering sigh. “Why can’t you kids find something else to do with all your wonderful creativity?” Turning to me, she gave me a warm hug and an understanding smile, saying, “Try not to let them bother you, Evelyn.”</p><p>And I did try. Really, I did. But every time after that, whenever I salted my food at the table and glanced up to see Adam grinning at me, I couldn’t help wondering what prank the three of them were planning to spring on me next!</p>"}