{"title": "Daniel and the Pirates", "author": "Carol Bennett", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,10 - 15 mins,", "body": "<p>Daniel and his sister were huddled in the hold of the British schooner London Lady, listening to the terrifying sounds above. They trembled at the boom of the cannon, the cracking of the mast, the screams of alarm and shouted orders.</p><p>Their father’s last words had been, “Stay here. Whatever happens I want you to trust God. He’ll be with you. Remember that.”  Then he disappeared up the ladder to help in the battle.</p><p>The black pirate flag on the approaching ship had struck terror in the hearts of most of the passengers on board. Daniel wasn’t too sure about trusting God but he did trust the captain and crew, who were strong and brave. When he heard the pounding of footsteps on the wooden stairs though, and the triumphant shouts of the pirates searching every cabin, he knew that the crew had not been successful. The boisterous men finally entered the hold, opening barrels and smashing crates.</p><p>“God will take of us,” Anna Marie said in the faintest of whispers. Daniel wasn’t so sure about that.</p><p>And finally the barrel that hid them was shoved away.</p><p>“Well, well, well—what do we have here?”</p><p>Rough hands yanked them out.</p><p>“Two little varmints down here, Captain,” a tall pirate with shaggy hair shouted.</p><p>“Well, bring ‘em up.”</p><p>On deck, smoke filled the air and fire blazed at the far end. The captain looked them over.</p><p>“Let them live. I need a new cabin boy. And the girl can scrub floors.”</p><p>“No other captives, Captain,” said a vicious-looking little man. “All the rest are drowned by now.”</p><p>“Plenty of booty, though,” said another. “Passengers had a goodly amount of gold, sir.”</p><p>Most of the buccaneers were working fast, getting their loot off the ship. Soon Daniel and Anna Marie were being forced down the ladder into a small boat below. As it moved out, they could see that the bow of the London Lady was nearly submerged. The fire was spreading rapidly, flames bursting up and consuming everything in its path.</p><p>On the pirate ship, the two were left to themselves for a moment. Daniel put his arm around his sister and they stood at the rail watching the wreck as the smoke billowed forth, darkening the sky.</p><p>“We belong to the Kingsbury family of London—and we’ve come to this,” he muttered  bitterly.</p><p>“That’s something I wouldn’t be telling the likes of them,” came a raspy voice beside them.</p><p>Daniel jumped. He whirled around and saw an old man with long, stringy hair and tattered clothes.</p><p>“Who are you?  Get away from us!”</p><p>“Shhh. I’m a captive just as you are. I’m not one of them. Come with me. Maybe they’ll let you stay with me.”</p><p>“And why would we want to?” snapped Daniel.</p><p>Anna Marie scowled at him and turned to the man. “Thank you, sir,” she said, taking the lead in following him as he guided them down a ladder.</p><p>“I’m telling you, boy, don’t be saying who you are.”</p><p>“But our uncle is a colonel and he’ll have the navy here as soon as he hears of this disgrace!”</p><p>“These buccaneers aren’t fools. They’ll be away from here and in hiding before your uncle even gets word of it.”</p><p>A deafening blast rent the air, causing them all to leap back startled.</p><p>“There she goes. No one will ever know what happened here.”</p><p>Anna Marie put a hand over her mouth as tears streamed down her face.</p><p>“Stop making her cry!” snapped Daniel angrily.</p><p>“No,” his sister gulped. “Dan. I’m all right. Look, we’ve got someone to help us. God’s taking care of us just as Papa said.”</p><p>Daniel turned on her furiously. “The last thing I want to hear about is God!  I’m going to do something about this.”</p><p>But the man grabbed his arm. “It’ll just go worse for you making a row, boy. Just lay low for now. Your time will come.”</p><p>“Yours hasn’t—or so it appears,” Daniel hissed angrily.</p><p>The man paused at the door to the galley. Finally, he said, “no, I haven’t had my chance yet even after eight years. They watch me closely. But maybe we can help each other.”</p><p>Suddenly a voice came from the other end of the passageway. “What’re doin’ with them captives?”</p><p>“Putting them to work if you want your dinner on time,” the man yelled back. “Did you bring any food aboard? I suppose not. All you’re interested in is booty and you expect me to cook meals out of nothing.”</p><p>“Yeah, we brought food, old man. Come up and get it ye’self and then get to work!  We’re hungry!” The pirate disappeared up the  steps.</p><p>Daniel stared at him and finally said, “thank you, sir,” to show he was sorry for not believing the old man.</p><p>Their new friend smiled at him. “You’ll be all right.”</p><p style=\"text-align: center;\">***</p><p>The two young people settled into their new life. Anna Marie helped with the cooking, something she knew nothing about since servants did all that at home. But she was quite willing to learn. They discovered that the elderly man who had befriended them was Mr. Robert Penningworth. He had been a professor in a large school back in England. He was also very religious.</p><p>Daniel did his chores for the captain stoically. He was careful to keep his hatred  hidden, knowing that the time would be right someday and then he would extract revenge a hundredfold!</p><p>“Bitterness never pays, boy,” Robert told him and his sister seemed to agree.</p><p>But Daniel didn’t listen. He couldn’t abide them talking about God either. Every evening the man read aloud from a small battered Bible that he kept safe in a burlap bag.</p><p>“Only thing they let me keep,” the man had told them the first night, holding it as if it were priceless. “None of them wanted it.”</p><p>Don’t blame them. What good’s it doing you?</p><p>Robert pursed his lips. He seemed to know what Daniel was thinking but he just cheerfully continued reading and discussing the Scriptures with Anna Marie.</p><p style=\"text-align: center;\">***</p><p>One night everything changed. Land had been sighted that day and a visitor came rowing toward the ship around sunset. The captain called on Daniel for food and drink as he welcomed the unsavory man into his cabin.</p><p>While he was serving the food, Daniel paid close attention—and gained some very interesting information. The captain and the visitor had business some distance down the coast. The man had brought a huge chest of gold on board and apparently had more hidden in a cave at their destination. As Daniel passed, he couldn’t help staring at the gleaming gold and jewels. Then he noticed the captain staring at him and he forced himself to tend to his work and return to his indifferent manner. But that night he and Robert and Anna Marie began making plans for escape.</p><p style=\"text-align: center;\">***</p><p>The evening they had been waiting for finally arrived. Since there was no moon, it was quite dark. The pirate ship entered a cove which was deep enough to anchor safely.</p><p>And close enough for them to swim to shore.</p><p>They had little of value to take with them except for Robert’s precious Bible in a waterproof sack. Most of the men went ashore for an evening of drinking and gambling in the local village. The guard on duty was lazy. They knew he wouldn’t bother watching once the captain was gone. He would probably fall asleep.</p><p>After the captain and his visitor left to go ashore, Daniel hurried to leave the cabin with his tray of dishes and meet Robert and Anna Marie. But he suddenly stopped short. The chest in the corner had been left unlatched! As he slowly put the tray down and went to the chest, lifting the lid, he realized for the first time that he didn’t just despise the buccaneers, he was intensely jealous of their wealth. The sparkling treasure made him dizzy and he shook his head in awe…and excitement.</p><p>He knew he needed to hurry. Now might be their only chance to get away for years perhaps. But he couldn’t stop staring at the mass of glittering jewels and coins. He grabbed up a pouch and filled it. The captain’s big knife with the fancy gold handle was laying nearby, too.</p><p>Suddenly a voice behind him made him jump. “Boy, you don’t want to do that.”</p><p>It was Robert, with Anna Marie, coming to find out what was taking him so long. He glared at them.</p><p>“Are you going to be just like them, boy?”</p><p>“I’m nothing like them!” hissed Daniel. He held onto the pouch. “We’re going to need money to get back to London. And—this—is for protection.”</p><p>“No it isn’t, Dan,” said Anna Marie quietly.</p><p>Daniel knew she was right. He longed for these things more than anything—except perhaps revenge.</p><p>“Come on,” urged Robert. “We have to go—now.”</p><p>Daniel stared at the coins and the knife longingly.</p><p>“Please, Dan….Papa wouldn’t want you to steal,” Anna Marie pleaded.</p><p>Finally he left both the pouch and the knife on the desk and turned away. It was the hardest thing he had ever done and it was only for his sister and the memory of his father, not because he wanted to. But Anna Marie rewarded him with a big smile and Robert slapped him on the back. They quickly climbed the ladder to the deck and Robert poked his head out cautiously. The pirate on duty was already dozing. Tiptoeing behind some barrels, the old man silently let the rope ladder down.</p><p>They slipped over the rail, climbed down, and dropped into the water. Helping Anna Marie, whose long dress hindered her, they swam the short distance. The trio stumbled up on the beach, dripping and weary.</p><p>They were free!</p><p>One of the small boats was on the beach, near the opening to a cave, so they quickly ducked behind some rocks.</p><p>They’d hidden just in time for they suddenly heard voices near the mouth of the cave. “There’s the captain and the stranger. They’ve got more treasure,” whispered Robert.</p><p>The three watched as another wooden chest was loaded onto the small boat.</p><p>“They’re going back out to the ship—without the rest of the crew,” observed Robert.</p><p>“And we don’t know where they are,” Anna Marie pointed out. “They might be coming back this way.”</p><p>“Their boat isn’t here. They probably docked at the village.” Robert led the way around the cliff, staying in the shadows.</p><p>“We shouldn’t be hiding,” said Daniel. “We should be going for the magistrate.”</p><p>“This is a coastal village. Most of the time the authorities are powerless. Pirates are vicious and the townspeople probably just lay low until they’re gone.” Robert told him. “Leave it to God, Daniel.”</p><p>Daniel hated advice like that. What could God do, anyway?</p><p>“He brought us this far,” Robert reminded him. “He kept you both from being killed or harmed. I know it’s been hard these last few weeks but He’s protected you in ways you can’t know. Pirates can be ruthless. They’ll hurt just for fun.”</p><p>They were heading into the forest when a deafening BOOM split the air. Cannon fire! They whirled and looked out to sea.</p><p>A ship! Flying the British flag!</p><p>The British navy ship had apparently sailed into the cove while they were creeping ‘round the cliff. They watched as the pirate ship was bombarded with cannon balls.</p><p>“God knew they were coming all the time!” shouted Robert, excitedly.</p><p>Daniel was stunned. God did have it under control, after all. Perhaps he should believe the things he’d always been taught. Perhaps he should have faith in God. He’d have to think about it….</p><p>Suddenly there was a commotion coming from the village. It looked like the rest of the pirates were running for the beach—with a mob behind them.</p><p>Then Anna Marie shouted, “look! It’s Papa!”</p><p style=\"text-align: center;\">***</p><p>Reunited with their father once again, they discovered that he and several of the crew and passengers had not perished but had been picked up by the navy ship not long after the London Lady sank. The wounded had been brought here and the navy vessel had gone after the pirate ship. They had been there, out of sight, all the time. Just as they were ready to take the ship, they recognized the stranger as someone they had been searching for and decided to wait. And now they had captured them all and found the pirates’ lair.</p><p>Daniel knew exactly what Robert was thinking as the old man grinned at him. He and Papa and Anna Marie had been right after all.</p><p>And actually, Daniel didn’t mind being wrong—this once.</p><p style=\"text-align: center;\">The End</p>"}