{"title": "Darryl’s Day", "author": "Larry Flewin", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Dragonfly,", "length": "01 - 05 mins,", "body": "<p> It was a beautiful day for flying, the sky a wondrous blue, the sun beaming with happiness. Darryl loved to be up in the air and went flying every chance he got. It felt like you were floating through the air. Darryl was a Dragonfly.</p><p>He would take off from the meadow beside the river. A hop, a skip and a jump and he was up into the air. Sometimes he would be joined by his friends Robin and Gnat. Together they played tag, chasing each other over trees, under clouds, and in between the tall reeds that grew along the riverbank.</p><p>When they weren’t around Darryl would take friends like Mouse for a ride. Mouse would climb on his back, hold on tight, and together they would zoom high into the sky. Mouse would tug on Darryl’s wings to make him go this way and that. He squeaked with delight as they did loop-the-loops, upside downs and spinning twists.</p><p>Going up was easy for Darryl but coming back down again wasn’t. He could fly wonderfully but he couldn’t see very well. During the day, his friends would help him land by waving dandelions like flags. Sometimes the ladybugs would make large arrows on the ground. In the evenings, lightning bugs would light the way home.</p><p>One day when Darryl was flying alone a storm came up. It was windy and rainy and Darryl got lost. He tried his best to go home but he couldn’t see well enough to find his way. Finally, he landed near a hole in a muddy field far from home. When he stopped a furry brown head popped out of the hole.</p><p>“Hello friend, I’m Gopher. Who are you?”</p><p>“Hi, my name is Darryl. Sorry about landing on your porch but I can’t see very well in the storm.”</p><p>“Oh that’s okay,” said Gopher. “I can’t see very well myself. Then I found these glasses just over there under the trees. I look through them and I can see great!”</p><p>“Really? I wish I could. I can’t go home and I know all my friends will be worried.”</p><p>“Why don’t you try this pair?” said Gopher. “Maybe they will help you too!”</p><p>He gave them to Darryl. He put them on his nose and looked through them.</p><p>“Wow! I can see great with these! Thank you!”</p><p>“Glad to help,” said Gopher. “I have lots of these. I find them in the Park all the time.”</p><p>Darryl flew straight home now that he could see. Along the way, he met the Lightning bugs who were looking for him. Darryl could see even in the storm so he led the way. They passed over a giant arrow made by the Ladybugs. He waved and shouted thank you. Then he could see dandelions waving at the edge of a field and he knew he was home.</p>"}