{"title": "Dick Whittington", "author": "Joseph Jacobs", "level": "6 to 8,9 to12,", "category": "Classic,Folk Tale,Historical,True,", "tag": "Cat,", "length": "10 - 15 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Richard_Wittington_and_his_Cat.jpg'></img><p>Dick Whittington was a very little boy when his father and mother died; so little, indeed, that he never knew them, nor the place where he was born. He strolled about the country in ragged clothes, till he met with a wagoner who was going to London, and who allowed him to walk all the way by the side of his wagon without paying anything for his passage. This pleased little Whittington very much, as he wanted to see London so badly, for he had heard that the streets were paved with gold. But how great was his disappointment, poor boy! when he saw the streets covered with dirt instead of gold, and found himself in a strange place, without a friend, without food, and without money.</p><p>Though the wagoner was so kind as to let him walk up by the side of the wagon for nothing, he abandoned him when he came to town, and the poor boy was, in a little time, so cold and hungry that he wished himself in a good kitchen and by a warm fire in the country.</p><p>In his distress he asked charity of several people, and one of them suggested to him “Go to work for an idle rogue.”</p><p>“That I will,” said Whittington, “with all my heart; I will work for you if you will let me.”</p><p>The man, who thought this was cheeky of him (though the poor lad wanted only to show his readiness to work), hit him with a stick. In this situation, and fainting for want of food, he laid himself down at the door of one Mr. Fitzwarren, a merchant, where the cook saw him, and, being a grouchy woman, ordered him to leave or else she would put hot water on him. At this time Mr. Fitzwarren came from the Exchange, and began also to scold at the poor boy, telling him to go and get a job.</p><p>Whittington answered that he should be glad to work if anybody would give him a job, and that he should be able if he could get some food to eat, for he had had nothing for three days, and he was a poor country boy, and knew nobody, and nobody would employ him.</p><p>He then tried to get up, but he was so very weak that he fell down again, which made the merchant feel so sorry for him that he ordered the servants to take him in and give him some meat and drink, and let him help the cook to do any dirty work that she had to set him about.</p><p>Dick Whittington could have lived happily in this worthy family had he not been bumped about by the cross cook, who when she wasn’t busy with roasting or baking liked to be cruel to him! At last Miss Alice, his master’s daughter, was told about it, and then she took pity on the poor boy, and made the servants treat him kindly.</p><p>Besides the crossness of the cook, Whittington had another problem to get over before he could be happy. He had, by order of his master, a bed placed for him in a tiny attic room, where there was a number of rats and mice that often ran over the poor boy’s nose and disturbed him in his sleep. After some time, however, a gentleman who came to his master’s house gave Whittington a penny for brushing his shoes. This he put into his pocket, being determined to use it for something useful; and the next day, seeing a woman in the street with a cat under her arm, he ran up to know the price of it. The woman (as the cat was a good mouser) asked a deal of money for it, but on Whittington’s telling her he had but a penny in the world, and that he badly needed a cat, she let him have it.</p><p>This cat Whittington concealed in the attic room, for fear she should be beaten about by his enemy the cook, and she soon killed or frightened away the rats and mice, so that the poor boy could now sleep soundly.</p><p>Soon after this the merchant, who had a ship ready to sail, called for his servants, as his custom was, in order that each of them might send something on his voyage to sell and hopefully make their fortune.</p><p>All the servants appeared but poor Whittington, who, having neither money nor goods, could not think of sending anything to try his luck; but his good friend Miss Alice ordered him to be called.</p><p>She then offered to put something on the ship for him to sell, but the merchant told his daughter that would not do, it must be something of his own. Upon which poor Whittington said he had nothing but a cat which he bought for a penny that was given him.</p><p>“Fetch your cat, boy,” said the merchant, “and send her.”</p><p>Whittington brought poor puss and delivered her to the captain, with tears in his eyes, for he said he should now be disturbed by the rats and mice as much as ever. All the company laughed at the adventure but Miss Alice, who pitied the poor boy, and gave him something to buy another cat.</p><p>While puss at sea, poor Whittington was severely beaten at home by his mean mistress the cook, who used him so cruelly, and made such fun of him for sending his cat to sea, that at last the poor boy determined to run away from his place, and having packed up the few things he had, he set out very early in the morning on the first day of November, which was known as All-Hallows day. He traveled as far as Holloway, and there sat down on a stone to consider what direction he should take; but while he was thinking, Bow bells of the church of St. Mary-le-Bow, of which there were only six, began to ring; and he thought their sounds addressed him in this manner:</p><p>“Turn again, Whittington, Thrice Lord Mayor of London.”</p><p>“Lord Mayor of London!” said he to himself, “what I wouldn’t do to be Lord Mayor of London, and ride in such a fine coach? Well, I’ll go back again, and suffer all the cruely of the cook rather than miss the opportunity of being Lord Mayor!” So home he went, and happily got into the house and about his business before she made her appearance.</p><p>We must now follow Miss Puss to the coast of Africa. How dangerous are voyages at sea, how uncertain the winds and the waves, and how many accidents happen at sea!</p><p>The ship that had the cat on board was long beaten at sea, and at last, by strong winds, driven on a part of the Barbary coast of which was inhabited by people called Moors that were unknown to the English. These people welcomed our countrymen kindly, and therefore the captain, in order to trade with them, showed them the types of goods he had on board, and sent some of them to the King of the country, who was so well pleased that he sent for the captain and his assitant to come to his palace, which was about a mile from the sea. Here they were placed, according to the custom of the country, on rich carpets, flowered with gold and silver; and the King and Queen being seated at the upper end of the room, dinner was brought in, which consisted of many dishes; but no sooner were the dishes put down but an amazing number of rats and mice came from all quarters and devoured all the meat in an instant.</p><p>The captain, in surprise, turned round to the nobles and asked if these mice and rats were not offensive.</p><p>“Oh! yes,” said they, “very offensive; and the King would give half his treasure to be freed of them, for they not only destroy his dinner, as you see, but they attack him in his chamber, and even in bed, so that he has to be guarded from them while he is sleeping, for fear of them.”</p><p>The captain and his assistant jumped for joy; they remembered poor Whittington and his cat, and told the King they had a creature on board the ship that would get rid of all these vermin immediately. The King’s heart heaved so high at the joy which this news gave him that his turban dropped off his head.</p><p>“Bring this creature to me,” said he; “vermin are dreadful in a court, and if she will perform what you say I will load your ship with gold and jewels in exchange for her.”</p><p>The captain, who knew his business, took this opportunity to describe how wonderful was Miss Puss. He told his Majesty that it would be hard to part with her, as, when she was gone, the rats and mice might destroy the goods in the ship—but to help his Majesty he would fetch her.</p><p>“Run, run,” said the Queen; “I am impatient to see the dear creature.”</p><p>Away flew the captain’s assistant, while another dinner was providing, and returned with the cat just as the rats and mice were devouring that also. He immediately put down Miss Puss, who killed a great number of them.</p><p>The King rejoiced greatly to see his old enemies destroyed by so small a creature, and the Queen was highly pleased, and desired the cat might be brought near that she might look at her. Upon which the assistant called “Pussy, pussy, pussy!” and she came to him. He then presented her to the Queen, who started back, and was afraid to touch a creature who had made such havoc among the rats and mice; however, when the factor stroked the cat and called “Pussy, pussy!” the Queen also touched her and cried “Putty, putty!” for she had not learned English.</p><p>He then put her down on the Queen’s lap, where she, purring, played with her Majesty’s hand, and then sang herself to sleep.</p><p>The King, having seen how great Miss Puss had done with the rats and mice, and being told that her kittens would stock the whole country, bargained with the captain and assistant for the whole ship’s cargo, and then gave them ten times as much for the cat as all the rest amounted to. On which, they left and sailed with a strong wind for England.</p><p>The morning had scarcely dawned when Mr. Fitzwarren arose to count over the cash and settle the business for that day. He had just entered the counting-house, and seated himself at the desk, when somebody came, tap, tap, at the door.</p><p>“Who’s there?” said Mr. Fitzwarren.</p><p>“A friend,” answered the other.</p><p>“What friend can come at this early time?”</p><p>“The is not bad time for a friend,” answered the other. “I come to bring you good news of your ship Unicorn.”</p><p>The merchant got up and instantly opened the door, and who should be seen waiting but the captain and assistant, with a cabinet of jewels, and a list of all the treasures on board, for which the merchant lifted up his eyes and thanked heaven for sending him such a prosperous voyage. Then they told him the adventures of the cat, and showed him the cabinet of jewels which they had brought for Mr. Whittington. Upon which he cried out with great earnestness, but not in the most poetical manner:</p><p>“Go, send him in, and tell him of his fame, And call him Mr. Whittington by name.”</p><p>Mr. Fitzwarren was an honest man and said “God forbid that I should deprive him of a penny; it is his own, and he shall have every last penny!”</p><p>He then ordered Mr. Whittington in, who was at this time cleaning the kitchen and would have excused himself from going into the counting-house, saying the room was swept and his shoes were dirty and full of hob-nails. The merchant, however, made him come in, and ordered a chair to be set for him. Upon which, thinking they intended to make fun of him, as had been too often the case in the kitchen, he begged his master not to mock a poor simple fellow, who intended them no harm, but let him go about his business. The merchant, taking him by the hand, said: “Indeed, Mr. Whittington, I am in earnest with you, and sent for you to congratulate you on your great success. Your cat has made you more money than I am worth in the world, and may you long enjoy it and be happy!”</p><p>At length, being shown the treasure, and convinced by them that all of it belonged to him, he fell upon his knees and gave thanks for his good fortune. He then laid all the treasure at his master’s feet and said it was him who deserved it. The master refused to take any part of it, but told him he was delighted at Dick’s prosperity, and hoped the wealth he had acquired would be a comfort to him, and would make him happy. He then asked his mistress, and his good friend Miss Alice to take some. But they refused to take any part of the money, but told him they heartily rejoiced at his good success, and wished him all the best of luck. He then thanked the captain, assistant, and the ship’s crew for the care they had taken of his cargo and paid them handsomely. He likewise gave presents to all the servants in the house, not forgetting even his old enemy the cook, though she little deserved it.</p><p>After this Mr. Fitzwarren advised Mr. Whittington to send for the necessary people and dress himself like a gentleman, and made him the offer of his house to live in till he could provide himself with a better.</p><p>Now it came to pass when Mr. Whittington’s face was washed, his hair curled, and he dressed in a rich suit of clothes, that he turned out very handsome and confident, so much so that Miss Alice fell in love with him.</p><p>When her father perceived they had this good liking for each other he proposed a match between them, to which both parties happily agreed, and in short order a great wedding was held.</p><p>History tells us that they lived very happy, had several children, and died at a good old age. Mr. Whittington served as Sheriff of London and was three times Lord Mayor and knighted by the queen.</p><p>Sir Richard, as Dick became known, constantly fed a great number of poor citizens, built a church and a college, with a yearly allowance for poor scholars, and near it built a hospital and was renowned for his charity throughout the remainder of his life.</p>"}