{"title": "Don’t Forget to Wash Behind Your Ears", "author": "Nathan Oser", "level": "6 to 8,9 to12,Teen,", "category": "Funny,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Mom and Dad had company over.  I didn’t know much about the Robinsons, only that they didn’t have any kids my age.  If they did I wouldn’t have had to chase the football when I practiced kickoffs, or we could have played Frisbee, or even had a water fight.  Water fights were the best on hot summer days, and today was a scorcher.</p><p>Still, I couldn’t waste my time sitting in the house.  Summer was special-made for playing outside–there were bugs to catch, creeks to splash through, trees to climb, and the sun was like a slow-motion replay of an out-of-the-park home run hit so high the ball might never come down on the other side of the stadium.  Those last bits of twilight around 7:30, 8:00 were the greatest.  Not a chance I would make it home in time for dinner.</p><p>I’d munched on mulberries all afternoon, but after dark my stomach really started to rumble.  I sailed through the tall grass, following backdoor porch lights like buoys, until I was home.  The screen door clapped shut behind me, and my eyes landed on a wrapped up plate of ham and egg noodles with a slice of pineapple.  While I was nuking the food Mom and Mrs. Robinson came into the kitchen for ice.</p><p>“I can’t believe how much you’ve grown,” Mrs. Robinson told me, wide-eyed.</p><p>“Tallest of the whole team and still growing like a weed!” Mom added proudly.</p><p>They laughed and I smiled.</p><p>“Where’ve you been hiding all day?” Mom’s friend asked.</p><p>I pulled the plate from the microwave a few seconds before it beeped.  “Outside.”</p><p>“And you look like you’ve brought half the outside inside.  You can’t eat dinner like that.  Go take a shower, and I’ll keep your ham in the oven.”  Mom took the plate from my hand and pulled a leaf from my hair as I passed.</p><p>They laughed again, and from the hallway I heard Mrs. Robinson say, “Don’t forget to wash behind your ears!”</p><p>What did she mean?  I thought about it all the way to the bathroom, feeling behind my ears gently at first then rubbing my fingers over the skin to see if anything came off.  I leaned over the sink and looked in the mirror.  I folded both ears forward, titled my head this way and that, but couldn’t find anything.  I thought my eyes might flip backwards inside my head if I looked any harder.</p><p>Just what was back there!?</p><p>Was it sweat?  Dirt?  Dried up mud from the creek?  Another leaf like the one Mom pulled from my hair?</p><p>My imagination began to whirl.</p><p>Could it be a grass stain?  Or a whole blade?  Flakes of tree bark?  A twig?  A juicy, black mulberry, even?</p><p>I shucked my clothes on the tile and hopped in the shower.  I wiggled around so the water pounded at the backs of my ears.  Whatever was back there, it had to wash off.  Then I’d have a look at it.</p><p>What if it was a bug?  An ant or a ladybug or a big old caterpillar?  I watched the drain but nothing washed down.</p><p>Maybe it was something like a tick or burr holding on for dear life under the hard streams of water.  Or a spider web?  No, a creepy, crawly spider!  No.  A bird feather?  Or a whole bird?</p><p>It could be anything!</p><img src='https://xcx.mdavid.cn/img/Dont-Forget-to-Wash-Behind-Your-Ears-Illustration-Final-optimised.jpg'></img><p>I remembered the creek.  Maybe a water strider or a minnow had jumped up behind my ear.  No way.  Whatever it was, it had to have an awful strong grip.  It would need something like claws or talons.</p><p>I could almost feel it pulling at my ears.  The scissor-sharp pincers of a cranky, old crab?  Who knows where that creek went!</p><p>Could it be an octopus with eight huge arms and big, sticky suction cups?  Or maybe, just maybe, it was a mermaid using magic to make itself invisible in the mirror!</p><p>What about a dragon?  An enormous, saw-toothed dragon with thousands of blue scales so you couldn’t see it flying down at you from the sky!  It could be waiting behind me for a chance to breathe fire and burn my hair to a crisp!</p><p>I leaped out of the shower and checked the mirror again.  I dried off and scrubbed extra hard behind my ears.  Back downstairs Mom and Dad were sitting on the couch, reading.  The Robinsons had gone home.</p><p>“Dad,” I said, “do you see anything behind my ears?”  He slid down his glasses with a hmmm and an ooohh.</p><p>I bit my lip.  Maybe he’d found it!</p><p>Then in a flash of goose bumps he ran his fingers over my neck to the top of my head where he tousled my hair and said, “Not a thing.  Clean as a whistle.”</p><p>What a relief!</p><p>I ate my dinner and headed to bed.  And as I crawled under the covers I wondered what I might bring home behind my ears tomorrow…</p>"}