{"title": "Dot Helps Out", "author": "Dorcas Wilson", "level": "3 to 5,6 to 8,", "category": "Funny,Modern,Original,", "tag": "Cow,", "length": "01 - 05 mins,", "body": "<p>On a farm somewhere in Scotland lived Farmer MacTattie, Mrs MacTattie and the little MacTatties,  Dot the cow, MacStout the horse and an old red tractor.</p><p>One spring morning Farmer MacTattie climbed into the old red tractor and turned the key. The old red tractor coughed and spluttered as smoke poured out of its engine.</p><p>‘Mrs MacTattie! Mrs MacTattie! Call the mechanic!’ Farmer MacTattie shouted jumping out the tractor in fright.</p><p>When the mechanic arrived Dot, MacStout and all the MacTatties watched as he looked at the tractor.</p><p>They watched as he poked and prodded. They watched as he scratched his head. They listened when he said, ‘It will cost £100 to fix.’</p><p>‘£100!’ Farmer MacTattie, Mrs MacTattie and the little MacTatties shook their heads.</p><p>‘We don’t have £100. What will we do? The field needs ploughing and the potatoes planting.’ Farmer  MacTattie thought for a moment then declared, ‘I’ve got it!’ so loudly he made Mrs MacTattie and the little MacTatties jump ‘MacStout can pull the plough!’.</p><p>Dot, Mrs MacTattie and the little MacTatties watched as MacStout pulled the plough.  He pulled the plough a few steps tripped over a stone and slipped.</p><p>‘Are you okay?’, Farmer MacTattie, Mrs MacTattie and the little MacTatties asked as they ran to MacStout.</p><p>‘Neigh! Neigh!’ MacStout neighed in pain as they helped him to his feet.</p><p>Farmer MacTattie looked at Mrs MacTattie, ‘MacStout can’t pull the plough. What will we do?’.</p><p>‘Moo,’ Dot said standing beside the plough.</p><p>Farmer MacTattie laughed, ‘You’re a cow, you can’t pull a plough!’.</p><p>‘Moo!’</p><p>Mrs MacTattie and the little MacTatties laughed, ‘You’re a cow, you can’t pull a plough!’.</p><p>‘MOOOOO!!’ Dot replied stubbornly.</p><p>‘Well if you insist, I’ll give you a go.’ laughed Farmer MacTattie as he put the reins around  Dot’s neck.</p><p>Dot strained and pulled. The plough didn’t move.</p><p>‘Come on, Dot! You can do it!’,all the MacTatties shouted.</p><p>Dot strained and pulled. The plough still didn’t move.</p><p>‘Breath deeply then put your back into it,’ MacStout neighed, encouragingly.</p><p>Dot took a deep breath and pulled. The plough moved.</p><p>‘Well done, Dot!’ All the MacTatties cheered.</p><p>‘Well done!’ neighed MacStout.</p><p>They were all so excited that they hadn’t noticed, the man by their side until he spoke.</p><p>‘I’ve never seen a cow pull a plough!’, he said taking photographs and asking questions.</p><p>The next day a picture of Dot pulling the plough was all over the front page of the newspapers. Then the farmer from next door and the farmer from over the hill followed by cars and coaches full of people came to look at the cow who had pulled a plough.</p><p>The little MacTatties who had been watching all the comings and goings from their bedroom window, suddenly appeared in the field with a box on which they had painted, ‘A penny a photo’  and placed it by the fence.</p><p>The MacTatties got their £100 and more. The old red tractor was fixed, the potatoes were planted and Dot  got her own plough. MacStout got new shoes.</p>"}