{"title": "Dream Daddy", "author": "Brian Martin", "level": "6 to 8,9 to12,Teen,", "category": "Funny,Illustrated,Modern,Original,", "tag": "", "length": "10 - 15 mins,15 - 20 mins,", "body": "<h2>Illustrated by <a href=\"http://www.shortkidstories.com/aswin-amarnath/\" title=\"Aswin Amarnath\">Aswin Amarnath</a></h2><p>Deirdre sat alone in the passenger seat of her dad’s parked car. She was bored, bored, bored. It was a relief when her phone beeped telling her a text had arrived, which she quickly opened.</p><img src='https://xcx.mdavid.cn/img/01_Panel1_Start_wrk-opt.jpg'></img><p>HAPPY BDAY D. SHARON XX</p><p>She scowled at it and quickly thumbed a response.</p><p>THX SHAR @ LEAST SUM1 REMEMBRD. DEIRDRE</p><p>Her dad’s jacket lying across the back seat struck her attention. Reaching back to it, she felt her way through all its pockets. She found what she was looking for – her dad’s credit card. Serves him right, she thought. She looked around guiltily, then stuffed it into her purse. She jumped out of the car.</p><img src='https://xcx.mdavid.cn/img/02_Panel2_CardStealer_wrk-opt.jpg'></img><p>The moving crowd of Saturday shoppers carried her along towards the main shopping area. She passed a shop window that caught her eye. It displayed a large poster of a kindly-looking man’s face. Her curiosity made her to stop and examine the words underneath:</p><p>Your OWN father figure – Yes, YOUR OWN DREAM DADDY</p><p> And at DREAM Prices – a lot less than you think!</p><p>Don’t delay – Visit Dream Daddies TODAY</p><p>Deirdre paused for a moment and stared open-mouthed at the poster. She considered what to do. An impulse led her to push the door open and enter. Why not? she thought. She knew she looked older than she was. The bell rang out as the door closed behind her.</p><img src='https://xcx.mdavid.cn/img/03_Panel3_Dreamdaddyshop_wrk-opt.jpg'></img><p>She approached the counter. A young well-dressed man appeared from a hidden area behind it. He was wearing a glossy-looking suit with a pink spotted tie. His hair was greased flat from front to back.</p><p>“Good morning,” he said, “my name is Frank Stitch. Welcome to Dream Daddies. How can I help you this fine morning?” He smiled, showed off a perfect row of gleaming white teeth. Frank wondered if she was old enough to be here on her own, but thought better of asking. Sales were slow and he needed all the business he could get.</p><p>“I just noticed the poster in the window,” said Deirdre.</p><p>“Great. Wonderful. Fantastic! And your name is?”</p><p>“Deirdre. Deirdre Deering.”</p><p>“Great. Wonderful. Fantastic!” he repeated.</p><p>“How does it work?” she asked.</p><p>“It’s quite simple, Deirdre,” replied Frank. “We have a huge selection of programmable father dummies in the warehouse out back. The dummies are all base-programmed with different personalities. No two dummies are ever the same. Otherwise it wouldn’t be natural. However, they can also be changed if you have any special requests.”</p><p>Frank searched into her eyes and saw her imagination being captured by the idea.</p><p>“We simply take your requirements. We match them with the dummy personality profiles available in the warehouse. Once we have identified a matching dummy, we do the final programming. We load him up with your relevant information. Strong traces of his original personality programming will remain. We can, however, customise somewhat. You don’t have to make your final decision until you meet him. Then you sign a contract, pay the setup fee and take him home. It couldn’t be simpler, Deirdre.”</p><p>“How much?” asked Deirdre, her eyes as wide as the moon.</p><p>“What price fatherly perfection, Deirdre? You can have your very own Dream Daddy from only two thousand setup fee plus two hundred a month. For a small fee, we can also program annoying habits in from time to time. We find it makes things more, realistic so to speak.”</p><p>“How long does it take?”</p><p>Frank went in to close the sale. He was often told he was a great closer. A salesman is trained to close the sale.</p><p>“The process is completely computerised. We narrow down to the ideal match. Then we program immediately with your details. All the dummies have their brains connected to our network. We can do the programming from here in a matter of minutes.”</p><p>Deirdre took a step back. She was astonished that she could leave the shop with a new father so quickly and conveniently.</p><p>“Let’s do it!” she cried.</p><img src='https://xcx.mdavid.cn/img/04_Panel4_Salesman_intro_wrk-opt.jpg'></img><p>“Great. Wonderful. Fantastic!” said Frank as he smiled one of his shiny smiles once more. He stepped out from behind the counter and put his arm around her shoulder. “Let’s move to the programming suite immediately.”</p><p>Deirdre could feel her heart beating in her chest as Frank led her through a door at the side of the counter. The entered a booth with a computer terminal where they both sat down. The booth had posters of all manner of fathers with their children all around it. Father on a boat with the kids. Father camping in the sunshine by a river. Father giving a piggy-back. There was even a father playing with his daughter’s dollies and laughing his head off. Everyone was smiling. The fathers, the mothers, the daughters, the sons, the grandparents, even the dog in one picture appeared to have a large grin on his face.</p><p>“OK,” said Frank. “We’ll start to narrow it down based on your preferences.”</p><p>Frank typed in Deirdre’s name and clicked on START. A message appeared on the screen.</p><p>3598 DUMMIES AVAILABLE</p><p>“Let’s go find your dream daddy,” said Frank, grinning at Deirdre. “Give me your first preference. Whatever comes into your head first is best.”</p><p>“Does not perform long belches at the dinner table,” said Deirdre without a moment’s hesitation.</p><p>Frank looked at her. “You mean accidentally or on purpose?”</p><p>“Not at all. I can’t stand all that when I’m trying to eat. He thinks it’s funny. Er, I mean it’s not funny when they do that, I imagine.”</p><p>“OK,” said Frank. He typed in “Does not belch at dinner table.”</p><p>The screen went blank and then appeared with the message:</p><p>2435 DUMMIES REMAINING</p><p>“Mmmm, that seems to have narrowed it down quite a bit. It seems burping performances are more common than I would have expected. Still, no worries, still plenty of choice left. What’s next?”</p><p>“Hates watching sport on television or in pubs,” she spat.</p><p>Frank shrugged and typed in the instruction. The computer returned its answer:</p><p>362 DUMMIES REMAINING</p><p>Frank started to mop his brow and turned to Deirdre.</p><p>“That rules out quite a few, Deirdre. Make sure now you mention the most important criteria first. The field has narrowed quite considerably already.”</p><p>“Never gets annoyed and shouts at their daughter, spit flying everywhere so that it sprays into your face and gets in your eye.”</p><p>Frank raised an eyebrow as he typed in the command. “As you wish,” he commented.</p><p>353 DUMMIES REMAINING</p><p>“Ah, not too many of those, thank goodness!” commented Frank.</p><p>“Always lets me watch my programmes on TV whenever I want, even if his favourite show is on and gives me the best place on the couch.”</p><p>“As any decent dad would,” said Frank clicking furiously on the keyboard.</p><p>11 DUMMIES REMAINING</p><p>“Now we’re getting places,” cried Frank.</p><p>“Would never forget my birthday,” replied Deirdre. Her face was set.</p><p>Frank turned back to the keyboard and entered the command. The reply was instant.</p><p>5 DUMMIES REMAINING</p><p>“Well, well,” said Frank. “Quite a few forgetful ones I see. That was fast. I’ve never seen the numbers come down that quick before. Still, we have five matches for you. Want to limit further? I can’t guarantee that anything else you ask for won’t rule them all out.”</p><p>“Not a fat one,” said Deirdre. “I can’t stand the way he…, I mean I couldn’t stand a slob that lies around all day.”</p><p>Frank entered “Not fat” and pressed ENTER.</p><p>1 DUMMY REMAINING. PERFECT FIT SELECTED.</p><p>PROCEED TO DUMMY PROGRAMMING?</p><p>Frank smiled at Deirdre. “Great. Wonderful. Fantastic! I think we found your man. Next stage is to proceed to program him with all your details. First I’ll take your photograph so he’ll recognise you. Then you enter information about yourself so he’s aware of the important details of your life.  Say CHEESE!”</p><p>Deirdre smiled as Frank used a camera attached to the unit to take her picture. Then he clicked on the keyboard and offered it to Deirdre to start typing the information.</p><p>“Call for me when you are ready,” he said as he left the cubicle.</p><p>After thirty minutes of furious typing Deirdre pushed the keyboard away and sat back.</p><p>“OK, I’m finished!” she cried out. Frank appeared almost instantly.</p><p>“That was great!” enthused Deirdre. “I told him all about my first day at school and about how I came first in the class in Home Economics and how I always wanted to be a ballerina when I was small and – ”</p><p>“Great. Wonderful. Fantastic!” interrupted Frank. “That’s exactly what he needs to know. Now tell me, there are a couple more options. Would you like him Strong Silent, Standard Warm-hearted or Super Sentimental?”</p><p>“Super Sentimental please,” replied Deirdre without a moment’s hesitation.</p><p>“OK, great, that’s done. Now, finally, we find it useful if you both do something together straight away. To complete the bonding so to speak. So we’ll program him with an idea so he thinks it comes from himself. Anything you would fancy doing with him this afternoon?”</p><p>“To the movies and then go for a pizza!” giggled Deirdre with delight.</p><p>“Not a problem,” replied Frank. “Let me input the last few instructions and … there! All done. Now, let’s go to the meeting bay, he’ll be ready in just a few minutes.”</p><p>Just as they arrived at the door to the bay, out came a large middle aged man. He was holding the arm of an elderly gent with a walking stick and sporting a bandage around his head.</p><p>“C’mon pop,” said the man, “where’d you like to go now?”</p><p>“Let’s get us a couple of chocolate sundaes,” he replied. “My treat, I want to hear all the gory details about your flower-arranging championship win. I’m so proud you retained your title, son.”</p><p>“Your call, pops, sounds great. I’ll take you home later and give you a nice bed bath.”</p><p>“Ah, you’re too kind, I don’t deserve you.”</p><p>Deirdre and Frank entered the room. They sat down to wait in front of a closed double door underneath a screen displaying:</p><p>DEIRDRE DEERING’S DREAM DADDY WAIT TIME IS 4 MINUTES</p><p>Deirdre fidgeted with excitement while the minutes counted down.  Her eyes were glued to the screen. Three minutes. Two minutes. One minute. The last minute felt like hours.</p><p>Finally, the doors opened. In walked a tall, lean man with a bandage around his head. Comfortably dressed, he was wearing a checked jacket with leather elbow patches and casual trousers. As soon as he saw Deirdre, he smiled and walked over to her with arms outstretched.</p><img src='https://xcx.mdavid.cn/img/05_Panel5_RoboDad_entry_wrk-opt.jpg'></img><p>“Deirdre, princess, it’s so great to see you. You look wonderful. Come over here and give Daddy a great big hug.”</p><p>Deirdre stood up and received the embrace. She closed her eyes and tried to hold back the tears as she hugged him.</p><p>“So, Deirdre, what does my birthday girl want to do today? How about a movie and then Pizza Palace? We can take it from there. No pubs though – you know how I feel about pubs. And they’re full of noisy louts in shiny-coloured jerseys glued to TV screens showing equally stupid men running after balls in big fields. Ridiculous. Maybe after the pizza I could take you and buy you an extravagant dress for your birthday? Please?”</p><p>Deirdre looked him in the eye and said “Movie and pizza would be great dad, thanks. And there is this dress in “The Ridiculous Expense Dress Company” – the designer section – that I’ve been dreamin’ about for months.”</p><p>“Thanks, Deirdre, it would make me so happy to get it for you.”</p><p>As they were leaving, Frank raised an eyebrow to Deirdre. He slid a contract and a credit card terminal to Deirdre. She took out the stolen credit card from her purse, put it into the device and entered the pin number that she had memorised from the past. Finally, she half-glanced over the contract and scribbled a signature. She shook hands with Frank.</p><p>“Great. Wonderful. Fantastic,” he whispered.</p><p>They headed for the exit. Dream Daddy stepped forward and opened the door for her.</p><p>“I’m so excited we’re going to spend quality time, Honey-kins,” he said as she stepped out.</p><p>On the street, she looked around nervously as they linked arms and headed in the direction of the Savoy cinema. They only got a few yards, when she heard a shout behind her.</p><p>“OY! There you are! You little cheeky good-for-nothing! I told you to stay in the car while I was in the betting office!” This was followed by a long, loud belch.</p><p>Her heart sank. They both turned around and saw him standing ten yards back. He was middle aged, unshaven, with a glossy red jersey clinging to his oversized belly. His tummy looked like a bowling ball had been stuffed under the front his shirt. He noticed the man attached to Deirdre’s arm.</p><p>“Who is THAT?” he exclaimed. “And what’s he doing on your arm?”</p><p>He started to stride towards them, his face hard and furious. Dream Daddy slipped behind Deirdre. He put his hands on her shoulders.</p><img src='https://xcx.mdavid.cn/img/06_Panel6_Confrontation_wrk-opt.jpg'></img><p>“I have no idea who you are,” he called over her shoulder towards the angry man. “But I insist you do not speak to my daughter in that manner. Your language is not appropriate in front of a young lady. If you do not desist, I will have no option but to contact the authorities.”</p><p>The approaching man stopped. He gaped for a moment with his eyes wide open.</p><p>“YOUR daughter? Are you mad? I’m Pat Deering and that’s MY daughter you thick oaf! Are you some sort of sugar daddy? Get your hands off my girl, NOW!” Spit sprayed out of his mouth and all over their faces.</p><p>“Cover your ears, his tone is quite aggressive,” cried Dream Daddy, crouching lower behind her.</p><p>Just then, Pat turned and looked at the shop.</p><p>“Dream Daddies, I heard of that. Isn’t that the place where they turn dummies into….bloomin’ heck Deirdre? Just wait till I get my hands on you. And where did you get the money to pay for……Mother of Divine Mercy Deirdre, my credit card! I couldn’t find it anywhere. I usually keep it in my jacket pocket and it was gone. You little…..”</p><p>He charged towards them. Dream Daddy pushed Deirdre at Pat and then tried to run back to the shop by circling around him on the road. He never saw the truck coming. He was bounced into the air and landed in a heap next to them.  As people started to gather in shock, he started to twitch violently on the footpath, gibbering. Wires and electronics tumbled out from the back of his head.</p><p>“Movie love? Wanna catch a movie love? Movie? Pizza? Movie and a pizza love? Movie? Pizza, Movie? Pizza? Movieeeeeeeeeeeeee Pizzaaaaaaaaaaa Movieeeeeeeeee Pizzaaaaaaaa ….”</p><p>Finally in one last gasp, he went silent and then limp.</p><p>Deirdre knelt on the pavement beside him. She broke down in tears as she stroked his forehead.</p><p>“Perfect, he was!” she cried. “Absolutely perfect!”</p><img src='https://xcx.mdavid.cn/img/07_Panel7_Sad_Dierdre_wrk-opt.jpg'></img><p>Her father approached. “Why did you do it?” he replied, sobbing. “Deirdre. How could you? I am your true dad!”</p><p>“Why do you think?” roared Deirdre. “You’re a useless slob of a father who never does anything nice. You didn’t even remember my birthday today!”</p><p>He hesitated, his brow creased. “You never said it was your stupid birthday,” he replied. “How was I supposed to know?”</p><p>“You’re my dad, I’m not supposed to have to remind you! I’ve had it with you, you are no longer my dad, ok? You’re fired!”</p><p>Pat’s mouth opened and closed like a fish in a tank, shocked by his daughter’s words, casting him away. He looked to the ground and scratched around with his toe.</p><p>“Your man. The dream daddy. Did you really like him better than me?”</p><p>“He was brilliant, yeah,” replied Deirdre. “He was taking me for pizza after the movies. He was begging me to buy me a dress. An expensive one.”</p><p>A silence ensued. Pat looked at his daughter with doggy eyes, full of hurt.</p><p>“Well, he was a bit of a chicken alright,” she continued.</p><p>Another silence ensued.</p><p>“Movies and pizza, eh?” he asked.</p><p>“Forget it, it’s too late now.”</p><p>“Ah c’mon, I wouldn’t mind it myself anyway. What d’ya say? I heard Top Killer is excellent.”</p><p>“No way. I want to see Handsome Prince Love Story 2 – After the Wedding.”</p><p>“Ah no, what d’ya want to see that rubbish for? I’d have to bring the sick bucket.”</p><p>Deirdre threw her head on her dream daddy’s chest and started to sob.</p><p>“Alright, alright, just turn off the Niagra Falls. For goodness sake.”</p><p>Deirdre stood up.</p><p>“You don’t care about me!” she cried. All you care about is your stupid football and getting the longest belches possible at the dinner table! You’re a lazy slob, dad. God only knows what my poor mum saw in you. If she was alive now she’d be turning in her grave.”</p><p>“Look!” cried her Dad. “See this.” He flung his wallet at her. She caught it before it tumbled to the ground. She looked at her dad and then opened it up. Inside she found a picture of herself as a small girl.</p><p>“See?” he said. “I carry your silly picture around everywhere! Ever since your mum died I never knew what to do with you. What do I know about girls? I didn’t have any sisters. I spent the first few years of your life trying to teach you to talk and the next ten trying to get you to shut up! But Deirdre, whenever I look at that picture in my wallet, I feel really proud of you, so I do. I just never knew how to tell you. I guess I luh…I guess I luh….”</p><p>Pat stopped and gathered all his strength.</p><p>“Ah Deirdre. Don’t you know  I love ya? Please, let me still be your dad?”</p><img src='https://xcx.mdavid.cn/img/08_Panel8_Reconcilation_wrk-opt.jpg'></img><p>Deirdre looked at him in amazement. She stared for a moment before replying. A half-smile crept onto her mouth.</p><p>“You had me at ‘I carry your silly picture’, Dad.” She approached him. She tried to hug him, but her arms only reached half-way around his stomach. He replied by flopping his arms from side to side and then finally putting them awkwardly around her.</p><p>“OK, let’s go to the movies so,” she said. “Then pizza.”</p><p>“Not so quick, after the match, right? It’s the cup final, I need to see that one. I have a bet on. Then the movies. Then pizza. I promise.”</p><p>Deirdre raised her eyes to heaven and thumped him in the shoulder. She looped her arm in his as they walked back towards the car.</p><img src='https://xcx.mdavid.cn/img/Dream-Daddy-characters_v2-opt.jpg'></img>"}