{"title": "Duet in B Flat", "author": "Shelly Kerker", "level": "6 to 8,9 to12,Teen,", "category": "Funny,Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>One dismal November morning, Tiffany Sliwak woke to find that her father had forgotten to do the laundry.  So she sifted through the pile of dirty laundry that sat on the floor in the hall and, sniffing tentatively, chose a sweater that didn’t smell too bad.  Then she pulled on some jeans, grabbed some Cheetos from the counter and took a long swig of Diet Coke before going out to meet the school bus that was pulling up in front of 226 Hayes Street.</p><p>Tiffany had lived with her father in the basement of 226 all of her life.  Her dad, who was the janitor of the building, spent his days tending to the boiler, fixing the plumbing and electricity, dealing with trash and snow and vermin, and listening to unending complaints from cranky tenants. And after a hard day of work, he spent his nights drinking beer and partying with his buddies into the early hours of the morning.</p><p>Raising a child, he always said, was never part of my life plan.</p><p>So, at age thirteen, Tiffany was on her own.  She ate food that was mostly fried, salty, and found in a bag left on the counter.  She wore clothing that was usually one size too small, one shade too bright, and one season too late.  She did her homework on a table sticky with the residue of beer, and then she spent her evenings watching reality shows on TV.</p><p>No one paid attention to Tiffany, which was fine with her.  Actually, she preferred it that way.  Until the day that her dad forgot to do the laundry.</p><p> </p><p>On that same November morning, Charlene Wilcox was the first to board the school bus, as she was every morning.  Her home, located in a trailer part on the edge of town, sat right next to the bus garage, so it was the first stop on the morning run.  Charlene had to get up when the sun rose to feed her three little brothers and get them dressed, while her mother tended to the baby.  Only then did she have time to get ready herself – to eat, shower, and style her long, thick, copper-colored hair.  Charlene’s hair cascaded gloriously down to the middle of her back, taking the better part of an hour to blow-dry and straighten every morning.</p><p>With four young children to take care of, Charlene’s mom was too busy to pay attention to her at home.  But at school, Charlene Wilcox ruled – the girls envied her hair and her attitude, and the boys competed with each other for her attention.  Sashaying through the halls, she was followed by an admiring entourage.</p><p> </p><p>When Tiffany boarded the school bus that morning wearing her slightly funky sweater, she walked by Charlene and her friends. As Tiffany sidled by her, Charlene sniffed loudly and raised her thumb and index finger dramatically in the air.  Then, looking directly at Tiffany, Charlene pinched her nose and announced to everyone on the bus, Something stinks.</p><p>Tiffany put her head down and kept walking, hoping no one had noticed.  She tried to avoid the eyes following her through the bus. But as she made her way down the aisle, she couldn’t avoid row after row of snickering kids who scrunched up their faces, pinched their noses, and repeated Charlene’s words: Something stinks. So Tiffany chose a seat in the last row in the corner, hunched her shoulders, and slid down low.</p><p> </p><p>Starting that morning, and continuing for almost two months, the phrase something stinks stuck to Tiffany like superglue.  It started on the bus in the morning, and it followed her around school like a vicious dog snapping at her ankles.  She heard it from the kids in the hall as she walked between classes. She heard it at lunch in the food line, and then again when she sat down at a table.  In her classes, she saw the kids silently mouthing the words, sticking out their tongues and pretending to gag.  And all the way home she heard it on the bus.</p><p>Each evening, Tiffany washed her clothes in the sink with detergent that promised the scent of wildflowers.  Each morning she showered with citrus soap and lathered her hair with vanilla-almond shampoo that smelled good enough to eat.  And she sprayed herself lightly with her father’s cologne from the medicine cabinet before she walked out the door.  Tiffany carried deodorant in her purse and applied it under her arms in the bathroom between classes.  But none of these efforts could stop the gestures or the whispers or the constant humiliation that was now her life at school.</p><p> </p><p>Then, one bright winter morning, Tiffany awoke with a feeling of happiness and anticipation.  It was the last day of school before winter break.  She sat up in bed and smiled as she calculated the time until school was out; three shortened class periods, a holiday concert, and then no more school for two weeks.</p><p>Foraging in the kitchen for something to eat, she discovered a Taco Bell Bean and Cheese Burrito which someone had left out on the counter the night before.  Stuffing it into her mouth, she washed it down with the remains of a cold caramel cappuccino.  Now she was feeling slightly queasy, but she grabbed her backpack anyway, and ran out the door to catch the bus.</p><p>Tiffany’s class fidgeted through first period English, barely able to concentrate on the winter poem or the vocabulary review.  As they filed out of the room, the English teacher, wishing them a happy holiday, handed each of them a milk chocolate Santa, wrapped in foil and slightly melted.  In Math they played an algebra game and got candy canes and green marshmallow Christmas trees for prizes.  In Spanish class, the Senora taught a lesson about Christmas in Mexico and handed out Mexican wedding cookies – rich balls of almond and butter, flavored with ginger and cinnamon, and rolled in powdered sugar.</p><p>Tiffany had been feeling slightly nauseous all morning long, but she dutifully put the treats she was offered in her mouth, chewed quickly, and gulped them down.  The candy and the rich spicy cookie made their way down her digestive system to join the already churning burrito and cappuccino in her stomach, and by the end of the morning Tiffany was wondering if she would make it to the end of the day.</p><p>After classes were over, the kids filed into the auditorium for the concert, their voices ringing at a fevered pitch.  And Tiffany’s stomach started gurgling and growling. She thought about raising her hand and asking for a pass to leave the room.  But she reconsidered when she thought about walking past the rows of kids who would surely be pinching their noses as she walked by. So she sat miserably, clutching her stomach.</p><p>The middle school students sat impatiently in their seats, squirming and looking back at the clock, counting the minutes to when the final bell would release them. They suffered through the principal’s speech and then through the endless holiday songs performed woodenly by the mixed chorus.  By this time, the pent-up energy in the overheated auditorium was palpable.  And the pent-up energy of the Mexican wedding cookie, the Christmas candy and her breakfast was roiling and brewing in Tiffany’s stomach.</p><p>Last on the program was a performance from the school orchestra, featuring Charlene Wilcox on the French horn.  When her turn came, Charlene stood up, and tucking a stray strand of copper-colored hair behind her ear, she strode confidently through the woodwinds, past the violins, to the front of the stage.  Facing the impatient and distracted student body, she waited imperially for the audience to settle down.  When the audience was finally silent, she put the horn to her lips, and began to play her first note.</p><p>It was at that exact moment that Tiffany’s stomach rebelled – loudly and odiferously – the sound ringing through the sudden silence of the auditorium, making itself known to the entire school in the key of B flat, like a foghorn signaling a ship in distress.  There was complete silence in the auditorium as all eyes turned first to Tiffany, and then to Charlene, who was still standing in front of the stage, now holding her breath, her horn poised.</p><p>Tiffany was mortified.  She wanted to hide under the seat.  She felt like she was going to cry.  But instead of crying, she started to giggle nervously. Then she began laughing uncontrollably – big big, loud guffaws – which set off yet more blasts of flatulence.</p><p>The other students were first startled, then delighted. They burst into wild laughter, while Charlene stood frozen in place, horn at her mouth, too shocked to move.</p><p>By then the teachers had lost control of their classes, and when the bell rang, the kids ran for the door and exited the building, still laughing as they poured into the snowy schoolyard to freedom.</p><p> </p><p>The story of Charlene Wilcox’s French horn solo became a school legend.  The kids never got tired of retelling the story of how Charlene’s solo unwittingly became a duet.  For years after that, when Charlene walked to her seat on the bus, when she went through the halls of the school, when she sat in class, or took her seat in the cafeteria, the kids would bring an imaginary horn up to their lips and blow, making an all too identifiable sound.  Then they pinched their noses, looked at each other and snickered.</p><p>And, although she knew she shouldn’t, the one who laughed the loudest was Tiffany.</p>"}