{"title": "An Eel in the Aquarium", "author": "Dulce Rodrigues", "level": "3 to 5,6 to 8,9 to12,", "category": "Funny,Modern,Original,True,", "tag": "Eel,Fish,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/eel-in-the-aquarium-optimised.jpg'></img><p>(A true story)</p><p>This is a story of the time I was still a young girl and had a funny pet fish : an eel ! Yes, it was indeed an eel. As you might know, eel stew is a culinary delicacy in Portugal, and my parents love it. My mother and one of her friends went then one day to the market to buy eels.</p><p>My friend Gracie and I, we had accompanied our mothers, and we had noticed that two of the eels were still alive! When we arrived home we hurried to find out how they were doing. To our great surprise, they were still alive!</p><p>We asked if we could keep them, and each of our dear eels was placed in an aquarium, those small round ones you sometimes get for goldfish. After all, eels are fish too, we can’t forget that.</p><p>Taking care of even one eel in a small aquarium is no easy chore… and my new friend had meanwhile grown bigger than a goldfish!</p><p>I then transferred my eel to a new, larger aquarium that my mother had bought for just that purpose, and my friend Gracie did the same with hers. We fed them with fish food and watched them grow bigger and more beautiful!</p><p>But, the most surprising, was the way my eel friend would act when it heard my voice. It is hard to imagine how a fish – whether it is an eel or any other type of fish – can recognize a familiar voice and pop its head out of the water as if to say hello.</p><p>Well, this is exactly what my naughty eel would do! Whenever I would arrive home and say something, it would swim around the aquarium, head out of the water, until I went over to greet it. It did not behave like this with anyone else. It was as if it knew I had saved its life!</p><p>One day, my friend had to go away for some time, and asked me if I could care for her eel, which I then put into the aquarium alongside mine.</p><p>Well, the newcomer was not well received! My eel, like a spoiled only child, was jealous of this invasion and wanting to show who was the boss of the aquarium, bit the intruder.</p><p>The poor creature carried the bite mark for the rest of its life, but happily for all, they were now able to get along and live in peace. This was a good thing because my friend was no longer able to take care of her eel and gave it to me.</p><p>The years passed and the two eels had grown enormous. This caused some problems when changing the water in the aquarium; their long slippery bodies kept me from picking them up with the net, as I would with a smaller fish.</p><p>I had to change the water with them still inside. I did this delicate process very carefully, but one day, one of the eels escaped down the drain.</p><p>Seeing my sadness, my father tried to console me, telling me that it was the best thing that could have happened to it, since now it would go down to the river, which is where it had come from. My father was right, and I knew I should give the other one its freedom, too.</p><p>And so I did. A few days later I put it into the river, just a few kilometres from our house.</p><p>But I would always remember fondly my lovely eels! And I hope you’ll as well remember this story.</p>"}