{"title": "Ella the Rabbit", "author": "Rebecca Elbert", "level": "3 to 5,6 to 8,", "category": "Fable,Instructional,Modern,Original,", "tag": "Rabbit,", "length": "01 - 05 mins,", "body": "<p>There once was a rabbit named Ella. Ella was a gorgeous rabbit who was the perfect shade of snow. She lived in a large rabbit city buried deep in the forest. The forest was full of beautiful flowers, and towering trees. Ella and her family were the only rabbits who were white in color. Many other rabbits envied Ella’s color and her perfect rabbit ears, eyes, and nose. However, Ella did not consider herself to be a gorgeous rabbit, and often complained about her appearance. When she looked at herself in the mirror she saw an abundance of rabbit fur and sloppy ears that did not sit up straight. She didn’t think she looked normal, or like any of the other rabbits in her city. Ella often voiced these thoughts to other rabbits and they would all reassure her that she was indeed a flawless rabbit.</p><p>One day Ella was hopping around the forest for her morning hop when she noticed a stream running beside her. She stopped at the stream and looked at her reflection. She sighed and wished that she could have a different color fur. She didn’t see herself as different and unique. Instead she saw herself, as odd and unattractive. She wanted to be tan like most of the other rabbits that lived in her community. She then decided that she was going to do everything in her power to change her appearance.</p><p>As Ella was finishing her hop she kept thinking of the ways she could change herself. She had already cut her diet of carrots and lettuce greens in half, even though her mother told her to keep eating more. She also started extending her morning hop an extra thirty minutes in order to loose some more of her rabbit fluff. But, she still wasn’t satisfied with her results. So she decided she was going to dye her white fur in hopes of making it a tan color. Ella believed that this would fix all of her problems. She thought that if she dyed her hair, she would be more like the other rabbits that lived in her city.</p><p>Ella went down to the local Bunny Fur salon to talk to a stylist named Sue. When Ella told Sue of her plans she advised Ella against her choice. She told her that bunnies with white fur were rare. Sue also explained to Ella, that often when white fur is dyed it becomes ruined. Ella didn’t believe Sue. When Ella left Sue’s shop she decided that she was going to go against Sue’s advice. She was going to try to dye her fur herself.</p><p>Ella stopped at the local bunny herb store and picked up a box of fur dye and went home to perform the instructions. After coating herself with the brown die she waited the amount of time the instructions stated and then washed it out. Ella quickly hopped over to the mirror to see her results. When Ella looked in the mirror, she screamed, instead of having brown fur she had purple.</p><p>Ella quickly hopped down to Sue’s shop, only to find out that Sue couldn’t help her. Sue explained that Ella’s fur could not be dyed back to white. The only thing Ella could do was to wait until her fur grew out. Sue then could cut the purple color out of Ella’s fur. This was the only way Sue could fix Ella’s fur.</p><p>Ella was forced to grow out her fur and wait until the day she could cut it. At first she hid in her room embarrassed of what she looked like, but in the end she gained the courage to walk outside and face her peers. She learned that no one cared what she looked like. That even though her fur was purple, her friends still talked to her and treated her just the same. They even commented on her fur, and how they thought it was unique.</p><p>Ella waited five months until she was able to cut the purple color out of her fur. Once the color was out, Ella did not try to color her fur again. Instead, she started to accept who she was. She soon learned that she did not have any flaws, and she was just like all the other bunnies in her city. In the end Ella learned that she needed to accept who she was and to listen to what others told her and to love herself.</p>"}