{"title": "Empty Pockets", "author": "Jan Fenimore", "level": "6 to 8,9 to12,Teen,", "category": "Mexican,Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>Antonio stood in the doorway of his family’s casa. He felt the coolness on his back coming from inside the cliff hut and the warmth on his face coming from the late summer sun. He watched as Papa set off to meet other men in the village square. The men traveled north for a long distance race. The prize money made the trip worthwhile.  Being the best long distance runners would win them the respect of the village.</p><p>“Adios, my son.”  Papa called over his shoulder. “If my huaraches hold together I will return with enough pesos to buy food for the winter. Pray for me, Antonio.”</p><p>“Adios, Papa. I will.”</p><p>Antonio thought of his father running down deer until the animal could run no more. But then he had good shoes. He thought of the 100 mile race far away in the Colorado Mountains. A race any of the Tarahumara Indians of his Mexican tribe could win. His father ran the fastest of all. But then he had good shoes.</p><p>Antonio needed new huaraches too. His thin leather straps might break at any time. The tire tread used for soles had worn thin. He couldn’t trust his worn shoes to race the village boys. They might fall apart when he took their three goats to graze in the Copper Canyons where they lived. He certainly couldn’t walk the five miles when school started. He had to do something, but what?</p><p>He turned his pantolones pockets inside out.</p><p>He could buy a tire from the tire man but they cost many pesos. The family had few pesos and he knew Mama needed what they had for beans, flour and oil. The corn, squash and beans growing in their fields had dried out under the hot summer sun. Little rain had fallen this year. No crops meant a winter with little food.</p><p>If he earned the pesos to buy tire tread, his family could have new shoes. His father would then be able to walk to other villages to look for work.</p><p>The next morning Antonio rubbed the sleep from his eyes, pulled on his clothes and tied the leather thongs holding his huaraches together.</p><p>“I’m taking the goats to graze, Mama. The grass is dry near here. I’ll have to walk farther today.”</p><p>“Why not try down by the river?” Mama said. “The grass will be green as long as water flows. It is a long way. I hope your huaraches will hold together.”</p><p>Antonio hoped so too. “I’ll take the goats to the river and be home by sunset.”</p><p>He whistled as he followed the goats down the mountain. Grazing on green grass would be a treat for them. It would be cooler by the river too.</p><p>As the goats grazed Antonio decided to cool off in the shallow water. In the clear river he saw small fish swimming. Maybe he could catch some. But he had no net. No fishing pole. How could he do it?</p><p>He found a stick on the river bank and whittled a point with a sharp rock. Perhaps he could be quick enough to spear the fish. He and Mama would feast tonight.</p><p>He tried and missed. He tried again and missed. Then Antonio tried thinking like a fish and caught one after another, throwing them up on the bank. As the sun edged toward the horizon he wrapped the fish in his shirt, rounded up the goats and headed for home.</p><p>“Mama, look how many fish I caught. Our stomachs will be full all week.”</p><p>“Muy bien, nino. We have been blessed.”</p><p>The aroma of the fresh fish frying made Antonio’s mouth water. “I’ll catch more tomorrow and maybe we’ll have enough to sell.” he said.</p><p>“I’ll smoke the fish. We need the pesos.” Mama said.</p><p>Antonio caught more than enough fish for supper each day. Before long they had ten smoked fish to sell. Just before Antonio set out for the market someone knocked on the door.</p><p>When Mama opened it a Tarahumara Indian tipped his hat. Antonio saw a woman and six children under a tree.</p><p>“Please forgive me, Senora. Do you have food to spare for my hungry family?” the man asked.</p><p>Antonio started to answer but Mama hushed him. “As is the code of our people we must feed those who ask. We can spare ten fish and some fresh tortillas. Feed your hungry family and drink water from our well.”</p><p>“Bless you, Senora. Gracias. My children won’t go to sleep hungry tonight.”</p><p>When the family left, Antonio complained to Mama. “I planned to use the pesos to buy tire tread for new sandals.”</p><p>“I know, my son. But we must follow the code of our people. Are our feet more important than hungry children?”</p><p>Antonio hung his head. Mama was right.</p><p>The next day while Antonio fished he watched a lame man leading three horses toward the river.</p><p>When the man saw Antonio he shouted. “Nino. Would you wash my horses if I pay you? I have a man in the next village who promises to buy them. I can’t pay you until I sell the horses, but I’ll meet you back here in three days.”</p><p>“Yes, I can help you.” Washing horses would bring him the needed pesos even if he had to wait. Antonio knew he could trust the man. The code of the Tarahumara would not let them tell a lie.</p><p>Empty pockets again.</p><p>No new shoes.</p><p>On the way home, Antonio noticed the nopales cactus brimming with red</p><p>pears. If he picked enough his family would have some to eat and some to sell. Maybe he could buy the tire tread after all.</p><p>With his shirt loaded with pears he walked to the village market square. Not a soul remained at the day’s end. No sellers or buyers. Selling the pears would have to wait.</p><p>Empty pockets again.</p><p>No new shoes.</p><p>When he approached his family’s hut he saw Papa’s satchel lying on the ground.  Maybe Papa had won the race. Maybe it didn’t matter that Antonio had empty pockets.</p><p>He saw Mama kneeling in front of Papa applying aloe vera to blisters on his feet.</p><p>“Papa, did you win the race? Will we be able to buy tire tread for new sandals?”</p><p>“We don’t need to buy it now. Get my satchel. It’s full of tread I got free in Colorado. Enough to make new huaraches for us and more to sell.”</p><p>Antonio told Papa how he tried to earn money for new sandals and showed him his empty pockets.</p><p>In the race Papa came in third because he had been running in new huaraches that gave him blisters. But with that prize money, selling the pears and tire tread and washing the horses they would have enough to last for a while. Papa would have new shoes to look for work and Antonio could go to school. Making it to the next harvest seemed easier.</p><p>No more empty pockets.</p>"}