{"title": "The Fairy Ring", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>A little old man with a violin tucked under his arm shuffled down the attic steps and the many flights of stairs until finally he reached the streets.</p><p>As he shuffled down the street, he clutched his coat tightly about his throat, for the air was chill and he felt the cold.</p><p> </p><img src='https://xcx.mdavid.cn/img/025.jpg'></img><p> </p><p>At the first street corner he stopped and placed his violin to his shoulder to play, but catching a glance from the policeman across the street he hastily tucked his violin under his arm and shuffled on.</p><p>He walked a great distance before he again stopped.</p><p>It was a busy corner where hundreds of people passed every few minutes, but when he played no one stopped to listen to his music, much less to drop anything in the tiny tin cup he had placed on the sidewalk before him.</p><p>Tears came to the poor little old man’s eyes; everyone was too busy to stop to hear his music.</p><p>So in the evening when he slowly retraced his steps towards his attic home, his feet were very tired and he shuffled more than he had in the morning. His back humped and his head drooped more, and the tears nearly blinded him. He had to stop and rest at each flight of stairs and he fell to his knees just as he reached the attic door.</p><p>He sat there and rested awhile, then caught hold of the doorknob and raised himself to his feet.</p><p>A quaint little white-haired woman greeted him with a cheery smile as he entered, then, seeing his sad face, she turned her head and tears came to her eyes.</p><p>“Honey!” the little old man sobbed, as he stumbled towards her chair and fell to his knees before her, burying his face in her lap.</p><p>Neither could say a word for a long time, then the little old man told her he had been unable to make a single penny by playing.</p><p>“No one cares to hear an old man play the violin!” he said. “No one cares that we go hungry and cold! And I can still play,” he added fiercely, “just as well as ever I could! Listen to this!” and the little old man stood up and drew his bow across the violin strings in a sure, fiery manner, so that the lamp chimney rattled and sang with the vibrations of the strings.</p><p> </p><img src='https://xcx.mdavid.cn/img/026.jpg'></img><p> </p><p>And in his fierceness he improvised a melody so wild and beautiful his sister sat entranced.</p><p>As the little old man finished the melody he stood still more upright. Then straightening his old shoulders and pulling his hat firmly on his head, he stooped and kissed the old lady and walked with a firm tread to the door.</p><p>“I shall make them take notice tonight!” he cried. “I shall return with success!”</p><p>So again he went down the long flights of stairs and down the street until he came to a good corner where traffic was heavy.</p><p>There, with the mood upon him which had fired him in the attic, he played again the wild melody.</p><p>A few people hesitated as they passed, but only one stopped. This was an old woman, bent and wrinkled, who helped herself along with a cane. She stopped and looked him squarely in the eye and the little old man felt he should recognize her, but he could not remember where he had seen her before, nor was he sure that he had ever looked upon her until now.</p><p>At any rate, the faint memory inspired him and, raising his violin, he played a beautiful lullaby.</p><p>Before he had finished the old woman leaned over and dropped something into his little tin cup.</p><p>It sounded as loud as a silver dollar would have sounded.</p><p>“The dear old generous soul!” the old man thought as he continued playing.</p><p>He played for hours, but the old woman was the only one who stopped. “I will at least have enough to get Cynthia some warm food!” he said, thinking of what the old lady had dropped into his tin cup.</p><p>But when he looked, what was his dismay to see only a large iron ring!</p><p>Again he climbed the stairs to the attic but he felt too weary to say a thing and his sister knew that he had met with disappointment. He tossed the iron ring to her lap and went over to the bed and threw himself upon it.</p><p>“This is the end!” he said, and told her about the iron ring.</p><p>“The old woman seemed interested in my playing!” he said, “And perhaps she gave all she could give!”</p><p>“Let us not be downhearted, Brother!” said the sister. “Surely tomorrow you will find someone who will reward your talent!”</p><p>The little old man was quiet for a long time and then he arose and again drew his bow across the violin strings. The old lady sat very still and dreamed, for her brother was playing one of their childhood songs.</p><p> </p><img src='https://xcx.mdavid.cn/img/027.jpg'></img><p> </p><p>As she lost herself in reverie, she turned the iron ring around her finger and saw upon its surface, as she turned it, the faces of her playmates of long ago.</p><p> </p><img src='https://xcx.mdavid.cn/img/028.jpg'></img><p> </p><p>And as the brother swept from one melody to another, she saw the iron ring change color and grow larger and larger.</p><p>And, as she turned it, she saw the figures of her childhood playmates turn before her upon her lap, and they joined their voices with the silvery notes of the violin’s long ago songs until the attic was filled with the melody and the figures danced from her lap and, taking her by the hand, circled in the center of the attic room laughing and singing.</p><p> </p><img src='https://xcx.mdavid.cn/img/029.jpg'></img><p> </p><p>The little old man had been playing with his eyes closed, but as the songs grew louder he opened them and beheld the ring of little figures, with his sister holding hands with two of them. And, rising from the bed, still playing the childhood songs of long ago, he walked to the center of the room. As he did so, the figures rose in the air and seemed to grow lighter and larger. And suddenly the scene changed! He was out in the woods, with lofty trees towering above him, while all about, laughing and talking, were hundreds of little fairies, gnomes and sprites, and there, too, were the playmates of long ago, just as he had seen them when he had closed his eyes and played in the attic.</p><p>And there, too, was his sister as she had been when a child. He looked at himself, and lo! he was no longer wrinkled and old. He was young again!</p><p>In his gladness he danced with joy, and catching his sister to his breast he kissed her again and again.</p><p>And, looking about him with shining eyes, he again drew his bow across the strings and played a tune so lively and full of sweet happiness the childhood friends caught hands and danced in a circle, and the little sprites, elves, gnomes and fairies caught hands and danced around the children, and as they passed before the brother he caught a mischievous glance from the eyes of one of the little fairies, and he knew in a moment she was the one who had played the old woman, and who had given him the iron ring….</p><p>The people who lived in the room below the attic room missed the little old man’s shuffling step, and, not hearing it for two days, they told the landlady, a kindly soul who had let the brother and sister have the attic room free of charge, and all went up to investigate….</p><p>They rapped upon the attic door. All was quiet within. Timidly they opened the door and looked in. There upon the floor lay an old rusty iron ring. It was the Fairy Ring.</p><p> </p><img src='https://xcx.mdavid.cn/img/030.jpg'></img>"}