{"title": "Fairies in the Flower Garden", "author": "Sharon Krager", "level": "3 to 5,6 to 8,9 to12,", "category": "Fairy Tale,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>My name is Leah, and when I was young and growing up, we had fairies in the flower garden. As far as I know, I was the only one that ever saw the fairies. They would come around me when I was playing in the garden and they kept me company. The number of fairies is still unknown to me, because there were new ones all of the time.</p><p>The house that we lived in was an old brick two story with a large back yard. Since I was an only child, I spent a lot of time by myself out in the flower garden. My Mother always had the prettiest flowers I had ever seen. She got compliments on it all of the time. There were gladiolas, irises, dahlias, marigolds, roses and wild flowers. I helped her keep the garden free of weeds and watered it when it was dry.</p><p>The first time I saw a fairy, I was six years old. I remember it very well. It was late afternoon, school was out for the day, and I went to sit in the garden with one of my little dolls. There was a gentle breeze, the sun was still out, and underneath a large leaf I heard a rustling. I thought it was a spider or a mouse, but this tiny little figure with wings came crawling out. I rubbed my eyes thinking I was seeing things. The tiny winged figure fluttered and rose straight up in the air in front of my face. Its little body was so sweet looking. It was about as big as a humming bird. I wasn’t afraid of it, but it sure did take me by surprise. It never said a word, just flew around me as I sat there playing. At one point it landed on the bench beside me.</p><p>The time I spent there was probably about thirty minutes, and the fairy stayed with me until I stood up to leave. It completely disappeared. As I walked toward the house I looked back several times, but never saw it again that day.</p><p>After that first time seeing the one fairy, I saw them every time I went there and was alone. Sometimes there was only one, other times there were three or four of them. They never made a sound, just stayed with me flying around.</p><p>I told my Mother and Father about them. I even told some of my friends and other family members. No one ever took me serious.</p><p>We lived in that old house the entire time I was growing up. The fairies were a constant companion to me and I enjoyed every minute of it. Since they were with me, I never felt alone.</p><p>When I was around thirteen, I tried to take pictures of them with a camera I had gotten for my birthday. When I took the pictures of them, they never showed up in the pictures. The only thing you could see in the pictures was flowers. I always thought that was strange. It was as if they really didn’t exist. But I knew that they did. It was hard to see them and not be able to convince other people that they were for real. With not being able to take a picture of them, there was no evidence.</p><p>I never wished that they weren’t there. When you grow up with something like that happening to you, you just take it for granted.</p><p>Since I am grown now, and live far away from the place where I grew up, I don’t think about them as much.  I would love to go back there and just sit where the garden was to see if they would come back. I often wonder if other small children living in that house ever saw the fairies like I did.</p><p>The last time I saw them was when I turned seventeen. We sold the house and moved right after that. I do not know what happened to them. They did not appear to me again after that. My childhood would have been so different without the fairies. They were always there for me.</p>"}