{"title": "Fat Noodles", "author": "Wendy Lee Klenetsky", "level": "6 to 8,9 to12,Teen,", "category": "Instructional,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Ivy Melissa LOVED spaghetti and she LOVED chocolate, too.  Boy, did she love spaghetti and chocolate!</p><p>If she COULD, she’d eat them EVERY DAY.</p><p>The only spaghetti she’d eat was the “regular” kind: long and stringy.  The only chocolate she’d eat was chocolate kisses.</p><p>No other kinds would do.</p><p>One holiday, when her relatives visited her, Mother made a big fancy meal: lasagna, salad, soup and chocolate cake.</p><p>When everybody sat down to eat this beautiful-looking lunch, Ivy Melissa asked to be excused.</p><p>“Why don’t you want to eat, Ivy Melissa?” her aunt asked.</p><p>“I don’t like that lasagna thing or that cake either,” Ivy Melissa answered.</p><p>“But you LOVE spaghetti and chocolate, don’t you honey?” Mother asked.  “Lasagna’s really only FAT NOODLES and so is the cake; it’s only chocolate in another form. Try it. I’m sure you’ll like it.”</p><p>But Ivy Melissa wouldn’t eat anything.</p><p>“I HATE these things.”</p><p>“Well young lady, if you won’t eat, you might as well just go to your room,” Dad said. “Come back to the family when you’re ready to eat and behave yourself!”</p><p>So Ivy Melissa skipped lunch because she didn’t believe what Mother told her: “Lasagna’s only FAT NOODLES.”</p><p>At suppertime, after everyone left, Dad said “Ivy Melissa, tomorrow we’re going to the spaghetti factory and the chocolate factory, where you’ll WATCH them make spaghetti and chocolate.  Maybe THEN you’ll believe what Mother said.”</p><p>And so they went.</p><p>First to the spaghetti factory: Here Ivy Melissa was led through different rooms where flour was made into dough, and then pushed through the machines which made different forms of pasta. (spaghetti.)</p><p>“Look Daddy, there’s MY spaghetti; nice and long.  But there are also LOTS of OTHER shapes of spaghetti coming out of the SAME MACHINE. They ALL come from the SAME DOUGH, right?”</p><p>“That’s right, Honey. The dough which made YOUR spaghetti also made that lasagna and those other shapes.</p><p>“Now I see Daddy. FAT NOODLES.  All lasagna really is, is FAT NOODLES. But what about the chocolate cake?  Is that the same chocolate as in chocolate kisses?”</p><p>“Well I guess you’ll have to see that for yourself, too. Let’s go to the chocolate factory.”</p><p>So off they went…</p><p>Here they saw cocoa beans mashed into powder and mixed with other liquids and pumped into different shaped openings.  Some turned out to be kisses, and some chocolate bars.  There was also a pipe which kept the powder of the cocoa beans as a powder and pushed it into boxes for cake mixes and puddings.</p><p>“Look Daddy. All of these DIFFERENT kinds of chocolate things came from the SAME cocoa beans.  I guess they’re ALL FAT NOODLES.”</p><p>“That’s right, Ivy Melissa.  Now, just because some kinds of foods and things LOOK different, INSIDE they’re basically all FAT NOODLES.”</p><p>“I understand now, Daddy, and I guess you can say the same thing about PEOPLE.  Even though people are different colors, shapes, sizes and religions, we’re all STILL PEOPLE.</p><p>We’re all FAT NOODLES!!!”</p>"}