{"title": "Flying Piglets and the Big Bad Wolf", "author": "Jorge Claudio", "level": "6 to 8,9 to12,", "category": "Fairy Tale,Instructional,Modern,Original,", "tag": "Pig,Wolf,", "length": "05 - 10 mins,", "body": "<p>Once upon a time there were three very special little pigs who lived by a nuclear plant.</p><p>One day, as they were walking down the road past the plant, it exploded. The explosion caused chemicals to rise into the sky and land on the three pigs. The pigs were covered with green slime—boy it looked disgusting. This caused them to start running in circles, making them dizzy, and they soon collapsed on top of each other and could not get up.</p><p>Meanwhile, their friend, Hippopatanumus, just happened to be taking his daily jog. He noticed the three piglets and came to save them.</p><p>“Good morning piglets,” he said, and as he saw that the pigs looked a bit hurt, he helped them up.</p><p>“What happened?” he asked. He couldn’t help laughing because they looked ridiculously funny on top of each other. Hippopatanumus helped each of them to get back on their four little pig feet.</p><p>That night, the chemicals on the pigs started to work on their skin, and there was a strong smell of bacon all around. The next day, to their amazement, the piglets woke up with bacon wings on their backs.</p><p>Now next door to the pigs lived the Big Bad Wolf. He was driven crazy by the delicious smell of bacon. He knocked on their door and asked if he could have some. The piglets were frightened and started running around in circles. Before they knew what was happening, they found themselves flying straight out of the window and up into the air. As the wolf knocked and knocked, no one answered. Finally he lost patience and knocked the door down just in time to see the three pigs disappearing out the window.</p><p>“Ah man, they’re gone!” he cried. The wolf left with a frown on his face.</p><p>After some wobbles, finally the pigs found they could fly. They did not make it far though, as they needed more practice. They landed in mud, and they all freaked out and asked each other what had happened. They just stood there with confused faces. Little Piggy was very excited to have wings. His dream had always been to one day fly high into the sky.</p><p>“Oh no, I’m too heavy to fly!” said Fatty Pig. Fatty Pig was depressed.</p><p>Meanwhile, Sleepy Pig was trying to fly, but he was too tired. All he wanted to do was to take a long nap.</p><p>“We need to practice,” said the Little Piggy.</p><p>The three piglets went to the top of the mountain. To get a head start, they ran to the end of the cliff and started flapping their bacon wings. Then, as soon as they got close to the cliff, they jumped into the air and up and away, the piglets were flying! These pigs were all brown – due to the chemical reaction, they looked like delicious apple smoked crispy bacon. It also looked like there was steam coming off the pigs— but oh no, that wasn’t steam, it was the pigs throwing farts in the sky, powering them forward with great thrusts.</p><p>“Oh look, Mama Pig is out there working on her garden,” said Little Pig said to his older brother,</p><p>From above, she looked as tiny as an ant. Well, a fat ant. They flew by her, causing her to lose control of her balance, and as she fell off the steps she was on and ended up rolling all around in the mud.</p><p>“Look, our friend Hippopatanumus!” one of them cried. The three flying piglets flew to their friend and gave him a fright as they landed in front of him.</p><p>“Hey Hippopatanumus! How are you?” they all said to him.</p><p>“Well, I am doing great. Nice wings you got there piglets,” replied Hippopatanumus.</p><p>“Thank you hippo,” said the piglets. “But what are you up to today?”</p><p>“Well not much. As you can see, I’m taking a mud bath here.”</p><p>The pigs decided to join their friend in a mud bath party.</p><p>After they finished taking their mud bath, they said goodbye and flew away. Later, however, they flew back to their friend and asked him a question.</p><p>“Was your dream to fly one day by any chance? Can we carry you?”</p><p>“That is a splendid idea,” replied Hippopatanumus.</p><p>The three pigs carried the huge hippopotamus; they only flew for one mile out and one mile back to bring him back home.</p><p>“Oh boy he was heavy!” they all said to each other once they released him. The Big Bad Wolf decided to sneak by, but the pigs saw him and flew away. Once more the wolf walked away with a frown on his face.</p><p>“I’m getting very exhausted here,” said Fatty Pig.</p><p>“Let’s take a break,” replied Little Pig.</p><p>“What a wonderful idea guys,” added Sleepy Pig.</p><p>“Let’s take a break at the beach,” suggested Fatty pig,</p><p>The other pigs thought this would be a splendid idea. When they flew to the beach, which was called Piggy State Park, the three pigs were the only ones with wings. Every pig asked them where they had gotten their wings.</p><p>“Well, it was an accident,” they said.</p><p>The other pigs made fun of them, saying, “You guys look ludicrous!”</p><p>The Big Bad Wolf just happened to appear on the beach.</p><p>“Oh no the wolf is here!” they chimed in unison.</p><p>All the pigs started running and hiding from the Big Bad Wolf. The wolf was only there for the delicious bacon-smelling piglets, but they had wings so they escaped. When the wolf finally turned around, he noticed that all the pigs were gone. For a third time, he walked away with a frown on his face .</p><p>As the pigs flew back home, they realized they didn’t care what people (or pigs) said about them. At the end of the day, you are your own person (or pig) and as long as you are happy, why should you let other pigs (or people) put you down? Haters will always hate. All that matters is that you are always beautiful in the inside and the outside; you are just a whole different pig (or person) from the rest of them. There is nothing wrong with being different because everybody (or every pig) is different in every way possible.</p><p>When the pigs arrived at their home, the Big Bad Wolf was standing there, so they flew away and carried their mother to another country called Utopia, where everybody is treated with kindness and every single pig cares about you even if they are crazy, ugly, beautiful, or look different from the others. The Big Bad Wolf never did get a chance to eat their wings. He sat down, with that frown on his face again, one last time.</p>"}