{"title": "Frani and the Little Red Fox", "author": "Artie Knapp", "level": "3 to 5,6 to 8,9 to12,", "category": "Illustrated,Modern,Original,", "tag": "Fox,Giraffe,Hippo,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/FranniFox1-opt.jpg'></img><p>Three hippopotamuses were snuggled close together. And they were frightened. A lion sitting close by was, too.  Everything was shaking all around them.</p><p>“Oh no, here it comes!” said one of the hippos.</p><p>An animal with very large teeth soared down from the sky!  It went for the lion, but missed! This was not the first time the animal had made such a visit. In fact, it often came and went without warning.</p><p>“We have got to get out of here,” said another hippo.</p><p>“Yeah, and go where?” asked the lion. “No matter where we go that thing follows us.”</p><p>Then suddenly strange noises could be heard close by! They all feared the worst. But this time, it was simply much friendlier animals that were heading their way. The hippos and lion had never seen them before. The group included several giraffes and one little red fox.</p><img src='https://xcx.mdavid.cn/img/FranniFox2-opt.jpg'></img><p>Like the giraffes, the little red fox felt nervous to be so close to a lion and hippos. But he was a friendly little fox and introduced himself. He soon realized however, that his new friends were more nervous than he was. The hippos and lion were still talking about the animal with large teeth that came down from the sky. And they were surprised to hear that the giraffes and little red fox had never seen it.</p><p>“Ladies and gentlemen, not to fear,” said the little red fox. “What needs to happen here is quite clear.”</p><p>“And what is that?” demanded the lion.</p><p>“We need to stick together,” said the little red fox.</p><p>The little red fox said that by sticking together they could perhaps reason with the animal with large teeth.</p><p>“A little courage goes a long way,” said the little red fox.</p><p>And then everything all around started to shake.</p><p>“Oh my, run for it!” said the little red fox.</p><img src='https://xcx.mdavid.cn/img/FranniFox3-opt.jpg'></img><p>The little red fox ran as fast as he could. He jumped on one of the giraffe’s back as it stood up to run. Then he climbed up its long neck to hide. The little red fox was so scared that he forgot what the hippos had told him and the giraffes: the animal with large teeth always came down from the sky.</p><p>Meanwhile, a grandfather was standing next to his granddaughter as she dropped two coins into a machine.</p><p>“You’ll do it this time, Frani,” said her grandfather. “Just take your time.”</p><p>Frani carefully moved the joystick straight ahead. Then she tapped it twice towards the left. Below were three hippopotamuses and one lion. And sitting right behind them were several giraffes. Those would all make fine new friends for Frani, but it was a little red fox that she longed to take home. Frani moved the claw down towards the little red fox.  And then, she grabbed him!</p><p>As she took the little red fox out of the machine, Frani gave him a big hug. Frani’s grandfather celebrated by taking her and the little red fox out for ice-cream.</p>"}