{"title": "Franklin the Frog", "author": "Sharon Krager", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Frog,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/frog1.jpg'></img><p>Franklin was a very smart frog. He not only knew frog language, he knew people language.  He started out in a small pond behind a house where two little boys lived. Their names were Robby and Ronny. They were twins. The two boys loved to hang out down by the pond. They were only allowed to play by the edge where it was shallow. They played there as often as they could.</p><p>I was a little tadpole when they began coming down to the pond to see me. They waved their hands in the water to get my attention and I would always swim away. They tried to catch me, but they never could. We had a good time. I learned a lot from them.</p><p>As I grew older I became a frog and would jump in and out of the water. One day I was sitting on a rock a few feet away from the pond. They came close to the rock where I was sitting. They wanted to get a good look at me. Robby started talking and I listened to every word. He would say a word and I would croak. I would croak and he would say a word. Well, days and weeks went on and both Robby and Ronny would talk to me for hours. I finally caught on to what they were saying. They named me Franklin. I thought that was a nice name for a frog.</p><p>The seasons came and went. I became a full grown frog and they could always recognize me because I had a little white spot on my under side. They came by this warm spring day to visit and it seemed like any other day. Well, they decided to bring a tiny hat, cane and cape to see if it would fit me. I tried it on and when I did, something very magical happened to me. I began to sing and dance just like that. All of my frog friends hopped upon the bank of the pond to see what was going on. There I was just putting on a show with this cute little hat, a black cape and a cane that was just my size. I could sing in frog language and people language. It was amazing.</p><p> </p><p>I had lots of frog friends. In fact, there were hundreds all around that pond. I danced the entire distance around it and tipped my hat to my friends as I went. When I got back to the place where I started, the boys laughed and played with me for hours. I sang songs I didn’t even know that I knew. Finally their parents called them back to the house. They took of the hat, cape and cane to take with them. When they took it off I went back to my original frog self not able to sing a single note. I visited with my friends who couldn’t understand what happened.</p><p>Back into the pond we all jumped and went on with our frog lives as usual.</p><p>One evening a couple of weeks later here Robby and Ronny came again. I was in the middle of the pond on a lily pad just passing the day away. I was just relaxing. They called me over to the bank of the pond and I went to see them.</p><p>As I looked behind them I could see several other people coming down to the pond. I didn’t recognize any of them, but figured they were coming to visit with me too. They all gathered round and talked picking me up every once in a while. Some of them held me way too tight, but I enjoyed the company. Several of my other friends came with me. They got a lot of attention too, but one of the boys said “hey I thought you said this frog could sing and dance?”</p><p>Ronny said “he can, just watch, he will start any minute. You will see.”</p><p>“Come on Franklin, do your thing,” said Robby. “I think he is just shy around all of you guys.” “Oh by the way, what did we do with that hat, cape and cane we had with us last time?”</p><p>“Don’t remember,” said  Ronny.</p><p>I tried to do what I had done before, but even though I tried, there was no song and no dance. I just could not do what I had done before.</p><p>I finally snuck away from them and went on with my frog friends. We jumped and croaked and played like we usually did for a long time. The crowd finally left and I could hear them talking about me as they walked away.</p><p>My friends and I couldn’t understand it either. “Why couldn’t I do my song and dance?” I asked my friends.</p><p>“We don’t know,” they croaked. “Maybe you just need to try now without all those people watching you.”</p><p>So I tried and still nothing. As I sat there on the bank, I could see a small container sitting just inside a tiny hole in a big oak tree that sat near the bank. I hopped over and was able to flip off the top of the container. Inside was the tiny hat, cape and cane that the boys had put on me the last time they were here. “That’s it.” I thought. I slipped them on and low and behold I could sing and dance. I was all over the place performing for all of my friends. We had a great time. Finally it was getting dark and I put the items back in the container inside the tree.</p><p>Every once in a while I would do my little act and even when the boys came to visit I would do my little song and dance.</p><p>One day when I was just swimming around, I could hear the boys talking about me. They had a plan to put me in a box and take me to show everyone what I could do with my little hat, cape and cane. They had been watching me evidentially when I was doing my act and planning to make me famous (whatever that meant).  I did not want to leave my friends or my home in the pond. So the next time they came down and brought other boys to show me off, I stood as still as a stick. No singing and no dancing was done that day. I would only do it when the people were not around. They never talked about taking me away again.</p><p>The other frogs liked my act but became tired of it and started to ignore me. I was annoying them. I had stopped performing for the boys and the frogs. I felt alone. One day I decided that was enough. Yes I could sing in people language and could dance like people do, but I was a frog and a frog I would always be. That day I decided to do away with my little hat, cape and cane. I had some of my fellow frogs help me put that container in a garbage can sitting at the back door of the boy’s house. We got it up there and climbed up a tree with it and let it drop into the can. There, it was done. No more performing.</p><p>Time went by and the boys didn’t come down much anymore, but one of their other brothers did. He started playing with some of the new tadpoles swimming at the edge of the pond. As the tadpoles grew into frogs that little boy would come down and talk with one of them just like his brothers had talked to me. He seemed to really enjoy the company of that frog. The frog seemed to enjoy his company too .</p><p>I could not believe my eyes. One day he brought a little container that had that little hat, cape and cane in it. I had thrown that away.</p><p>“How did he get it?” I thought. He tried it on the little frog and he sang and danced just like I used to do. He entertained us for hours every time he had it on. I finally figured out that there was magic in that costume and when it was on a frog, it made them able to sing and dance. I thought he would finally figure it out and do just what I had done with it. I jumped back into the pond, found a lily pad, laid back and decided to let that frog have his fun for as long as it would last.</p>"}