{"title": "The Frog Prince", "author": "Brothers Grimm", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,", "tag": "Frog,", "length": "05 - 10 mins,", "body": "<p>In the olden time, when wishing was having, there lived a King, whose daughters were all beautiful; but the youngest was so exceedingly beautiful that the Sun himself, although he saw her very, very often, was delighted every time she came out into the sunshine.</p><p>Near the castle of this King was a large and gloomy forest, where in the midst stood an old lime-tree, beneath whose branches splashed a little fountain; so, whenever it was very hot, the King’s youngest daughter ran off into this wood, and sat down by the side of the fountain; and, when she felt dull, would often divert herself by throwing a golden ball up into the air and catching it again. And this was her favorite amusement.</p><p>Now, one day it happened that this golden ball, when the King’s daughter threw it into the air, did not fall down into her hand, but on to the grass; and then it rolled right into the fountain. The King’s daughter followed the ball with her eyes, but it disappeared beneath the water, which was so deep that she could not see to the bottom. Then she began to lament, and to cry more loudly and more loudly; and, as she cried, a voice called out, “Why are you crying, O King’s daughter? Your tears would melt even a stone to pity.”</p><p>She looked around to the spot from where the voice came, and saw a frog stretching his thick, ugly head out of the water. “Ah! you old water-paddler,” said she, “was it you that spoke? I am weeping for my golden ball which bounced away from me into the water.”</p><p>“Be quiet, and do not cry,” replied the Frog; “I can help you. But what wilt thou give me if I succeed in fetching your plaything up again?”</p><p>“What would you like, dear Frog?” said she. “My dresses, my pearls and jewels, or the golden crown which I wear?”</p><p>The Frog replied, “Dresses, or jewels, or golden crowns, are not for me; but if you will love me, and let me be your companion and playmate, and sit at your table, and eat from your little golden plate, and drink out of your cup, and sleep in your little bed,—if you will promise me all these things, then I will dive down and fetch up your golden ball.”</p><p>“Oh, I will promise you all,” said she, “if you will only get me my golden ball.” But she thought to herself, “What is the silly Frog chattering about? Let him stay in the water with his equals; he cannot enter into human society.” Then the Frog, as soon as he had received her promise, drew his head under the water and dived down. Presently he swam up again with the golden ball in his mouth, and threw it on to the grass. The King’s daughter was full of joy when she again saw her beautiful plaything; and, taking it up, she ran off immediately. “Stop! stop!” cried the Frog; “take me with you. I cannot run as you can.”</p><p>But this croaking was of no avail; although it was loud enough, the King’s daughter did not hear it, but, rushing home, soon forgot the poor Frog, who had to jump back into the fountain.</p><p>The next day, when the King’s daughter was sitting at table with her father and all his assistants, and was eating from her own little golden plate, something was heard coming up the marble stairs, splish-splash, splish-splash; and when it arrived at the top, it knocked at the door, and a voice said—</p><p>“Open the door, youngest daughter of the King!”</p><p>So she arose and went to see who it was that called to her; but when she opened the door and caught sight of the Frog, she shut it again very quickly and with great passion, and sat down at the table, looking very pale.</p><p>But the King noticed that her heart was beating violently, and asked her whether it was a giant who had come to fetch her away who stood at the door. “Oh, no!” answered she; “it is no giant, but an ugly Frog.”</p><p>“What does the Frog want with you?” said the King.</p><p>“Oh, dear father, yesterday when I was playing by the fountain, my golden ball fell into the water, and this Frog fetched it up again because I cried so much: but first, I must tell you, he asked me so much, that I promised him he could be my companion. I never thought that he could come out of the water, but somehow he has managed to jump out, and now he wants to come in here.”</p><img src='https://xcx.mdavid.cn/img/148.png'></img><p>At that moment there was another knock, and a voice said—</p><p>“King’s daughter, youngest,</p><p>Open the door.</p><p>Have you forgotten</p><p>Thy promises made</p><p>At the fountain so clear</p><p>Beneath the lime-tree’s shade?</p><p>King’s daughter, youngest.</p><p>Open the door.”</p><p>Then the King said, “What you have promised, that you must do; go and let him in.” So the King’s daughter went and opened the door, and the Frog hopped in after her right up to her chair: and as soon as she was seated, he said, “Lift me up;” but she hesitated so long that the King had to order her to obey. And as soon as the Frog sat on the chair he jumped on to the table and said, “Now push your plate near me, that we may eat together.” And she did so, but as every one noticed, very unwillingly. The Frog seemed to enjoy his dinner very much, but every bit that the King’s daughter ate nearly choked her, till at last the Frog said, “I have satisfied my hunger, and feel very tired; will you carry me upstairs now into your bedroom and make your bed ready that we may sleep together?”</p><p>At this speech the King’s daughter began to cry, for she was afraid of the cold Frog, and dared not touch him; and besides, he actually wanted to sleep in her own beautiful, clean bed!</p><p>But her tears only made the King very angry, and he said, “He who helped you in the time of your trouble must not now be despised!” So she took the Frog up with two fingers, and put him into a corner of her chamber. But as she lay in her bed, he crept up to it, and said, “I am so very tired that I shall sleep well; do take me up, or I will tell your father.” This speech put the King’s daughter into a terrible rage, and catching the Frog up, she threw him with all her strength against the wall, saying “Now will you be quiet, you ugly Frog!”</p><img src='https://xcx.mdavid.cn/img/149.png'></img><p>But as he fell he was changed from a Frog into a handsome Prince with beautiful eyes.</p><p>The Prince explained that a witch had cast a spell on him and turned him into a frog. The only way the spell could be broken was by the passion of a princess, which had now just happened.</p><p>Over another year of friendship they became very close. Friendship turned to courtship and finally to a proposal of marriage from the Prince. When they got married, they both dressed up as frogs for the fun of it and the Princess wore a green wedding dress. From that day onwards frogs were honoured throughout the kingdom.</p><p> </p><p> </p>"}