{"title": "FROGBEAT! A musical journey.", "author": "Ann Lang", "level": "3 to 5,6 to 8,9 to12,", "category": "Illustrated,Instructional,Modern,Original,", "tag": "Frog,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Frogbeat-header-image.gif'></img><p>Illustrated by Joe West </p><p>FROGBEAT</p><p>That’s our name…</p><p>We are a FROG BAND and we play music with a beat. We are all part of the frog family and come from various ponds and waterways around the world.</p><p>As we go on our musical journey you will learn all about the instruments we play and the people we meet. Watch out for the words printed in  red as at the end of our story you will find the meaning of all the  red words and enjoy discovering what they mean in musical terms, and there will also be a quiz so look carefully…</p><p>Now you know who we are we can tell you our story but first turn the page and meet the band…</p><img src='https://xcx.mdavid.cn/img/Band1.gif'></img><img src='https://xcx.mdavid.cn/img/Band2.gif'></img><p>Somehow FROGBEAT managed to come together because of our great love of music. It just seemed to happen.</p><p>We started out as a  trio (Andy, Oggie and myself) just playing for fun at  Percussion Pond, our only audience being  Gilbert Guppie  Sullivan  Seagull,  Crotchet  Crab and  Quaver  Duck.</p><p>Suddenly our music became a very important part of our lives and the more we played the better we became.</p><p>Soon our fame spread throughout the animal kingdom so it wasn’t surprising when other members of the frog family came along and joined us at  Percussion pond.</p><img src='https://xcx.mdavid.cn/img/POND.jpg'></img><p>Andy greeted each new member by saying with his usual happy smile “Welcome to our world of music. Oggie, Ronnie and myself are pleased to hear that you want to join our band.”</p><p>And so three became eight and FROGBEAT was born.</p><p>It took many hours of practice for us all to blend and become happy in each other’s company but at last we had the right sound. Now we needed to do something with it by making ourselves known to all lovers of music.</p><p>It was our friend  Cadenza the Carthorse who lived in  Brass Barn close to our pond who came up with the brilliant idea of touring the countryside to sell our music.</p><p>In a very excited voice he said “My Master,  Major Minor, is a very kind gentleman, and has offered you the use of my good self and his cart to take your music to the people.”</p><p>This was too good a chance to miss. We quickly packed everything we felt we would need.</p><p>Gillie made a very brave speech as we sadly said “goodbye” to our friends  Gilbert Guppie,  Sullivan  Seagull,  Crotchet Crab, and  Quaver the Duck “We will never forget you. When we are famous we will come back to see you all,” he said.</p><img src='https://xcx.mdavid.cn/img/CADENZA.jpg'></img><p>As we slowly moved away we could hear all our friends singing a good luck song in  harmony.</p><p>Then FROGBEAT hit the road not knowing what we would bump into on our musical journey.</p><p>The thrill of the mysteries that could lie ahead of us, because of our need to play music, gave us a great sense of adventure.</p><p>It was quite tiny inside the cart but we each took it in turns to sit up at the front with  Cadenza and help to guide him along the right road.</p><p>Singing together, with Andy strumming his guitar, we made our way along the country lanes, which of course  Cadenza knew quite well.</p><p>We must have travelled quite a few miles before we came upon a village green. A number of people were gathered around a large tall and beautiful tree known as  Woodwind Willow They all appeared to be gazing up at its branches.</p><p>Oggie had fallen asleep on the journey but suddenly opened his eyes and said, “Why is everyone looking up at the sky? Let’s find out what the problem is and see if we can help.”</p><p>A kitten had somehow climbed up to the highest branch and now seemed to be having difficulty getting back down. So much noise was being made that the poor little kitten looked very frightened. No way was he going to move down the tree whilst the people were shouting at him!</p><img src='https://xcx.mdavid.cn/img/CATTREE.jpg'></img><p>Then FROGBEAT came to the rescue.</p><p>“Come on chaps grab your music and let’s help this poor frightened cat.   Spread yourselves out around the bottom of the tree” said Bernie holding on tight to his trumpet.</p><p>“Should we play a fast jazzy number? asked Andy.</p><p>“No we need to relax that kitten so he’ll come down!” replied Bernie.</p><p>As soon as we were ready we began to play a very soothing  melody . When  our music filled the air the people suddenly stopped calling out to the cat. Slowly they rocked back and forth in time to the  beat  of the music.The humming noise they made to the tune we were playing seemed to calm the cat.</p><p>Very slowly he came down from the tree and trotted off in the direction of his house saying to himself</p><p>“Loved the music but whatever was all the fuss about.   I would have made it to the bottom by myself after that silly dog left”</p><p>“What dog?” asked  Cadenza.</p><p>But the cat had already trotted off too fast to hear him.</p><img src='https://xcx.mdavid.cn/img/CRESCENDO2.jpg'></img><p>We felt really happy because FROGBEAT had been able to assist in rescuing the cat from the branches of the tree.</p><p>After carefully putting our musical instruments away we  made our way back into  Cadenza’s cart.    We were just getting ready to move on again when a large car drew up alongside the village green.</p><p>The car door opened and out stepped Mayor  Minim,  looking very grand in his mayoral robe.</p><p>He came towards our band saying, “I’m glad you are still here.   My wife heard your music and I have come to ask you a favour. I really do need your help. Tonight the annual Mayor’s Ball is taking place at  Orchestra Town Hall and the band that I had booked for the dancing is unable to appear.   Would you please help me by taking their place?”</p><p>Well what an honour that was!!</p><p>Tilly even fainted with excitement!</p><p>The Mayor went on to say “You see my wife has had a new ball gown especially made to fit her and she will be very sad if the ball is cancelled and she is unable to  wear it.”</p><img src='https://xcx.mdavid.cn/img/MAYOR.jpg'></img><p>“We would be glad to help Mr.  Mayor!” said Eddie.</p><p>“Yes! It would be our pleasure but we’ve never played at a Ball before.  What should we wear?” added Freddie.</p><p>“I’m sure my tailor could easily make up some tuxedos and a dress for Tilly very quickly” replied the Mayor smiling happily.</p><p>“Did someone say something about a new dress…” asked Tilly, slowly coming around from her faint.</p><p>So off we went to the tailors to get our new outfits.</p><p>The ball was fantastic!</p><p>How well we played that night.</p><p>The large ballroom was beautifully decorated for the occasion. In the centre of the high ceiling an enormous light, which looked very much like a sparkling glass spider, shone on the dancers as they glided across the floor in time to our music. It was magical.</p><p>We would never forget Mayor Minum’s Ball. This exciting and colourful event had given us our first chance to shine and prove ourselves to be a good band.</p><p>Tilly had been delighted with her new dress and our tuxedos looked very smart.</p><p>The Mayor had even brought along his dog  Diminuendo to listen to FROGBEAT.</p><img src='https://xcx.mdavid.cn/img/BALL-copy.jpg'></img><p>It was towards the end of the evening that a well-dressed gentleman who had been sitting with the Mayor approached us with an amazing offer.</p><p>Smiling happily he said “ Hello FROGBEAT, my name is Simon  Semibreve. The cat you rescued  from the tree this afternoon belonged to my daughter  Duet.</p><p>She would have been so upset to think that  Crescendo cat might have spent the night in a tree, between you and me it’s  Diminuendo’s fault. That dog is always terrorizing poor old  Crescendo.    So one good turn deserves another.  Listening to your music tonight I would like you to come along to my studio, the world famous  Strings Studio. (Tilly nearly fainted again!)   I think your music is great and my  sound engineer NiNi Rabbit has been recording your music all evening for a live album.</p><p>We were so excited we could hardly sleep that night.</p><p>Fancy the great Simon  Semibreve being interested in FROGBEAT.</p><p> Cadenza  Carthorse, however, felt it was time he returned home to  Brass Barn with his master’s cart.</p><p>“I am beginning to feel homesick”, he said with a tear in his eye. “My master will be needing me now. You can all come back with me if you like but I’ll understand if you want to stay here and record your music. It’s a fine thing you have been offered and I’m very proud  to have been a part of your success story.”</p><p>We could see a great future for FROGBEAT’s music as well as a chance for us to travel around the country so we decided to stay. We felt this was an opportunity  to fulfil our dream with the help of our new friends Simon Semibreve and NiNi Rabbit the sound engineer.</p><img src='https://xcx.mdavid.cn/img/STUDIO.jpg'></img><p>As we said our goodbyes and watched Cadenza begin to make his way home alone, Freddie tearfully said</p><p>“I’m really sad that Cadenza is leaving us…”</p><p>Gillie replied, “We will never forget him or Percussion Pond. I’m sure we’ll go back there one day to see him and all our friends. Just think of the many adventures that lie ahead for FROGBEAT in the meantime! We will have so much to tell them all when we do return.”</p><p>All we knew at this moment was that the hard work we had put into forming our band was about to give us a new way of life. How glad we were that all our practicing had given us this reward.</p><p>At this exciting point in our story we said “goodbye” to Cadenza Carthorse and our old life at Percussion pond and “hello” to the rest of the big wide world.</p><p>THE END of our story but only the beginning of a new life for FROGBEAT…</p>"}