{"title": "The Garden of Light", "author": "Iddrisu Abdul Basit", "level": "6 to 8,9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>In a town called Tamale, there lived a man called Mr Damba. He was known as the children’s favorite by many people in the town.  He was very old but energetic and hardworking.</p><p>At the back of Mr Damba’s house was a very lovely and evergreen garden in which one would find all sort of domestic birds, flowers and a variety of ornamental plants.</p><p>This garden served as a playground for all the children in the town. In the evenings and on weekends all the town’s children would gather in the garden with their friends from neighboring towns to play and have fun.</p><p>Mr Damba was always there to clean and take good care of the garden.  He also joined the children whenever they came to play.</p><p>One evening, while the children were playing in the garden, they realized that Mr Damba was not present. Most of them became worried and finally asked Baba, Mr Damba’s first son, about his father.</p><p>“Papa is not well and we sent him to the hospital last night,” replied Baba.</p><p>The children on hearing this became more than worried because they never wanted to miss Mr Damba, even for a day.</p><p>Not sooner than later they saw Baba rush out from his room with a very sad and serious face. From then the children realized that everything was not going on well for them, their day ended in sadness and dismay.</p><p>On the next day the sudden death of Mr Damba was announced. It was the saddest day in the lives of many people, especially the children.</p><p>After his final funeral rites were performed, the children, who for some time stopped visiting the garden, started gathering again to continue their usual happy moments. Their sorrows could not be measured because they were forever going to miss Mr. Damba and his good works.</p><p>With their return they found that something was missing. The place became very boring and unsafe as compared to the days when Mr Damba was around. Mr Damba’s son, Baba, who became the caretaker of the garden, was impatient and unkind to the children.</p><p>Also Baba was very lazy and did not care about the well-being of the garden and those who came to play.</p><p>After some weeks passed by, most of the birds species and insects had left the garden. Also the flowers and ornamental plants had died because Baba did not water them. The garden became bushy and wild and poisonous insects gained their way into it. The place was no longer safe for the children and so they stopped visiting the place.</p><p>Baba went ahead and closed the garden. “I’am finally free,” he thought.</p><p>As days went by, a lot of children were becoming disturbed and unhappier due to the closure of their usual playgrounds. This made them remember Mr Damba and wished that he was still alive.</p><p>One night, while Baba was sleeping ,he had a dream in which he saw three children, two male and one female, sitting in the garden and reciting a very sweet and lovely poem:</p><p>God loves the children of the world</p><p>All men of God love the children of the world</p><p>God loves the children’s friend</p><p>God hates the children’s enemy</p><p>With them is our hope, light and future</p><p>Be kind to them</p><p>Live selflessly for them</p><p>Success is for the man who treats children well</p><p>And woe to the man who treats them badly.</p><p>After reciting this poem, one of the boys got up and took the path on his right and took his leave. The other boy also got up and left, taking the left-hand path, leaving one girl still sitting. But just after a moment she also got up and said only “love, care and hard work” After this she also turned and left Baba alone.</p><p>On the next day after taking his bath, Baba quickly went to a man of God in his town, who was also a close friend of Mr Damba, for an explanation of his strange dream. After some time of thoughts the man said “Baba your inability to continue the good works your father did has become the source of great displeasure and worry to many people especially the children in this town”.</p><p>Baba quickly asked “What are good works?” The man said “His garden, you are not taking good care of it and therefore the children are not happy.”</p><p>The man of God continued. “They left you the three words to wake you up from the satanic sleep you were having all your life. So go home and bring back to life everything that had been destroyed. I hope you understand.” Baba thanked the man and hurried home.</p><p>On reaching home he went straight to the stores and fetched his cutlass, hoe and watering cans. He started his work in the garden he worked all day. On the next day he continued. The people in his neighborhood were surprised at the sudden change in Baba’s attitude towards the garden. On the third day while he was watering the plants he observed that many of the lovely birds and insects that had left were returning. Baba was very happy because he knew his effort was not wasted. The ornamental plants also started growing fresh again</p><p>All the playing equipments were reconstructed. “The children are going to enjoy this,” he said to himself.</p><p>By the end of the third day everything in the garden came back to life.</p><p>Happily that night, Baba had another dream in which he saw his father with the three children he already encountered in his first dream. This time they were riding in a boat on a sea waving and smiling to him. On the next day he went to the man again and told him about his dream. The man thought again said “Now your father is pleased with you also you are going to acquire a lot of fortunes that cannot be measured. That was why they were travelling in the sea, so continue the good works and you shall be a great man one day.” Once again Baba thanked the man and took his way home.</p><p>Back at home, children had already invaded the garden, because it was a weekend. On reaching home, Baba saw them and was very amazed. But when the children saw him they started leaving.</p><p>Baba said “Why are you all leaving aren’t you having fun?”</p><p>One girl said aggressively “We don’t want you near us because you are wicked”</p><p>“Oh I’m a changed person now I do not wish to hurt any of you I promise,” Baba said.</p><p>All the children run to him chanting his name he played with them all day also gave them some advice on the respect and love for each other.</p><p>This continued until the authorities took notice of the good the garden brought to the children in the town. They made it a national recreational and learning center for kids and it was equipped with modern facilities.</p><p>Baba was appointed the chairman of the facility and he became very rich and famous. He named it after his father,  Mr Damba, “The children’s favorite.”</p>"}