{"title": "The Girl behind the Mirror", "author": "Brian Martin", "level": "6 to 8,9 to12,", "category": "Fantasy,Illustrated,Modern,Original,", "tag": "", "length": "Over 20 mins,", "body": "<p style=\"text-align: center;\"><strong>Story concept and illustrations by Ciara, aged 10.</strong></p><p>Lucy spotted the sign down a small alleyway.</p><p>“Mum! Look!”</p><p>“What is it?” replied Lucy’s mum. “We need to get home. It’s so foggy out, it’s creepy.”</p><p>“There’s an interesting little shop down that alleyway,” Lucy continued. “Can we take a quick look? Pleeease? Maybe we’ll find a dressing table in there?”</p><p>Lucy’s mum sighed. They had just spent a whole morning looking for dressing table for Lucy’s room, to no avail. Everything they looked at had not been good enough for Lucy.</p><p>“It’s too small!” she complained about one of them that looked perfect to mum.</p><p>“It’s too dark!” she argued when shown a perfectly acceptable one, according to mum.</p><p>“It’s too boring!” she cried when mum tried to convince her about a very sensible option she had recommended.</p><p>Mum had given up trying to convince her of anything and they were walking home, frustrated at the wasted morning. The newly descending fog just added to the gloom. She looked down the alley to where Lucy was pointing.</p><p>“Funny, I never saw that lane before and I must have passed here hundreds of times,” said Mum. “There’s hardly a dresser in that old place. It looks like an old junk shop if you ask me. If there is one in there, unlikely as it is, it’ll be filthy and falling apart.”</p><p>“Dr. Xu’s Chinese Emporium, it says on the sign,” said Lucy. “It sounds kind of exciting. Let’s have a quick look. We’ll know within a minute if it has one.”</p><p>Mum sighed with exasperation but gave in. They had been looking for weeks to find Lucy a dresser with a mirror now that she was getting older and needed one. She followed Lucy down the alleyway, more in desperation than hope.</p><p>Lucy pushed the door open, which immediately set off a bell somewhere in the back of the shop. She pushed in and almost immediately collided with a tall urn her own size. It started to wobble but she managed to stabilise it before it keeled over.</p><p>“That was close,” said Lucy in relief. “I nearly broke the Ming vase!”</p><p>“Thank goodness, Lucy,” replied Mum. “We’d be paying that back for quite a while.”</p><p>They looked around the shop. It was actually quite bright, and remarkably long. In fact, the back of the shop disappeared way into the distance. The shop was crammed with all sorts of oriental-looking items. Tall urns. Clocks. Decorations of all types. Items of furniture. Shelves of dishes, pots and bowls. Fancy seats and couches. It went on and on.</p><p>“Look, the shop owner is back there behind a desk. Let’s go ask him about dressers!” said Lucy. Before mum could say anything, Lucy had motored to the back of the shop and approached a large, round, elderly oriental-looking man sitting behind a desk. He had a long wispy white beard, a bald head and a big smiling face. He looked up.</p><p>“Lucy looking for nice dresser with big mirror, no?” said the man to Lucy.</p><p>“How did you know my name?” asked Lucy in alarm. “Or that I wanted a dresser?”</p><p>“Perhaps he overheard us as we came in,” said Mum breathlessly, catching up just behind her.</p><p>The man stood up and bowed.</p><p>“My name is Dr. Xu. Always possible to find what you are looking for in my Chinese Emporium,” he said, waving his arm around to highlight the extent of his offerings in the shop. “Follow me, I know exact thing you need.”</p><p>They followed nervously as he made his way to the back far right-hand corner of the shop, through a narrow aisle cluttered on both sides with sideboards and display cabinets inlaid with the most beautiful patterns. He stood back and indicated with his hands where to look.</p><p>“Here it is,” he said, smiling even more broadly. “I have been keeping it for you.”</p><p>Lucy gasped, ignoring his curious statement. It was the most beautiful dresser she had ever laid eyes on, with a beautiful mahogany top and drawers and a large rectangular mirror mounted within a gold-patterned border. There was a small brass plate set into the wood below the mirror engraved with the words:</p><p style=\"text-align: center;\"><strong><em>Get to know your Reflection.</em></strong></p><p>Lucy turned to Mum.</p><p>“Mum! It’s perfect! This is exactly the one I wa…”</p><p>“Out of the question, Lucy,” Mum interrupted. “There’s no way we can afford this. It’s way out of our price range.”</p><p>Lucy turned to Dr. Xu. “Dr. Xu. Please tell us how much this costs?”</p><p>Dr. Xu beamed at them. “Today is special offer. We sell this dresser to you for €20.”</p><p>Mum look shocked. “Twenty euro? Why that’s impossible. There’s no way it could be that price. We’ve looked at dressers all morning and they are all at least…”</p><p>“Lady drive hard bargain,” interrupted the shop keeper. “OK, I make deal with you. Take today and I give you for €15. But that is best offer. Leave or take it.”</p><p>Lucy looked at Mum. Mum looked at Lucy.</p><p>“We’ll take it!” they both replied.</p><p style=\"text-align: center;\">***</p><p>Later that evening, Lucy was in her bedroom, sitting at her new dresser, running her fingers over the smooth mahogany. Finally, something to take her mind off the awful purple-spotted wallpaper she had mistakenly chosen for her bedroom in a fit of “artiness”. She couldn’t help smiling at herself in the mirror. She looked again at the engraving on the brass plate.</p><p style=\"text-align: center;\"><strong><em>Get to know your Reflection</em></strong></p><p>What a curious inscription, she thought to herself. I wonder why it’s there? Well, I should at least try to get to know it, she concluded.</p><p>Lucy stared at herself in the mirror. She started to count her freckles. It was so great to finally have her own mirror in her own room. Now she could study herself in detail without others thinking she was vain or strange. After several minutes, she concluded that she had twice as many freckles on the right side of her face as compared to the left side.</p><img src='https://xcx.mdavid.cn/img/reflection-opt.jpg'></img><p>Isn’t it funny that everything is reversed in the mirror? she thought to herself. On my reflection’s face the extra freckles are on her left side, not on the right. What a funny world it would be to have everything on the opposite side to normal. I’d be left-handed and not right-handed I presume. And my bed would be on the left side of the room and not the right. In fact, the whole room would be opposite to my real room. </p><p> She moved her face closer to the mirror to examine the freckles in more detail. She leaned in closer. Her breath was fogging the mirror, clouding her view of her own face. She wiped in and held her breath, leaning in closer, until her forehead was almost touching the glass.</p><p>Lucy leaned so far forward that she lost her balance and fell towards the glass. Her head bumped against the surface of the mirror and against the forehead of her reflection.</p><p>“Ouch!”</p><p>“Who said that?” asked Lucy, looking around the room. “Who said Ouch?”</p><p>She looked in the mirror. A shocked version of herself was looking back at her. She stepped back. Her reflection stepped back. But not at the same time.</p><p>“Am I seeing what I think I’m seeing?” asked Lucy.</p><p>“Am I seeing what I think I am seeing?” replied her reflection two seconds later.</p><p>“That’s really strange,“ said Lucy. “It’s almost as if you are not my reflection but a separate person.”</p><p>“That is strange,“ replied her reflection. “That’s exactly what I was thinking too.”</p><p>They stood and gaped at one another. Lucy lifted a hand a waved it, to check if the reflection would do the same thing. Her reflection waved back.</p><p>“Stop copying me,” said Lucy. “Do something of your own to prove you are not just a delayed reflection.”</p><p>Her reflection started dancing on the spot, waving hand and arms left and right. Lucy watched in amazement, dumbstruck by what was happening.</p><p>It must be some sort of enchanted dresser, thought Lucy, with excitement. She wasn’t nervous at all.</p><p>“So, what’s going on?” asked her reflection. “How did this happen? I was just minding my own business, checking out my freckle count, when suddenly this happens. I never expected to meet my own reflection! I can’t believe this old dresser from the Chinese Emporium can do this!</p><p>“Your reflection? Excuse me, I’m the real Lucy and YOU are only the reflection, OK?”</p><p>“I beg to differ,” replied the reflection. “It’s you that is the reflection to me. So you were at the Chinese Emporium too? This is getting freakier and freakier. Funny I didn’t meet you there. Then again, if there was only one dresser, we might have fought over it.”</p><p>Lucy was gob-smacked. Not only was she having a conversation with her reflection, it actually thought IT was the real Lucy and that SHE was only a reflection. The sheer cheek of it!</p><p>“Listen, eh reflection Lucy or whatever your name is,” said Lucy, “this is just too freaky. I am going to switch out the light and go to bed. In the morning, I hope this will all have been a bad dream. Goodnight.”</p><p>Before her reflection could reply, she turned her back to the mirror and strode over to the light switch. She switched it off and went over to the window to draw the curtains. The room was in complete darkness, so she had to change into her pajamas in the dark and ended up putting them on backwards. She turned her back to the mirror, pulled the covers over her head and closed her eyes as tightly as she could.</p><p>It wasn’t easy, but Lucy finally drifted off to sleep some time later. At some stage before she dropped off, she thought she might have heard a soft “Goodnight” from somewhere, but decided it must have been her mother from outside the room, realising the room was dark and not wanting to wake her.</p><p style=\"text-align: center;\">***</p><p>The next morning Lucy woke early and immediately remembered her experience with the new mirror and dresser. It seemed so real, and yet it could only have been a dream.</p><p>She decided to confront her fear straight away. A quick check at the mirror that everything was normal and then down to breakfast.</p><p>She hopped out of her bed, walked over to the dresser and turned to face the mirror.</p><p>She saw herself looking back. She nodded her head and her reflection nodded back at exactly the same time. She waved a hand and the reflection responded. She jumped up and down and left and right. The reflection did the same. It really was just a plain, old mirror.</p><p>Phew, thought Lucy. What a vivid dream last night.</p><p>After a long day at school and an evening at her friend’s house, Lucy was finally at home in her bedroom getting ready for bed. She was in front of the dresser again, leaning in examining her freckles.</p><p>So many freckles, she thought. Why can’t I have as many on the left as I do on the right? I look so unbalanced.</p><p>She looked again at the mirror and thought again about the reflection having everything on the opposite side.  The reflection looked so normal to her.</p><p>I guess that’s because I only see a reflection of myself normally in all mirrors, never my real self, she thought.</p><p>She leaned in closer to the mirror. She reached out both hands towards the surface of the mirror and put her palms against the glass. It was funny. It didn’t feel like glass. It felt more like – someone’s hands!</p><p>Lucy screamed. Without thinking, her hands went through the mirror and grabbed the wrists of her reflection in automatic response. She jerked back in shock, still holding on and fell back. She was terrified when she realised that as she fell back she had pulled her entire reflection out of the mirror by the arms. As she fell backwards and landed on the floor, her reflection tumbled over the desk and landed on top of her with a huge shriek.</p><p>“What’s going on?” screamed her reflection. “What just happened to me?”</p><p>“Who are you?” screamed Lucy, backing away on the floor. “What’s going on?”</p><p>“You pulled me in here,” replied the reflection, starting to sit up. “Please tell me this is just a nightmare? I had a dream last night I bumped foreheads with my reflection in the mirror, but this is ridiculous.”</p><p>“Your reflection?” responded Lucy. “I’ll have you know I’m the real Lucy and you are my reflection.”</p><p>“Er, I don’t think so,” replied the reflection. “For example, I was at school all day while you were doing nothing behind the mirror,” she said.</p><p>“I was at school all day myself,” replied Lucy. “Please don’t get ahead of yourself.”</p><p>“Well, no matter, I don’t like it here. It’s too freaky, everything is the wrong way around. For example, my bed should be on the left part of the room, not the right. And your freckles are totally in the wrong place.”</p><p>“I’ll prove you are my reflection,” replied Lucy. “Let’s both look in the mirror at the same time.”</p><p>Her reflection looked at her for a moment, very suspiciously. Then she nodded.</p><p>“Ok then. Let’s resolve this once and for all. To the mirror.”</p><p>They both got off the floor, walked towards the mirror and looked into it. Their faces dropped and they turned to look at one another.</p><p>“There’s no reflection!” they chimed in unison.</p><img src='https://xcx.mdavid.cn/img/together-opt.jpg'></img><p>“Exactly,” said Lucy. “You were my reflection in the mirror, and now you are standing in my room. Super freaky!”</p><p>Lucy’s reflection suddenly started to sob.</p><p>“What’s wrong,” asked Lucy.</p><p>Her reflection tried to gather herself. She used her arm to clear the tears from her eyes.</p><p>“Am I stuck here? My mum and dad are on the other side of the mirror. I hope I can get back?”</p><p>Lucy ran over to the mirror and pressed against the surface with her hand. All she felt was regular glass. She pressed her forehead against it. Just the normal feel of the surface of a mirror.</p><p>“Maybe if I try it will work,” said her reflection. She approached the mirror and touched it with her hands. She slapped the mirror and bumped her head against it. Nothing. It was behaving like a normal mirror. She started sobbing uncontrollably.</p><p>She looked up at Lucy.</p><p>“I want to go home,” she said.</p><p style=\"text-align: center;\">***</p><p>Lucy and her reflection slipped out of the house and down the road, back towards where the lane with the Chinese Emporium had been. They had spoken for hours about what to do. Lucy thought they couldn’t tell their parents. Or Lucy’s parents, as her reflection didn’t see them as her parents, who were actually a reflected version of Lucy’s parent’s behind the mirror. Anyway, Lucy thought it would be too much of a shock to her parents to tell them that a reflected Lucy had come through the mirror into her room. They decided to go back to the shop and speak to Dr. Xu. Maybe he’d know what to do.</p><p>They stole down the road, keeping into the shadows as much as possible. Lucy’s reflection wore a hat and sunglasses and one of Lucy’s jackets so she wouldn’t look exactly the same as Lucy.</p><p>The strangest thing, though, no matter how much they searched, they could not find the shop.</p><p>“It was definitely about here,” said Lucy, exasperated. “I mean, it was a foggy day, so it’s hard to be completely sure, but it has to be around here somewhere!”</p><p>“Maybe it was a magic shop,” replied the reflection. “Maybe just because it was foggy,” some magic came down. I mean, it’s fairly unusual that you buy a dresser with a mirror that you can fall into and hang out with your reflection. So, it’s probably not an ordinary shop.”</p><p>They continued to search for over an hour, but to no avail. They decided to go back home and see if they could figure it out.</p><p style=\"text-align: center;\">***</p><p>Lucy let herself into the house with her key, and when she saw the coast was clear, she ushered in her reflection and they both hurried up the stairs and back into her room.</p><p>“Now what are we going to do?” asked her reflection, and started to cry again. “I’m never going to get home or be with my real mum and dad again.”</p><p>Lucy hugged her and stroked her hair.</p><p>“It’s OK, Lucy,” said Lucy. “We’ll figure it out. If you were able to come through into my side, you must be able to get back into yours again!”</p><p>Later that evening, Lucy went down for tea with her mum and dad and smuggled lots of food back up afterwards.</p><p>“I told them I was tired and needed an early night,” she told her reflection. “They were pleased I was being so ‘sensible’. I brought you some lovely leftovers.”</p><p>She handed over a plate of ham sandwiches, biscuits and a tall glass of milk, her favourite tea. Lucy grabbed it and devoured it hungrily.</p><p>“I’m starving,” she said. “Normally I have my tea by now.”</p><p>They spent the rest of the evening trying to get Lucy’s reflection back through the mirror. They tried everything. Bumping heads. Arms first. Looking around the back of the mirror to see if there was a way in there. But it was behaving just like a normal, run-of-the-mill dresser mirror. There appeared to be no way back.</p><p>“It’s getting late,” said Lucy. “I have a mat and a sleeping bag and a spare pillow. Why don’t you sleep under the bed so no one sees you? I sometimes sleep in there myself and pretend I am sleeping in a cave. Things always work out better after a good night’s sleep.”</p><p>And so, Lucy made up a little sleeping area under the bed with a comfy mat, a sleeping bag and a nice soft pillow. Lucy’s reflection yawned and agreed to go in, too tired and sad to argue any more with her situation.</p><p>“Tomorrow, if we don’t figure it out, we’ll tell my parents,” said Lucy. “They’ll know what to do. They’re grown-ups.”</p><p>After they settled down for the night, Lucy reached over and switched off the lights. Within minutes they were both asleep.</p><p style=\"text-align: center;\">***</p><p>The next morning was a Saturday, so Lucy didn’t have to go to school. At first when she woke up, she didn’t even think of the events with the mirror. But then suddenly it came back to her. She spun around and looked under the bed. She immediately saw her reflection looking out, eyes wide open.</p><p>“Not a dream,” they both said, in unison.</p><p>Lucy hopped out of the bed and ran to the window. She could barely see out, it was so foggy.</p><p>“Another foggy day,” said Lucy.</p><p>Her reflection sat up suddenly and bumped her head against the underside of the bed.</p><p>“Ouch!” she cried.</p><p>“Are you all right?” asked Lucy. “That sounded sore.”</p><p>“It was,” replied her reflection, crawling out from under more carefully. “Very.” She rubbed her head on the bump she had just received.</p><p>“Listen,” said the reflection. “You said it’s foggy?”</p><p>“Yes,” replied Lucy, “just like the day we bought the…”</p><p>“Exactly,” interrupted her reflection. “It was foggy the day we came across Dr. Xu’s Chinese Emporium, even though we’ve been down that street a million times and never saw it. We HAVE to go back and see if it’s there today. Perhaps it only comes out when it’s foggy!”</p><p>“OK,” said Lucy. “I’ll get us some breakfast and then we’ll head out.”</p><p>Lucy’s parents had to go out shopping and told her they’d be back in two hours, which was perfect. Once they were gone, both Lucy’s went downstairs and had a big breakfast of heaps of pancakes and bacon. Then they dressed up differently again and headed out into the fog. It wasn’t long before they were standing by the alleyway. Down the alley, they could see the sign for Dr. Xu’s Chinese Emporium.</p><p>“We found it!” cried Lucy. “Let’s go in and speak to Dr. Xu! He’ll know what to do.”</p><p>They held hands and rushed down the alley towards the shop.</p><p style=\"text-align: center;\">***</p><p>They burst into the shop, Lucy’s reflection first, Lucy straight behind her. They nearly overturned the large urn on the way in, but Lucy managed to catch and straighten it just in time.</p><p>“I could have sworn that urn was on the other side of the door last time,” said Lucy’s reflection.</p><p>“Well everything is reversed, silly,” replied Lucy. “Look, he’s down the back. Let’s go down and speak to Dr. Xu.”</p><p>They ran down to the end of the shop where Dr. Xu was sitting back on his chair reading a large hardback book. When he heard them, he looked up in surprise, looking at each of them in turn. First at Lucy. Then at her reflection. Then back at Lucy. Then at her reflection again. This went on for quite a while. He looked like a man watching a tennis match. Finally, a beaming smile broke out on his face and he stood up.</p><p>“Get to know reflection!” he cried. “Yes. I remember dresser with mirror, no?”</p><p>The two of them tumbled out their story, taking turns to fill in all the details. It went all the way through when Lucy’s reflection first came through the mirror, trying to get back in, searching for the shop but not finding the lane, sleeping overnight under the bed and right up to the present moment.</p><p>“So,” finished Lucy’s reflection. “Please tell me how I can get back through the mirror to my own side please.”</p><p>Dr. Xu’s mouth opened, as if he was about to say something, but then closed again.</p><p>“Ah yes,” he continued. “Always foggy outside when I am in shop.” And with that he sat down.</p><p>“But Dr. Xu? You didn’t answer the question. How does my reflection get back to her side?”</p><p>“I don’t know,” he replied. “I never see that done before.”</p><p>Lucy’s reflection started to cry. It was all hopeless and she was stuck in a strange reverse world, forever.</p><p>“Think, Dr. Xu, think!” demanded Lucy. “Where did you get that dresser we bought and how does it work?”</p><p>“I don’t know, that was only model,” he answered.</p><p>Lucy frowned. “Pity it didn’t come with a manual!”</p><p>Dr. Xu looked at Lucy.</p><p>“Ah yes, manual. I have here somewhere.”</p><p>Lucy looked at her reflection, who looked back with a glimmer of hope creeping into her eyes.</p><p>“There’s a manual?” she asked. “Find it now!” she demanded.</p><p>“Now where did I throw it?” mumbled Dr. Xu to himself, rifling through a very messy drawer of the desk he stood behind. “Must be in here somewhere.”</p><p>Lucy and her reflection could barely contain their impatience as they watched Dr. Xu check all the drawers, several presses and an old cupboard full of junk.  Then Lucy noticed it.</p><p>“Look over there,” she cried at Dr. Xu. “There’s a shelf over there labeled ‘Manuals’. Is that it?”</p><p>Dr. Xu looked around in surprise at where Lucy was pointing.</p><p>“Ah yes,” he answered. “I forgot that.”</p><p>He went over and leafed through the manuals until at last he found what he was looking for. He came back to the desk and triumphantly threw a pamphlet down. The girls got excited at the title when they read it:</p><p>Reflecto-Magic 9000 Dresser-Mirror Combo</p><p>There was a picture on the front of it of a man shaking hands with his reflection through the mirror.</p><p>“That’s it!” cried Lucy’s reflection. “The manual – I can’t believe there’s a manual! Thank you so much, Dr. Xu. You are a genius!”</p><p>“Yes, very handy to have manual,” he said modestly.</p><p>“Let’s run back to the house and figure this thing out with the manual,” said Lucy.</p><p>They were dashing out of the front of the shop before Dr. Xu could say “mind the urn!”</p><p style=\"text-align: center;\">***</p><p>Not long later, they were sitting in front of the mirror, manual in hand.</p><p>“To activate reflection connection, touch against mirror,” read Lucy. “That’s what happened to us!” cried Lucy. “I bumped my forehead against the mirror as I examined my freckles and I felt your forehead against mine. I must have activated this connection to the reflected world when my forehead touched it.”</p><p>“Well, it was me bumping my head against the mirror, not you, but let’s not split hairs,” replied her reflection. “But how did I end up in here on the other side?“</p><p>Lucy read on: “Once reflection activation has been triggered, the reflection portal is open for 5 minutes. It is possible to pass items through the portal during this period.”</p><p>“It’s only for 5 minutes,” said Lucy’s reflection. “That’s why in the morning it looked like a normal mirror.”</p><p>“Until I touched it with my hands again,” said Lucy. “Then I accidentally pulled you through after I touched the mirror and re-activated the portal.”</p><p>“But then afterwards when we touched it again, nothing happened. So, touching the mirror to activate the portal doesn’t work any more,” said Lucy’s reflection. “Somehow it’s broken.” She started to sob again. “I really am stuck here so.”</p><p>“Don’t give up so soon,” replied Lucy. “Let’s read the rest of the manual.”</p><p>They looked through the manual but couldn’t find anything in main sections of the manual that explained how to get Lucy’s reflection back.</p><p>“I’ll check the troubleshooting section,” said Lucy. “Maybe there will be a hint in there.”</p><p>“Waste of time,” replied her reflection. “Trouble-shooting guides never have any useful information when you are trying to solve a problem. They never cover the problem you are trying to solve.”</p><p>Lucy stubbornly kept looking through the trouble-shooting section at the back of the manual and leafed through all the problems it described.</p><p>Suddenly, Lucy saw it in big red writing:</p><p>She showed it to her reflection.</p><p>“Er, what does that mean?” asked Lucy’s reflection.</p><p>“I think it means we broke it,” replied Lucy. “By you coming all the way through, we broke it.”</p><p>Lucy’s reflection threw herself on the bed and started to sob again. Lucy handed her a handkerchief.</p><p>“This crying thing is getting out of hand,” said Lucy. She sat at the side of the bed and continued to read the troubleshooting guide.</p><p>“Wait! Here it is! Look!” cried Lucy.</p><p>“What?” asked her reflection, managing to look doubtful and hopeful at the same time.</p><p>“There’s an entry in the trouble-shooting guide for What to do if reflection passes through mirror!” she cried triumphantly.</p><p>“What does it say?”</p><p>Lucy read carefully from the manual.</p><p>“If reflection accidentally passes through reflection portal, this will disable the reflection flux capacitation adapter mechanism. This is very bad, as it is not possible through the standard method of touching mirror to reactivate as the flux capacitor circuit has been almost completely destroyed due to overload from the reflection passing through the reflection portal magnetic field. Some models are fitted with a one-use only emergency Reflection Return Button (RRB) which will temporarily provide enough power to the reflection flux capacitation adapter mechanism for one second only to activate the reflection portal. Once one second is over, the capacitor is completely blown and the reflection portal will be closed forever and cannot be reactivated.”</p><p>Lucy and her reflection looked at each other what seemed like a long time.</p><p>“Where is the Reflection Return Button?” said Lucy’s reflection.</p><p>Lucy looked again at the manual.</p><p>“Her it is!” said Lucy. “There’s a diagram with a red button on the inside of the top drawer, on the left-hand side towards the back.”</p><p>Lucy’s reflection ran to the desk and pulled the drawer open roughly. There indeed, at the back left-hand side of the drawer, was a red button with the letters RRB on it. She turned to face Lucy.</p><img src='https://xcx.mdavid.cn/img/Drawer-opt.jpg'></img><p>“One second!” said Lucy’s reflection. “That’s not enough time to climb back through,” she cried. “I’ll never make it in time.”</p><p>“Yes, it is,” replied Lucy. Simple. You start at the back of the room and run towards the dresser and jump through the mirror. I’ll press the button just before you hit the mirror. You’ll pass through and land on the other side.</p><p>“What if the button doesn’t work?” asked Lucy’s reflection. “I’ll crash into the mirror and the glass will shatter. I would smash my head.”</p><p>Lucy looked at her reflection with caring in her eyes.</p><p>“I know it’s dangerous, and scary. I’d be terrified too. But it sounds like the only way you are getting home. Otherwise – you are never going back.”</p><p>Lucy’s reflection stared at Lucy, then walked over the window and looked out. She sat on the bed and said nothing for what seemed to Lucy like an eternity.</p><p>“You’re not gonna start the waterworks again, are ya?” asked Lucy.</p><p>Her reflection shook her head and stared at the bed some more. Finally, she got up, walked back over and looked Lucy in the eye.</p><p>“OK, let’s do this.”</p><p style=\"text-align: center;\">***</p><p>They talked it over for several minutes. Lucy’s reflection was going to start on the far side of the room and run as fast as possible towards the dresser. She would jump head-first towards the mirror as soon as she reached the dresser. Lucy was to wait to the side, drawer out and finger on the RRB button. She would press it as soon as she was in the air. One second should be just enough for her to pass through the mirror before the portal closed forever. She really hoped that pressing the button would work instantly. If there was any delay, then Lucy’s reflections head would smash against the mirror and goodness knows what would be the outcome.</p><p>“Are you sure?” asked Lucy. “If it doesn’t work you could do yourself a terrible injury!”</p><p>“I know,” she replied. “But what choice to I have? I have to get home to my family.”</p><p>They squared up to face one another and smiled. Lucy stepped forward and gave her reflection a great hug.</p><p>“It was really nice to meet you,” said Lucy, choking up a little. “I’ll be sad when you go back.”</p><p>“I know,” replied her reflection. “It was very special. It was like having a nearly-twin sister.”</p><p>“Still,” continued Lucy, “now that we’ve met, we’ll still be able to see each other through the mirror in future. I know now you are a real person and not just a reflection in the glass.”</p><p>“Yes, I’ll never forget that, Lucy. Now, it’s time for me to go.”</p><p>Lucy moved over the drawer and got her finger on the RRB button. Her reflection moved to the opposite wall and turned to face the dresser.</p><p>“I’ll count down from three and then you start sprinting,” said Lucy. “Good luck!”</p><p>“Thanks. You take care,” replied her reflection.</p><p>Lucy paused for a moment and then started counting.</p><p>“Three.”</p><p>“Two.”</p><p>“One.”</p><p>“GO!”</p><p>Lucy’s reflection bolted across the room. It took Lucy by surprise how quickly she made it across to the dresser. As she leaped headlong towards the mirror, Lucy smashed down on the button. She held her breath. She couldn’t look. She closed her eyes and waited to hear the smashing sound.</p><p>After a few seconds, all was quiet. Lucy opened her eyes. There was no smashed glass. No bleeding head lying in a big heap moaning. It was eerily quiet.</p><p>She crept towards the mirror and looked anxiously into it. She saw…</p><p>Her reflection! Lucy smiled instinctively, and her reflection smiled back at the exact same time. Lucy winked and her reflection winked. Lucy waved and her reflection waved.</p><p>Lucy touched the mirror to check and see if she could touch her reflection. She just felt the glass. No amount of pressing with hands, forehead, face made any difference. She backed away from the dresser, still looking at her reflection.</p><img src='https://xcx.mdavid.cn/img/reflection-opt.jpg'></img><p>“I’m going to speak to you every day and tell you everything that’s going on,” said Lucy. “And I hope you do the same.”</p><p> </p><p style=\"text-align: center;\">THE END</p>"}