{"title": "The Golden Bird", "author": "Brothers Grimm", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,German,", "tag": "Bird,Fox,Horse,", "length": "10 - 15 mins,15 - 20 mins,", "body": "<p>THERE was once a King who had a beautiful pleasure-garden behind his palace, in which grew a tree that bore golden apples. As fast as the apples ripened they were counted, but the next day one was always missing.</p><p>This was made known to the King, who commanded that a watch should be kept every night under the tree. Now, the King had three sons, and he sent the eldest into the garden when night was coming on; but at midnight he fell fast asleep, and in the morning another apple was missing. The following night the second son had to watch, but he did not succeed any better, and again another apple was missing in the morning. Now came the turn of the youngest son, who was eager to go; but the King did not rely much upon him, and thought he would watch even worse than his brothers; however, at last he agreed.</p><p>The youth threw himself on the ground under the tree and watched steadily, without letting sleep master him. As twelve o’clock struck, something rustled in the air, and he saw a bird fly by in the moonlight, whose feathers were of shining gold. The bird landed on the tree and was just picking off one of the apples when the young Prince shot a bolt at it. Away flew the bird, but the arrow had knocked off one of its feathers, which was of the finest gold. The youth picked it up and showed it to the King next morning, and told him all he had seen in the night.</p><p>Thereupon the King assembled his council, and each one declared that a single feather like this one was of greater value than the whole kingdom.</p><p>“However valuable this feather may be,” said the King, “one will not be of much use to me—I must have the whole bird.”</p><p>So the eldest son went forth on his travels, to look for the wonderful bird, and he had no doubt that he would be able to find it.</p><p>When he had gone a short distance, he saw a fox sitting close to the edge of the forest, so he drew his bow to shoot. But the fox cried out: “Do not shoot me, and I will give you a piece of good advice! You are now on the road to the golden bird, and this evening you will come to a village where two inns stand opposite to each other—one will be brilliantly lighted, and great merriment will be going on inside; do not, however, go in, but rather enter the other, even though it appears but a poor place to you.”</p><p>“How can such a ridiculous animal give me good advice?” thought the young Prince, and shot at the fox, but missed it, so it ran away with its tail in the air. The King’s son then walked on, and in the evening he came to a village where the two inns stood: in one there was dancing and singing, but the other was quiet, and had a very mean and wretched appearance.</p><p>“I should be an idiot,” thought he to himself, “if I were to go to this gloomy old inn while the other is so bright and cheerful.” Therefore, he went into the cheerful one, lived there in noisy merriment, and so forgot the golden bird, his father, and all good behavior.</p><p>As time passed away, and the eldest son did not return home, the second son set out on his travels to seek the golden bird. Like the eldest brother, he met with the fox, and did not follow the good advice it gave him. He likewise came to the two inns, and at the window of the noisy one his brother stood begging him to come in. This he could not resist, so he went in, and began to live a life of pleasure only.</p><p>Again a long time passed by without any news, so the youngest Prince wished to try his luck, but his father would not hear of it. At last, for the sake of peace, the King was obliged to agree, for he had no rest as long as he refused. The fox was again sitting at the edge of the forest, and once more it begged for its own life and gave its good advice. The youth was good-hearted, and said:</p><p>“Have no fear, little fox; I will not do you any harm.”</p><p>“You will never repent of thy good nature,” replied the fox, “and in order that you may travel more quickly, get up behind on my tail.”</p><p>Scarcely had the youth seated himself, when away went the fox over hill and dale, so fast that the Prince’s hair whistled in the wind. When they came to the village, the youth dismounted, and following the fox’s advice, he turned at once into the shabby-looking inn, where he slept peacefully through the night. The next morning, when the Prince went into the fields, the fox was already there, and said:</p><p>“I will tell you what further you must do. Go straight on, and you will come to a castle before which a whole troop of soldiers will be lying asleep. Go right through the midst of them into the castle, and you will come to a chamber where is hanging a wooden cage containing a golden bird. Close by stands an empty golden cage, for show; but be careful that you do not take the bird out of its ugly cage and put it in the splendid one, or it will be very unlucky for you.”</p><p>With these words the fox once more stretched out its tail, and the King’s son sat upon it again, and away they went over hill and dale, with their hair whistling in the wind.</p><p>When they arrived at the castle, the Prince found everything as the fox had said, and he soon discovered the room in which the golden bird was sitting in its wooden cage; by it stood a golden one; while three golden apples were lying about the room. But the Prince thought it would be silly to put such a lovely bird in so ugly and common a cage; so, opening the door, he placed it in the golden cage. In an instant the bird set up a piercing shriek, which awakened all the soldiers, who rushed in and made him prisoner.</p><p>The next morning he was brought before a judge, who at once condemned him to death. Still, the King said his life should be spared on one condition, and that was, that he brought him the golden horse, which ran faster than the wind; and if he succeeded he should also receive the golden bird as a reward.</p><p>The young Prince set out on his journey, but he sighed and felt very sorrowful, for where was he to find the golden horse? All at once, he saw his old friend, the fox, sitting by the wayside.</p><p>“Ah!” exclaimed the fox, “you see now what has happened through not listening to me. But be of good courage; I will look after you, and tell you how you may discover the horse. You must travel straight along this road until you come to a castle; the horse is there in one of the stables. You will find a stable boy lying before the stall, but he will be fast asleep and snoring, so you will be able to lead out the golden horse quite quietly. But there is one thing you must be careful about, and that is to put on the shabby old saddle of wood and leather, and not the golden one which hangs beside it—otherwise everything will go wrong with you.” Then the fox stretched out his tail, the Prince took a seat upon it, and away they went over hill and dale, with their hair whistling in the wind.</p><p>Everything happened as the fox had said. The Prince came to the stable where the golden horse was standing, but, as he was about to put on the shabby old saddle, he thought to himself, “It does seem a shame that such a lovely animal should be disgraced with this. The fine saddle is his by right; it must go on.”</p><p>Scarcely had the golden saddle rested on the horse’s back when it began to neigh loudly. This awakened the stable boy, who awakened the grooms, who rushed in and seized the Prince and made him a prisoner. The following morning he was brought to trial and condemned to death, but the King promised him his life, as well as the golden horse, if the youth could find the beautiful daughter of the King of the golden castle. Once more, with a heavy heart, the Prince set out on his journey, and by great good fortune he soon came across the faithful fox.</p><p>“I really should have left you to the consequences of your mistake,” said the fox; “but as I feel sorry for you, I will help you out of your new misfortune. The path to the castle lies straight before you; you will reach it about the evening. At night, when everything is quiet, the lovely Princess will go to the bath-house, to bathe there. As soon as she enters, you must jump forward and give her a kiss; then she will follow you wherever you care to lead her; only be careful that she does not say goodbye to her parents, or everything will go wrong.”</p><p>Then the fox stretched out his tail, the Prince seated himself on it, and away they both went over hill and dale, their hair whistling in the wind.</p><p>When the King’s son came to the golden palace, everything happened as the fox had predicted. He waited until midnight, and when everyone was soundly asleep the beautiful Princess went into the bath-house, so he sprang forward and kissed her. The Princess then said she would joyfully follow him, but she besought him with tears in her eyes to allow her to say farewell to her parents. At first he withstood her requests, but as she wept still more, and fell at his feet, he at last gave in.</p><p>Scarcely was the maiden at the bedside of her father, when he awoke, and so did everyone else in the palace; so the foolish youth was captured and put into prison.</p><p>On the following morning the King said to him: “Your life is forfeited, and you can only find mercy if you clear away the mountain that lies before my windows, and over which I cannot see, but it must be removed within eight days. If you succeed you shall have my daughter as a reward.”</p><p>So the Prince commenced at once to dig and to shovel away the earth without cessation, but when after seven days he saw how little he had been able to accomplish, and that all his labor was as nothing, he fell into a great grief and gave up all hope.</p><p>On the evening of the seventh day, however, the fox appeared. “You don’t  deserve that I should help you or befriend you, but go away and lie down to sleep, and I will do the work for you.”</p><p>And the next morning, when he awoke and looked out of the window, the mountain had disappeared! Then the Prince, quite overjoyed, hastened to the King and told him that the conditions were fulfilled, so that the King, whether he wanted to or not, was obliged to keep his word and give him his daughter.</p><p>Then these two went away together, and it was not long before the faithful fox came to them.</p><p>“You have indeed gained the best of all,” said he, “but to the maiden of the golden castle belongs also the golden horse.”</p><p>“How can I get it?” asked the youth.</p><p>“I will tell you,” answered the fox; “first of all, take the lovely Princess to the King who sent you to the golden palace. There will then be unheard-of joy; they will gladly lead the golden horse to you and give it you. Mount it instantly, and give your hand to everyone at parting, and last of all to the Princess. Grasp her hand firmly; make her spring into the saddle behind you, and then gallop away; no one will be able to overtake you, for the golden horse runs faster than the wind.”</p><p>This was all happily accomplished, and the King’s son carried off the beautiful Princess on the golden horse. The fox did not remain behind, and spoke again to the young Prince:</p><p>“Now I will help you to find the golden bird. When you come near the castle where the bird is to be found, let the Princess dismount, and I will take her under my protection. Then ride on the golden horse to the courtyard of the palace, where your coming will cause great joy, and they will fetch the golden bird for you. As soon as the cage is in your hands, gallop back to us and fetch the maiden again.”</p><p>When this plot was successfully carried out, and the Prince was about to ride home with his treasure, the fox said, “Now you must reward me for all my services.”</p><p>“What is it that you desire?” asked the Prince.</p><p>“When we come to yonder wood, you must shoot me dead and cut off my head and paws.”</p><p>“That would be a fine sort of gratitude,” said the King’s son; “that I cannot possibly promise you.”</p><p>“Then,” replied the fox, “if you will not, I must leave you; but before I go I will give you again some good advice. Beware of two things—do not pay to release any prisoners, and see that you don’t sit on the side of a well!”</p><p>With this the fox ran off into the forest!</p><p>“Ah!” thought the young Prince, “that is a wonderful animal with very funny ideas! Who would buy gallows’-flesh, and when have I ever had the slightest desire to sit on the brink of a well?”</p><p>So he rode on with the beautiful maiden, and his path led him once more through the village in which his two brothers had stopped. Here there was great noise and excitement, and when he asked what it all meant, he was told that two men were going to be punished for bad deeds. When he came nearer, he saw that they were his two brothers, who had committed every kind of wicked folly and had squandered all their money. Then the young Prince asked if they could not be freed.</p><p>“Supposing you do pay for them,” the people answered, “where is the good of wasting your money in order to free such villains?”</p><p>Nevertheless, he did not hesitate, but paid for them, and when the brothers were freed they all rode away together. They came to the forest where they first encountered the fox, and as it was cool and pleasant away from the burning sun, the two brothers said:</p><p>“Let us sit and rest a little by this well, and eat and drink something.”</p><p>The young Prince consented, and while they were all talking together he quite forgot the fox’s warning, and suspected no evil.</p><p>But suddenly the two brothers threw him backwards into the well, and, seizing the maiden, the horse, and the golden bird, they went home to their father.</p><p>“We not only bring you the golden bird,” said they, “but we have also found the golden palace.”</p><p>There was great rejoicing, but the horse would not eat, neither would the bird sing, and the maiden only sat and wept.</p><p>But the youngest brother had not perished. By good fortune the well was dry, and he had fallen on soft moss without hurting himself, but he could not get out again.</p><p>Even in this misfortune the faithful fox did not desert him, but came springing down to him and scolded him for not following his advice.</p><p>“Still I cannot forsake you,” said he, “and I will help to show you daylight once more.”</p><p>Then he told him to seize hold of his tail and hold on tightly; and so saying, he lifted him up in the air.</p><p>“Even now you are not out of danger,” said the fox, “for your brothers were not certain of your death, and have set spies to watch for you in the forest, who will certainly kill you if they see you.”</p><p>There was an old man sitting by the road with whom the young Prince changed clothes, and, so disguised, he reached the court of the King.</p><p>No one recognized him, but the golden bird began to sing, and the golden horse started to eat, and the lovely maiden stopped crying.</p><p>The King was astonished and asked: “What does this all mean?”</p><p>Then said the maiden: “I know not, but I was so sad, and now I feel light-hearted; it is as if my true husband had returned.”</p><p>Then she told him all that had happened, although the other brothers had threatened to kill her if she betrayed them.</p><p>The King then summoned all the people in the castle before him: and there came with them the young Prince dressed as a beggar in his rags, but the maiden recognized him instantly and fell upon his neck.</p><p>So the wicked brothers were seized and thrown in prison, but the young Prince married the lovely Princess and was made his father’s heir.</p><p>But what became of the poor fox?</p><p>Long afterwards the young Prince went again into the forest, and there he met once more with the fox, who said:</p><p>“You now everything in the world you desire, but to my misfortunes there can be no end, although it is in your power to release me from them.”</p><p>So he begged the Prince to shoot him dead and cut off his head and feet.</p><p>At last the Prince agreed to do so, and scarcely was the deed done than the fox was changed into a man, who was no other than the brother of the beautiful Princess, at last released from the spell that had trapped him for so long.</p><p>So now nothing was left to prevent to the happiness of the Prince and his bride as long as they lived.</p>"}