{"title": "Goldilocks and the Three Bears", "author": "Leonard Leslie Brooke", "level": "0 to 2,3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,Illustrated,", "tag": "Bear,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/g028.png'></img><img src='https://xcx.mdavid.cn/img/g029.png'></img><img src='https://xcx.mdavid.cn/img/g0030.jpg'></img><img src='https://xcx.mdavid.cn/img/g031.png'></img><p>Once upon a time there were Three Bears, who lived together in a house of their own, in a wood. One of them was a Little, Small, Wee Bear; and one was a Middle-sized Bear, and the other was a Great, Huge Bear. They had each a pot for their porridge; a little pot for the Little, Small, Wee Bear; and a middle-sized pot for the Middle Bear, and a great pot for the Great, Huge Bear. And they had each a chair to sit in; a little chair for the Little, Small, Wee Bear; and a middle-sized chair for the Middle Bear, and a great chair for the Great, Huge Bear. And they had each a bed to sleep in; a little bed for the Little, Small, Wee Bear; and a middle-sized bed for the Middle Bear, and a great bed for the Great, Huge Bear.</p><img src='https://xcx.mdavid.cn/img/g032.png'></img><img src='https://xcx.mdavid.cn/img/g0033.jpg'></img><img src='https://xcx.mdavid.cn/img/g034.png'></img><img src='https://xcx.mdavid.cn/img/g035.png'></img><p>One day, after they had made the porridge for their breakfast, and poured it into their porridge-pots, they walked out into the wood while the porridge was cooling, that they might not burn their mouths by beginning too soon to eat it.</p><p>While they were walking, a little Girl called Goldilocks came to the house. First she looked in at the window, and then she peeped in at the keyhole; and seeing nobody in the house, she turned the handle of the door. The door was not locked, because the Bears were good Bears, who did nobody any harm, and never suspected that anybody would harm them. So Goldilocks opened the door, and went in; and well pleased she was when she saw the porridge on the table. If she had been a thoughtful little Girl, she would have waited till the Bears came home, and then, perhaps, they would have asked her to breakfast; for they were good Bears—a little rough or so, as the manner of Bears is, but for all that very good-natured and welcoming. But the porridge looked tempting, and she set about helping herself.</p><img src='https://xcx.mdavid.cn/img/g0036.jpg'></img><p>So first she tasted the porridge of the Great, Huge Bear, and that was too hot for her. And then she tasted the porridge of the Middle Bear, and that was too cold for her. And then she went to the porridge of the Little, Small, Wee Bear, and tasted that; and that was neither too hot nor too cold, but just right, and she liked it so well that she ate it all up.</p><p>Then Goldilocks sat down in the chair of the Great, Huge Bear, and that was too hard for her. And then she sat down in the chair of the Middle Bear, and that was too soft for her. And then she sat down in the chair of the Little, Small, Wee Bear, and that was neither too hard nor too soft, but just right. So she seated herself in it, and there she sat till the bottom of the chair came out, and down she came crashing to the ground.</p><img src='https://xcx.mdavid.cn/img/g038.png'></img><p>Then Goldilocks went upstairs into the bedroom in which the three Bears slept. And first she lay down upon the bed of the Great, Huge Bear, but that was too high at the head for her. And next she lay down upon the bed of the Middle Bear, and that was too high at the foot for her. And then she lay down upon the bed of the Little, Small, Wee Bear; and that was neither too high at the head nor at the foot, but just right. So she covered herself up comfortably, and lay there till she fell fast asleep.</p><p>By this time the Three Bears thought their porridge would be cool enough; so they came home to breakfast. Now Goldilocks had left the spoon of the Great, Huge Bear standing in his porridge.</p><img src='https://xcx.mdavid.cn/img/g0039.jpg'></img><img src='https://xcx.mdavid.cn/img/g0040.jpg'></img><p>“SOMEBODY HAS BEEN AT MY PORRIDGE!” said the Great, Huge Bear, in his great, rough, gruff voice. And when the Middle Bear looked at hers, she saw that the spoon was standing in it too.</p><img src='https://xcx.mdavid.cn/img/g041.png'></img><p>“SOMEBODY HAS BEEN AT MY PORRIDGE!” said the Middle Bear, in her middle voice. Then the Little, Small, Wee Bear looked at his, and there was the spoon in the porridge-pot, but the porridge was all gone.</p><p>“SOMEBODY HAS BEEN AT MY PORRIDGE, AND HAS EATEN IT ALL UP!” said the Little, Small, Wee Bear, in his little, small, wee voice.</p><p>Upon this the Three Bears, seeing that someone had entered their house, and eaten up the Little, Small, Wee Bear’s breakfast, began to look about them. Now Goldilocks had not put the hard cushion straight when she rose from the chair of the Great, Huge Bear.</p><img src='https://xcx.mdavid.cn/img/g042.png'></img><p>“SOMEBODY HAS BEEN SITTING IN MY CHAIR!” said the Great, Huge Bear, in his great, rough, gruff voice.</p><img src='https://xcx.mdavid.cn/img/g0043.jpg'></img><p>And Goldilocks had squatted down the soft cushion of the Middle Bear.</p><p>“SOMEBODY HAS BEEN SITTING IN MY CHAIR!” said the Middle Bear, in her middle voice.</p><p>And you know what Goldilocks had done to the third chair.</p><p>“SOMEBODY HAS BEEN SITTING IN MY CHAIR, AND HAS SAT THE BOTTOM OUT OF IT!” said the Little, Small, Wee Bear, in his little, small, wee voice.</p><img src='https://xcx.mdavid.cn/img/g044.png'></img><img src='https://xcx.mdavid.cn/img/g045.png'></img><p>Then the Three Bears thought it necessary that they should make farther search; so they went upstairs into their bedroom. Now Goldilocks had pulled the pillow of the Great, Huge Bear out of its place.</p><p>“SOMEBODY HAS BEEN LYING IN MY BED!” said the Great, Huge Bear, in his great, rough, gruff voice.</p><p>And Goldilocks had pulled the bolster of the Middle Bear out of its place.</p><img src='https://xcx.mdavid.cn/img/g0046.jpg'></img><p>“SOMEBODY HAS BEEN LYING IN MY BED!” said the Middle Bear, in her middle voice.</p><p>And when the Little, Small, Wee Bear came to look at his bed, there was the bolster in its place; and the pillow in its place upon the bolster; and upon the pillow was the head of Goldilocks—which was not in its place, for she had no business there.</p><p>“SOMEBODY HAS BEEN LYING IN MY BED—AND HERE SHE IS!” said the Little, Small, Wee Bear, in his little, small, wee voice.</p><img src='https://xcx.mdavid.cn/img/g047.png'></img><img src='https://xcx.mdavid.cn/img/g048.png'></img><p>Goldilocks had heard in her sleep the great, rough, gruff voice of the Great, Huge Bear, and the middle voice of the Middle Bear, but it was only as if she had heard someone speaking in a dream. But when she heard the little, small, wee voice of the Little, Small, Wee Bear, it was so sharp, and so shrill, that it awakened her at once. Up she started; and when she saw the Three Bears on one side of the bed she tumbled herself out at the other, and ran to the window. Now the window was open, because the Bears, like good, tidy Bears, as they were, always opened their bedroom  window when they got up in the morning. Out Goldilocks jumped, and ran away as fast as she could run—never looking behind her; and what happened to her afterwards I cannot tell. But the Three Bears never saw anything more of her.</p><img src='https://xcx.mdavid.cn/img/g0049.jpg'></img><img src='https://xcx.mdavid.cn/img/g050.png'></img><img src='https://xcx.mdavid.cn/img/g051.png'></img>"}