{"title": "What a Good Man Does is Always Right", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,9 to12,", "category": "Audio,Classic,Fairy Tale,Funny,Illustrated,", "tag": "Cow,Goose,Hen,Horse,Sheep,", "length": "05 - 10 mins,", "body": "<p>(Narration background music courtesy of http://www.purple-planet.com/ )</p><img src='https://xcx.mdavid.cn/img/image009-300x132.png'></img><p>I will tell you a story that was told to me when I was a small. Every time I think of this story, it seems to get better and better.</p><p>There was once a very old farmhouse in country, with a thatched roof, with all sorts of moss and plants growing on it. The walls of the house were crooked and only one window could be opened.</p><p>Outside a dog lay around most of the day, barking at everything that passed by. An old couple lived in this house, a peasant and his wife. Poor as they were, they had one thing that was valuable, and that was a horse, which only lived by eating the grass which it found growing at the side of the road. The old peasant sometimes rode into town on this horse and his neighbours often borrowed it from him, and paid for the loan of it by helping the old couple in some way.</p><p>After a while they thought they might as well sell the horse, or exchange it for something a bit more useful. But what might this something be?</p><p>“You know best, old man,” said his wife. “The fair is on today, so ride into town and get rid of the horse for money or exchange it for something good. Whatever you decide is fine with me, off you go now.”</p><p>She fastened his tie for him, for she could do that better than he could, straightened his hat and gave him a kiss. Then he rode away upon the horse that was to be sold, or exchanged for something else.</p><p>The sun shone with great heat, and not a cloud was to be seen in the sky. The road was very dusty, for many people, all going to the fair, were driving, riding, or walking on it. There was no shelter anywhere from the hot sun. Among the crowd a man came along, bringing a cow to the fair. The cow was as beautiful a creature as any cow could be.</p><p>“I’d say she gives good milk,” said the peasant to himself. “That would be a very good exchange: the cow for the horse.”</p><p>“Hello there! You with the cow,” he said to the owner of the cow. “I’d say my horse is worth more than your cow, but I’d like to have the cow. Will you swap?”</p><p>“To be sure I will,” said the man, delighted.</p><p>The men exchanged animals. When it was done, the peasant could have gone home, for he had done what he had come to do. But having made up his mind to go to the fair, he decided to go ahead, if only to at least have a look at it. So on he went to the town with his cow. Leading the animal, he walked on quickly, and, after a short time, overtook a man with a sheep. It was a good fat sheep, with fine wool on its back.</p><p>“I would like to have that sheep,” said the peasant to himself. “There is plenty of grass for him by our house, and in the winter we could keep him in the room with us. Perhaps it would be better to have a sheep than a cow.”</p><p>“Shall we exchange?” he asked the man.</p><img src='https://xcx.mdavid.cn/img/image010-202x300.png'></img><p>The man with the sheep was quite ready to swap, and the bargain was quickly made. And then our peasant continued his way on the road with his sheep.</p><p> </p><p> </p><p> </p><p> </p><p>Soon after this, he passed out another man, who had come into the road from a field, and was carrying a large goose under his arm.</p><p>“What a heavy creature you have there!” said the peasant. “It has plenty of feathers and plenty of fat, and would look well tied to a string, or paddling in the water at our place. That would be very useful to my wife, she could make all sorts of money out of it. How often she has said, ‘If we only had a goose!’ Now here is an opportunity, and, if possible, I will get it for her. Shall we exchange? I will give you my sheep for your goose.”</p><p>The other man did not mind swapping, and so the exchange was made, and our peasant took the goose.</p><p>By this time he had arrived very near the town. The crowd on the road had been gradually increasing, and there was quite a rush of men and cattle. The cattle walked on the path and by the fence, and at the gate they even walked into a potato field, where a hen was strutting about. The tail feathers of this hen were very short, and it winked with both its eyes, and looked very clever as it said, “Cluck, cluck.”</p><p>As soon as our good man saw it, he thought, “Why, that’s the finest hen I ever saw in my life, upon my word, I’d like to have that hen. Hens can always pick up a few grains that lie about, and almost look after themselves with no work. I think it would be a good exchange if I could get it for my goose. Will we exchange?” he asked the hen owner.</p><p>“Exchange?” repeated the man. “Well, that would be fine,” he replied. So they made an exchange. The man took the goose, and the peasant carried off the hen.</p><p>o — o — o</p><p>Now all this swapping of animals on his way to the fair was hard work and he was hot and tired. He wanted something to eat, and a nice drink, so he went into an inn. He was just about to enter, when the stable man came out carrying a sack. “What have you in that sack?” asked the peasant.</p><p>“Rotten apples,” answered the stable man, “a whole sack full of them. They will be good for feeding the pigs.”</p><p>“Why, that’s a terrible waste,” the peasant replied. “I’d like to take them home to my wife. Last year our old apple tree gave us only one apple, and she kept it in the cupboard till it went rotten. She would be delighted with a whole sack full.”</p><p>“What will you give me for the sack of apples?” asked the man.</p><p>“Well, I will give you my hen in exchange,” he replied.</p><p>So he gave up the hen and took the apples, which he carried into the inn. He leaned the sack carefully against the stove, and then went to the table. But he didn’t realise the stove was hot.</p><p>There were many people present—horse-dealers, cattle-owners and two men from England. The Englishmen were so rich that their pockets bulged and seemed ready to burst. They suddenly noticed a hissing sound coming from the apples that were beginning to roast by the stove and went over. The peasant saw them and told them the whole story of the horse, which he had exchanged for a cow, and all the rest of it, down to the sack of now roasting, rotten apples.</p><p>“Well, your wife won’t be very happy with you when you get home,” laughed one of the Englishmen. “Won’t she be angry with you and give out to you?”</p><p>“What! Give out for what?” said the peasant. “Why, she will kiss me and say ‘What a good man does is always right.'”</p><p>“Let’s make a bet on it,” said the Englishman. “We’ll bet you a ton of gold coins.”</p><p>“No, a sack of gold will be enough,” replied the peasant. “I can only bet a sack of apples in return, and I’ll bet myself and my wife as well. That will be a fair bet I think.”</p><p>“Done!” replied the Englishmen and so the bet was made.</p><p>A coach came to the door and the two Englishmen and the peasant got in, and away they drove. Soon they arrived at the peasant’s house.</p><p>“Good evening, dear,” he said to his wife when she came out to greet them.</p><p>“Good evening, my dear,” she replied.</p><p>“I’ve made the exchange.”</p><p>“Ah, well, you know best about these things,” said the woman. Then she hugged him and paid no attention to the strangers. She didn’t notice the sack.</p><p>“I got a cow in exchange for the horse,” said the peasant.</p><p>“Oh, how delightful!” she said. “Now we shall have plenty of milk, and butter, and cheese on the table. That was a great swap.”</p><p>“Yes, but I changed the cow for a sheep.”</p><p>“Ah, better still!” cried the wife. “You always think of everything. We have just enough land for a sheep to graze. Sheep’s milk and cheese, woolen jackets and warm stockings! The cow could not give all these things. You think of everything!”</p><p>“But I changed away the sheep for a goose.”</p><p>“Then we shall have roast goose to eat this year. You dear man, you are always thinking of something to please me. This is delightful. We can fatten up the goose before we roast her.”</p><p>“But I gave away the goose for a hen.”</p><p>“A hen! Well, that was a good exchange,” replied the woman. “The hen will lay eggs and hatch them, and we shall have chickens. We shall soon have a yard full of hens and chickens. Oh, this is just what I was wishing for!”</p><p>“Yes, but I exchanged the hen for a sack of rotten apples.”</p><p>“What! I must really give you a kiss for that!” cried the wife. “My dear good husband, now I’ll tell you something. Do you know, almost as soon as you left me this morning, I began thinking of what I could give you nice for supper this evening, and then I thought of fried eggs and bacon and herbs. I had eggs and bacon but no herbs, so I went over to the schoolmaster’s. I knew they had plenty of herbs, but the schoolmistress is very mean, although she can smile so sweetly. I asked her to lend me a handful of herbs. ‘Lend,!’ she exclaimed, ‘I have nothing to lend you, not even a rotten apple, my dear woman,’ and she shut the door in my face. But now I can lend her ten, or a whole sack full. It makes me laugh to think bringing them to her and see the look on her face.” Then she gave him a hearty kiss.</p><p>“This is great,” said both the Englishmen. “Things keep getting worse and they are still having a laugh. It’s worth the money to see it.” So they paid all the gold to the peasant who, whatever he did, however bad, was always kissed for it. Isn’t that a great way to be?</p><p>This is the story I heard when I was a child. And now you have heard it, too and know that “What a good man does is always right.”</p><img src='https://xcx.mdavid.cn/img/image009-300x132.png'></img><p> </p>"}