{"title": "Grace, Hedgehog and The Troll", "author": "Roy Wells", "level": "6 to 8,9 to12,", "category": "Fantasy,Modern,Original,", "tag": "Hedgehog,", "length": "Over 20 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Grace-Hedgehog-and-the-Troll-illustration.jpg'></img><p>One bright, sunny morning, Grace was just finishing the last spoonful of porridge at the breakfast table when there was a loud knock on the door.</p><p>“I’ll get it,” said Mummy, “you eat your toast, it’s probably the postman.”</p><p>But it wasn’t the postman, it was Jinsi, Grace’s little friend from next door.</p><p>“Hello Jinsi,” said Mummy. “You don’t look very happy today.” Jinsi had been crying and her face was all red and puffed up.</p><p>“I’ve lost Dave,” sobbed Jinsi, beginning to cry again. “He went down to the corner shop to buy some milk for Appleby but that was two hours ago.  I’m so worried that he’s gone down into Tinderbox wood again to look for that old troll.  I know that nobody has ever seen it but Dave seems determined to track it down.”</p><p>“Have you spoken to Green Man about this?” Grace asked through a mouthful of toast and jam.</p><p>“No,” replied Jinsi, “he’s over at Florence’s house in Harpers Ferry and won’t be home till Tuesday.  I just can’t wait that long.  Oh what am I to do?  You are my very best friend Gracy and I hope that you can help me.”</p><p>“Why don’t you and Jinsi go together and look for him?” said Mummy, “but don’t go too far into the wood, only as far as Bluebell Hill and then you must come home.  As you pass Hedgehog’s house, call in and ask him if he would like to go with you.  I’m sure he would be happy to help.”</p><p>Grace finished her fruit juice and went off to find her coat and shoes. Jinsi looked a little happier now that Grace was going to help her.</p><p>Hedgehog lived alone in an old, tumbledown house at the end of Saltwater Lane.  Grace rapped loudly on the rusty door knocker and waited, but Hedgehog didn’t seem to be at home.</p><p>“Let’s walk around the back,” suggested Grace “and see if he’s in the garden.”</p><p>Peering through a gap in the fence, the pair could clearly see Hedgehog, busy with something in his greenhouse. Jinsi managed to attract his attention by tapping on the roof of the greenhouse with a long stick and before long they were seated before a roaring fire in the comfort of Hedgehog’s rather cluttered kitchen, listening to his tale of woe.</p><p>Apparently, Hedgehog had been awakened in the middle of the night by a loud crashing noise coming from the direction of his back garden.  Quickly throwing on his dressing gown and slipping on his sandals, he had hurried down the stairs, picking up his large, heavy duty torch from the sideboard drawer as he went.  Slowly opening the backdoor, Hedgehog had swept the beam of the torch across the garden but could see nothing amiss.  Walking up to his greenhouse however, he had been shocked to discover that the door had been torn off its hinges and smashed to pieces.  Even worse was the fact that every one of his prize pumpkins together with his fine crop of tomatoes had been stolen.</p><p>“Whoever it was must have climbed over the fence,” muttered Hedgehog ruefully, “as I never forget to lock my garden gate.”</p><p>Grace and Jinsi told Hedgehog of the strange disappearance of Dave and their intentions of venturing into Tinderbox wood to look for him.</p><p>“Give me a minute to lock my front windows,” exclaimed Hedgehog, “and I’ll come with you, although I will have to be home no later than four o’clock as my brother Groucho is coming round for tea.  I had hoped to make him a pumpkin pie but I suppose that is now definitely off the menu.”</p><p>Grace, Jinsi and Hedgehog climbed over the old stile at the end of the lane and found themselves on the well tended, cobblestone path that wound its way down to the entrance of Tinderbox wood.  The sun had disappeared behind a huge grey cloud and Hedgehog claimed he could smell rain in the air.</p><p>“Are we simply going to wander through the wood, calling out Dave’s name?” exclaimed Hedgehog, “or do we have some kind of plan?”</p><p>“Well,” muttered Jinsi, “I know that he always used to enjoy walking down to the old stone bridge on occasion where he would partake in a little fishing so I suppose that would be as good a place as any to start.”</p><p>The three friends stood in silence on the threshold of the wood.  With the disappearance of the sun, the trees appeared dark and menacing.</p><p>“Come on,” shouted Grace,” we’ll not find Dave dithering like this,” and with those words, they plunged resolutely into the gloom and the search was on.</p><p>Once inside the wood, the air immediately became damp and musty. It had, as Hedgehog had predicted, begun to rain but the dense foliage of the trees prevented the three of them from getting wet.  Jinsi led the way followed closely by Grace with Hedgehog a few paces behind.</p><p>They had only been walking for ten minutes or more when Grace noticed something protruding from a patch of thistles beneath the bowl of an old, knotted oak tree.  Crouching down, being careful not to sting her fingers, she gingerly extracted what appeared to be a metal brooch from the undergrowth.  Looking over Grace’s shoulder, Jinsi gave out a cry of anguish.</p><p>“That’s Dave’s,” sobbed Jinsi, “I gave it to him as a birthday present last summer and he claimed that he would always wear it with pride. Oh what can this all mean?  I just know that he wouldn’t have cast it aside without good reason.”</p><p>“Let’s not be too hasty here,” counselled Hedgehog, flashing a cryptic smile at Grace.  “How do we not know that Dave didn’t drop this treasure on purpose as a sign that he is safe and well in the hope that it would be found by his friends who would surely come looking for him?”</p><p>Grace placed a comforting arm around Jinsi.  “Come on Jinsi, we can’t give up now.  I think Hedgehog is right. All we need to do is head in the direction we are walking and I feel sure we will be lucky.”</p><p>With a loud sniffle, Jinsi wiped away her tears and climbed unsteadily to her feet.  Taking the brooch from Graces fingers, she dropped it into her canvas shoulder bag and with a shuddering sigh, proceeded to follow the meandering path that was clearly beginning to descend into the river valley.</p><p>Before long, the narrow track that the three friends had been following disappeared completely, leaving them in a quandary as to which route to take.  The babble of a fast flowing stream could be heard quite clearly.</p><p>“Well now!” exclaimed Hedgehog, “I suppose that we will have to cross the stream at some point.  As we haven’t been able to locate the bridge as of yet, might I suggest that we find a way to cross now.  Once we are on the other side, we should be able to pick up the path again.”</p><p>Jinsi had hardly spoken a word in the past twenty minutes.  She had recently tripped over an out-stretched tree root and grazed her knee, an incident which hadn’t exactly improved her current state of mind. Carefully clambering down a steep embankment, the trio were confronted by a stretch of fast flowing water with no visible means of crossing.</p><p>“This way!” shouted Grace, “I can see a fallen log which should serve as a make-shift bridge.”</p><p>Leading the way, Grace picked a route through the shallow waters of the stream until they eventually reached the log.</p><p>“Who’s going first?” stammered Hedgehog, “I don’t like the look of this.”</p><p>“You’ll be OK,” laughed Grace.” Just follow me and don’t look down.”</p><p>With a little puffing and grumbling from Hedgehog who had crossed last, the three friends stood on the opposite bank.  A series of paths lay before them but Jinsi, unexpectedly breaking her silence, claimed that they should follow the course of the river until they reach the bridge.</p><p>“I’m sure it can’t be far away,” muttered Jinsi.  “Dave brought me down here once, a long time ago but things seem to be much more overgrown since then.”</p><p>The path along the edge of the stream proved to be rather slippery in places with both Jinsi and Hedgehog losing their footing and finding themselves ankle deep in water on more than one occasion. After edging their way along a particularly treacherous expanse of track, Grace looked up and gave a cry of delight.</p><p>“ Look! There it is!”</p><p>Through the overhanging branches could be seen the moss covered stonework of an old bridge.  The stream around the bridge itself appeared much wider, almost as if the water had been dammed at some point.</p><p>“Well,” uttered Jinsi, “stepping onto the structure, “this is one spot that certainly hasn’t changed at all since my last visit.” Crouching down she mysteriously began to scan the stonework of the bridge wall.</p><p>“What on earth are you doing?” inquired Hedgehog.</p><p>“On our one and only visit together, Dave and I scratched our initials into one of the stones and I just wanted to see if I could still find them.”</p><p>Grace and Hedgehog immediately joined in the search.</p><p>“I think I’ve found them!” cried Hedgehog moments later. “J + D = X, but what do you make of this below.”</p><p>Scratched in the stone directly underneath were the freshly inscribed words :-  HELP AM TAKEN.</p><p>“What do you suggest we do now Hedgehog?” enquired Grace.</p><p>Tears had begun to well up in Jinsi’s eyes once again as she stared, transfixed at the mysterious message.  Hedgehog scratched his head and sighed.</p><p>“I have no doubt whatsoever that this was written by Dave.  The question is who or indeed what has taken him and most important of all, where has he been taken to?”</p><p>“We just can’t go home and leave Dave to his fate,” stammered Jinsi.  “We have to keep searching don’t we?”</p><p>Grace and Hedgehog exchanged worried glances and remained silent. Just then, Hedgehog, whose sense of hearing was much keener than the others, cupped a paw to his ear.</p><p>“Listen, do you hear that?”</p><p>Both Jinsi and Grace listened intently but could hear nothing.  Suddenly, Grace gave out a cry.</p><p>“Yes.  I hear it.  It sounds like some kind of drum beat to me.  Do you hear it Jinsi?”</p><p>But Jinsi was lost in her own world of misery and didn’t even hear Grace’s question.</p><p>“Well!” exclaimed Hedgehog, “as this sound is the only lead we have to go on, I suppose that we must follow it.”</p><p>With these words, the three companions set off in the direction of the rhythmic beat which, much to Graces fear’s, led them deeper into the heart of the wood.</p><p>They had been walking for a half hour or more on a gradual incline as they painstakingly climbed their way out of the river valley.  Hedgehog was beginning to lag behind, forcing Grace and Jinsi to make innumerable halts in order for him to catch up.</p><p>“I’m not as nimble as I used to be,” puffed Hedgehog, as he collapsed onto an old tree stump, sweating profusely.</p><p>Grace delved into her little back pack that she never went anywhere without and withdrew two small bottles of water.</p><p>“Here,” offered Grace, “this should refresh you a little.”</p><p>Hedgehog eagerly accepted the drink which he consumed in four large gulps while Grace shared the other bottle with Jinsi.  The drum beats appeared noticeably nearer but still, by Hedgehogs estimation, at least a good half hours walk away.  Grace was becoming increasingly agitated as she had never been this far into the wood.  They had scaled “Bluebell Hill” an hour ago, a landmark which Grace had been distinctly told by her mummy not to venture beyond.  The ground was thankfully beginning to level out, enabling Hedgehog to close up on Grace and Jinsi.  They had just discovered a path which seemed to have been made much more recently than the others which led in the general direction of the sound when the drum beats abruptly ceased.</p><p>“Now what do we do?” moaned Jinsi.</p><p>“We don’t need them any more!” exclaimed Hedgehog.  “Look over there!”</p><p>Out of the thick tangle of trees that lay ahead, a brown pall of smoke drifted lazily into the air.</p><p>“Stay close to me,” whispered Hedgehog.  “If I’m not mistaken, our quest is almost over.”</p><p>The going had certainly become much easier since they had climbed out of the valley.  The air had become a lot fresher and what’s more, it had obviously stopped raining as bands of sunlight could be seen slanting their way through the tree tops.  As they drew ever nearer to the source of the smoke, Hedgehog suddenly called a halt.</p><p>“I think it would be wise if I did a little scouting on my own first, just to see if there is any immediate danger ahead.  Wait for me here and I shouldn’t be more than ten minutes.”</p><p>“But what if you get caught or fall into a trap,” protested Grace, “whatever would we do then?”</p><p>Hedgehog gave out a low chuckle.  “Don’t you worry about me.  I have experienced this kind of escapade before when I was much younger. Some things I guess you just never forget.”</p><p>With those words, Hedgehog turned and set off in the direction of the rising smoke, leaving Grace and Jinsi huddled together for comfort.</p><p>Time ticked slowly by.  Five minutes turned into ten minutes. Ten minutes into fifteen. Still no sign of Hedgehog.  Just as Grace was about to suggest walking a little in the direction that Hedgehog had taken, there was a loud crack in the undergrowth nearby as if someone had stepped on a very large branch.  Another crackle, equally as loud followed moments later. Grace couldn’t help but smile as relief washed over her face.</p><p>“Hedgehog!” she cried, “for someone that has done this kind of thing before, you certainly make a lot of noise.”</p><p>Sauntering over to the clearing from where the disturbance was issuing, Grace and Jinsi peeped out from behind an ivy festooned tree trunk expecting to see Hedgehog.  What they saw instead was a large, misshapen creature with long, hairy arms, one of which hung almost down to the ground.  Underneath the other arm was wedged a huge bundle of sticks.</p><p>“It’s the troll,” hissed Grace, dodging back behind the tree. “Stay as quiet as you can.”</p><p>Jinsi, who had herself only caught a brief glimpse, was nevertheless trembling uncontrollably.  The troll’s monstrous head moved slowly from side to side as it tried to work out exactly where the voice had come from.  Grace and Jinsi carefully began to inch their way back to where they had been seated.  Just then, Hedgehog emerged through the bushes.  Before he had time to speak however, Grace placed a finger to her lips and pointed in the direction of the clearing.  Hedgehog nodded slowly and with a wave of his paw, beckoned the pair to follow him.  When they had reached a safe enough distance, Grace and Jinsi sat down on a patch of matted grass and listened intently to what Hedgehog had to say.</p><p>After leaving Grace and Jinsi concealed in the undergrowth, Hedgehog had continued along a crude but nevertheless, well tended pathway, pausing frequently in order to listen for any tell-tale sounds of activity.</p><p>The smoke had begun to diminish considerably and, just as Hedgehog was beginning to fear that he had lost his second guide, he had forced a passage through a dense wall of intermingled shrubbery and found himself in a beautiful, sun-drenched glade. With the intense brightness in comparison with the gloominess of the wood forcing him to shield his eyes, Hedgehog gazed in wonder at the scene that lay before him.</p><p>The path that he had temporarily abandoned for fear of being spotted by who or whatever dwelt in this neck of the woods, continued up to an old, weather-beaten gate, the hinges of which were almost completely rusted away.  Either side of the path however grew the most dazzling array of flowers that Hedgehog had ever seen. Considering himself somewhat of a horticulturist, his sharp eyes detected at least four types of bloom the like of which he had never seen before in his life.  Beyond the gate, lay a picturesque little lawn, again framed by sizable clumps of multi-coloured flowers.  Hedgehog suddenly found himself beginning to relax his vigilance.  Surely, anybody that could grow such magnificent plants as these must be some kind of genius. Then his gaze fell on what could only vaguely be described as a house.  The comparison between the splendid garden and the ramshackle hovel that lay before him was nothing short of astounding.  From where Hedgehog stood, two solitary windows could be seen, both of which had been boarded up with hefty planks of wood. Lengths of twisted guttering hung forlornly from the flaking facia boards and a huge, gaping hole in the roof was partly covered by an expanse of greasy tarpaulin.   The smoke which had guided them to this very location was issuing from a stumpy pipe which protruded out of the roof at a jaunty angle.</p><p>“Goodness,” pondered Hedgehog, “an expert gardener without a doubt, but definitely a non-starter with the DIY.”</p><p>Passing through the old gate, Hedgehog, observed what looked like a corroded bath tub perched bottom uppermost over two pieces of wood.  Beside it lay an enormous wooden serving spoon.</p><p>“Aha!” muttered Hedgehog to himself, “the source of the drum beats perhaps.”</p><p>Continuing around the back of the house, Hedgehog’s wariness immediately began to re-assert itself.  Four large, cast-iron cauldrons dominated the relatively small enclosure, one of which sat atop a sizable pile of twigs and straw.  Tentatively peering over the rim of the pot, Hedgehog could discern a number of all too familiar objects floating around in the water.</p><p>“Well,” growled Hedgehog, “at least I now know where the thief lives. I’d recognise those pumpkins anywhere.”</p><p>Opening the neck of a hessian sack that hung precariously from a hook in the wall, he gingerly inserted a paw and low and behold, withdrew one of his prize winning tomatoes.  Hedgehog by now was really beginning to seethe with anger.  A sharp tapping sound however abruptly distracted him from his annoyance.  Turning sharply, he noticed movement from a window which, unlike the front ones, had not been boarded up but had ominously been fitted with four sturdy looking iron bars.  Slowly moving across, Hedgehog could just make out a grubby hand through the thick film of dust that was caked over the window pane.  Taking out a paisley handkerchief from his dungaree pocket, he scrubbed furiously at the glass and within a matter of seconds was staring at the forlorn face of Dave.  Hedgehogs first inclination was to simply smash the glass, see if he could dislodge any of the metal bars, haul Dave out to freedom and make a run for it, but his ever cautious mind told him to gather the details of Dave’s apparent imprisonment first.</p><p>He had already checked the solitary door of the house at the front and discovered it not surprisingly to be locked.  He next attempted to converse with Dave but without success.  Either the particular room that he was confined in had been sound proofed, or Dave was so weak and emaciated that he simply couldn’t make himself heard.  After suddenly realising that he had been shouting for the last few minutes in his efforts to communicate, Hedgehog abandoned this course of action, not wishing to attract unwanted attention. Just as he was about to wander off in search of another means of access, Dave, with his finger, began to scrawl on the dust covered glass that he could just reach between the bars of his cell window. The procedure was painstakingly tedious as, of course, Dave had to write backwards for Hedgehog to be able to read it.  Before too long however, the message was complete and read as follows :-.</p><p>NO TIME TO LOSE.  A MEAL IS BEING PREPARED AND I AM ON THE MENU.  AM CHAINED TO THE WALL. CAN SEE KEY TO OPEN LOCK BUT CANNOT REACH.  DO YOUR BEST DEAR FRIEND.</p><p>Hedgehog thoughtfully scratched an ear.  Assistance was definitely called for, without a shadow of doubt.  He had already formed a plan in his head but, as Dave had stated in his message, time was most certainly of the essence. Imitating Dave, Hedgehog moistened one of his claws and quickly scratched in the corner :-</p><p>WILL BE BACK SOON WITH HELP.</p><p>The only information Hedgehog would supply Grace and Jinsi with on his return was that he had found Dave and that they needed to hurry in order to rescue him. Grace quickly told Hedgehog about the troll and without further ado, the three companions set off at a brisk pace, following the path directly to the house.  On arrival, Jinsi pleaded with Hedgehog to permit her to see Dave which, after a moment’s hesitation, he reluctantly allowed.</p><p>“Stay with him at the window,” he instructed, “and we’ll do the rest.”</p><p>“How are you with heights?” exclaimed Hedgehog turning to Grace. “You seemed pretty confident crossing that log back there.”</p><p>“I’m OK with it,” replied Grace, “just tell me what you have in mind.”</p><p>Hedgehog quickly explained that he intended to lower Grace through the hole in the roof, using a length of what looked like washing line that he had discovered coiled up underneath one of the cooking pots around the back.  The rest, once she had gained access, would be up to her.</p><p>“No pressure then,” mumbled Grace,  “OK, let’s do it.”</p><p>Cupping his paws together for a foothold, Hedgehog easily boosted Grace up onto the roof.  He next tightly secured one end of the line around a sturdy beech tree and handed the other end to Grace.</p><p>“When you get up to the hole, you may have to peel back some of the tarp to get through.  If it’s anything like the rest of this place you shouldn’t have a problem with that.”</p><p>Grace nodded determinedly and proceeded to clamber up the roof.  It took her five minutes to reach the hole, her passage being hindered by loose tiles that became dislodged at the slightest touch.  Eventually arriving at her destination, she discovered that yet again, Hedgehog was correct.  One corner of the tarpaulin was completely unattached and Grace had no difficulty whatsoever in folding it back.  Dropping the rope into the darkness below, she inhaled deeply and carefully lowered herself into the entrance of the hole.</p><p>“Here goes,” she mumbled to herself and began to inch her way down the cord.</p><p>Hedgehog meanwhile, having observed Grace disappear from view, was just about to check on Jinsi when, to his abject horror he spotted in the far distance the dark figure of what had to be the troll, loping along the pathway at an alarming rate.  On its shoulders was perched a huge bundle of sticks and Hedgehogs sharp ears could even make out a kind of tuneless chant that it was mouthing.  Quickly darting behind the house, he whisked up Jinsi who, with her face pressed to the glass, had been attempting to talk to Dave and plunged into the underbrush that covered one corner of the enclosure.</p><p>“Well Jinsi,” stammered Hedgehog almost close to tears, “there’s  nothing we can do now.  It’s all down to Grace I’m afraid.”</p><p>It seemed to Grace as though she had been dangling on the cord for an eternity when her feet finally came to rest on the floor.  The first thing that she noticed about the interior was the disgusting smell which, mingled with the smell of smoke from the dying embers of a fire seemed to be a mixture of urine, rotten eggs and smelly socks.  It was, as a result of the front windows being bordered up, extremely dark in the section of house she had landed in.  Undeterred, she removed her trusty backpack and fumbling around inside, withdrew her little pocket torch.  Flipping on the switch, she silently cursed herself for not renewing the batteries as all that issued from the torch was a feeble band of light.</p><p>It was enough however for Grace to get her bearings.  She had been reliably informed by Hedgehog that Dave was imprisoned at the rear of the house and began to head therefore in a direction leading away from the  windows.</p><p>She appeared to be travelling down some type of corridor that Grace could now see terminated in front of two large doors.  The light was definitely improving as she approached the two portals.  Walking along, Grace found herself becoming increasingly irritated by the carpet of what seemed like splintery wooden sticks that she was compelled to stumble over.  Stooping down to pick one up, the blood literally froze in her veins as she found herself staring at a large, unquestionably human bone.</p><p>“Oh Jeepers!” wailed Grace to herself, “just let me get the job done and get out of this awful place.”</p><p>Suddenly, out of the gloom Grace heard a muffled voice that just had to be Dave’s.</p><p>“Dave!” yelled Grace, “where are you?”</p><p>“Right hand door of the two doors facing you!” came the frantic reply.</p><p>Grace burst through the door with all her might and was confronted by Dave looking dirty and dishevelled, manacled to a large iron spike jutting out of the wall.</p><p>“Are you a sight for sore eyes!” exclaimed Dave. “Make haste Grace, the key is over there next to that strongbox.  The troll has been gone for some time now and could be back at any minute.”</p><p>Almost in answer to Dave’s warning, the pair heard the rattle of a key in the front door lock.</p><p>“Quick Grace!” pleaded Dave, “get these chains off me then at least we’ll stand a fighting chance.”</p><p>With trembling hands, Grace somehow managed to insert the key in the lock and turn it.  The chains fell to the floor with a clatter and grabbing hold of Grace’s wrist, Dave hauled her through the cell door and headed for the shadows in the furthest recesses of the corridor.</p><p>Standing at his garden gate, the troll sensed that something was amiss, the most noticeable evidence being the length of rope that trailed down from the roof.  Coupled with the fact that his tarpaulin had obviously been tampered with, even the troll’s slow brain began to put two and two together.  Fumbling in his pocket he withdrew a large bunch of keys, selected one and inserted it into the lock of his front door.</p><p>Stepping inside, he managed, after a few minutes of stumbling around in the dark, to locate a candle which he lit with a match extracted from a cupboard drawer.  His eyes immediately fell on the rope that dangled down from above.  With an almighty bellow, the troll charged down the corridor towards the room where he had earlier that morning secured his evening meal.  Arriving at the entrance to what he had lovingly christened the meat locker, his worst fears were realised.  The chains that he had locked into place around his prisoner lay in a heap on the floor and the room was empty.  The troll, letting out a blood-curdling roar, stomped angrily into the cell and in his rage, began to throw any loose object that he could lay his hands on against the wall.</p><p>Suddenly, from the shadows of the corridor Dave sprang out and with a cry of triumph, slammed the door of the cell shut.  Grace swiftly handed Dave a length of lead pipe which she had discovered on the floor while they were waiting for the troll to make his move.  Forcefully jamming the pipe between the door handle and the door frame, Dave took hold of Graces hand and the two friends scampered as fast as they could along the corridor, through the front door which fortunately the troll had left ajar and out into the blessed light of day.</p><p>“That ought to hold him for a while,” gasped Dave grimly, “at least long enough for us to be well clear of this place anyway.”</p><p>The indescribable noise issuing from the house was enough to give wings to their feet. Sprinting through the garden gate, Grace spotted Hedgehog and Jinsi waiting for them at the edge of the clearing.</p><p>“Let’s move!” yelled Dave at the top of his voice.  “He might possibly break out at any moment and I personally don’t wish to be around if he does.”</p><p>The four companions plunged into the dense undergrowth of the wood and didn’t slacken their pace until they had reached the river. Hedgehog suggested that they took a few minutes breather at the old stone bridge.</p><p>“Yes,” exclaimed Dave, “this is where I was captured.”  While the troll was busy trussing my feet, I just had time to scratch you that brief message before a bag was thrust over my head and I was hoisted onto his shoulders and transported to his lair.”</p><p>“You must have been so scared,” whispered Jinsi who had hardly let go of his hand since being re-united.</p><p>“Well it certainly was no picnic in the park that’s for sure,” retorted Dave.</p><p>“Oh and by the way, what pray is the meaning of this?”  Jinsi dipped into her bag and withdrew the metal brooch that Grace had discovered at the base of the tree. “So much for treasured heirlooms!”</p><p>Dave’s face flushed red with embarrassment.</p><p>“I honestly have no idea how I could have dropped it Jinsi.  I certainly didn’t intend to that’s for sure.  As things have turned out, it was possibly a stroke of luck that I did drop it as it set you all on the right track to finding me.“</p><p>Dave’s voice had trailed off lamely.  Grace and Hedgehog exchanged knowing looks but nothing more was spoken of the matter.</p><p>“What I would like to learn,” spoke Hedgehog “is the meaning of the drum beats.  Without them we most certainly wouldn’t have had a clue as to which direction to head off in.”</p><p>“Apparently,” responded Dave, “it is the troll’s recognised form of jungle telegraph.  Whenever a meal is in the offering, the message goes out as an invitation to any friends or relatives that are in the neighbourhood to come and dine.  As there surely can’t be that many troll families populating this fair planet of ours, I guess that most of the time he would have dined alone.”</p><p>“The one tragic outcome to emerge from this adventure, for me at any rate,” exclaimed Hedgehog “is that I have lost the opportunity to study that excellent garden with all those rare and beautiful flowers.  I think I could have written a book about some of the delights that abounded in that small patch of natural paradise and made myself a fortune.  I still can’t believe that such a god given gift could have been granted to a creature as revolting as that troll.”</p><p>“Maybe it was a way of luring unwary wanderers into a trap,” spoke Grace,” you know, like the spider and the fly.”</p><p>“Anyhow,” concluded Dave, “I can’t thank you all enough for coming to rescue me.  It’s comforting to know that I am blessed with such caring and wonderful friends as you.”</p><p>Hedgehog cast a glance at the sun which was sinking rapidly towards the horizon.</p><p>“I think we had better make a move,” he sighed. “I know of some parents that will be very keen to know of their daughter’s whereabouts at this late hour of the day.”</p><p>With those words, the four companions rose to their feet as one and proceeded along the path that would lead them out of Tinderbox wood and back to the familiarities of a normal life.</p><p>Three days later, Hedgehog invited Grace, Dave and Jinsi around to his house for tea together with his brother Groucho and Green Man who had returned early from Harpers Ferry.  As they all sat around the large mahogany table in Hedgehog’s dining room tucking into stew and dumplings, Hedgehog loudly cleared his throat to gain attention.</p><p>“I don’t suppose any one has read yesterdays local gazette,” he announced in a sombre voice, I think there is something within its pages that might just interest you all.  Placing the journal on the table for all to see, the headline ran as follows :-</p><p>FIRE RAGES THROUGH TINDERBOX WOOD</p><p>Grace picked up the paper and began to read out loud.</p><p>“Forest rangers and local volunteers have been battling flames on the northern most section of Tinderbox wood today. Large clouds of smoke had been spotted by staff of a nearby lumber yard who immediately contacted the necessary authorities.  No one yet knows exactly what caused the fire but amid the devastation was discovered a derelict house which had been burnt to the ground.  No bodies were discovered but inside information claims that the fire could possibly have started from the building.  The fire is now under control but local police strongly discourage anyone from entering the wood for at least six weeks.”</p><p>“Ah well,” exclaimed Grace, “I suppose that draws a veil over our little rescue mission.”</p><p>“But think of all those beautiful flowers,” lamented Hedgehog, “all gone up in smoke.”</p><p>“I wonder if the troll managed to escape before the fire took hold?” mumbled Jinsi.  “After all, no body was found.”</p><p>“You want to hope that he didn’t,” snapped Dave, “or he could be paying you a visit at the dead of night the same as he did to Hedgehog.”</p><p>“Allow me to suggest that you all put the whole experience behind you now,” suggested Green Man, who had been fully informed about the entire adventure, “and may I propose a toast to the gallant band of rescuers, especially Grace who somehow managed to keep a cool head on her shoulders when it mattered the most.”</p><p>Everyone chinked their glasses together and drained the contents.</p><p>“As a footnote to this affair,” Green Man continued, “might I suggest to a certain somebody that the next time he decides to visit the corner shop for a bottle of milk.  PLEASE TAKE A FRIEND WITH YOU!”</p><p>Dave’s face flushed crimson once again but as no one seemed to notice, he simply joined in with the gales of laughter that echoed loudly around the room.</p>"}