{"title": "Grandma Reilly’s Pig", "author": "Dorothy Massey", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Pig,", "length": "05 - 10 mins,", "body": "<p>“Be very careful with this one, Shona,” said Gran.</p><p>Shona took hold of the present with both hands. It was very heavy. She tore off the paper carefully. Inside was a big yellow china pig. Shona loved the pig’s rounded sides with painted daisies. She loved the huge smile on the pig’s china face. Most of all Shona loved its long, thick eyelashes and curly wurly tail.</p><p>“It’s a piggy bank.” said Gran. “Look, it’s got a slot on the top where you put in your money.”</p><p>“How do you get it out again?” asked Shona.</p><p>Gran turned over the piggy bank. She showed Shona the oval shaped bung on the bottom.</p><p>“Ah,” said Shona.</p><p>She carried her new pig carefully upstairs to her bedroom and put it on the windowsill. That night she showed it to Dad.</p><p>“Grandma Reilly’s Pig!” he exclaimed.</p><p>“It’s not Grandma Reilly’s,” said Shona. “It’s mine. Grandma gave it to me for my birthday.”</p><p>“She gave you her pig?”</p><p>“Yes, for my birthday.”</p><p>“You’d better take care of it.” said Dad. “It’s years old, that pig.”</p><p>“Grandma gave me something second hand for my birthday!” Shona pulled a face.</p><p>“Yes. And a very lucky girl you are too. That’s a very special pig. You’d better look after it, Shona.”</p><p>“I will,” Shona promised. She drifted off to sleep.</p><p>The next morning Shona looked at the pig. Its smile made her feel happy. She kissed its nose and giggled.</p><p>“Why don’t you put birthday money into your piggy bank?” suggested Dad over breakfast. Shona raced upstairs with her money. She put every coin and every note into the pig, one by one. The pig smiled and Shona kissed its nose again.</p><p>Two days later Shona saw a pretty dress she just had to have. That evening she prised the bung from the piggy bank, counted out the money she needed to buy the dress and put it in a drawer.</p><p>The following morning, Shona took the money out of her drawer. She went to kiss Grandma Reilly’s Pig. But the pig looked different this morning, not quite so round and plump. Shona shrugged her shoulders and kissed it anyway.</p><p>Later that day, Shona ran upstairs in her new dress.</p><p>“Look at me!” she said to the piggy. “Don’t I look like a princess?”</p><p>She admired herself in the bedroom mirror.</p><p>Hmm, she said to herself, I’d look even more like a princess if I had a crown.</p><p>“Can I buy a crown?” she asked Dad.</p><p>“Why not make one with your craft kit? Dad suggested.</p><p>But Shona wanted a proper crown. She looked on the Internet and found it – the perfect princess crown. The crown was silver with glittering multicoloured jewels. It even came in a red velvet lined box. She showed Dad.</p><p>“But you’ve just had your birthday.” Dad shook his head. “I’m sorry, Shona,” he said.</p><p>“I could use my birthday money. I’ve got loads left.” Shona pleaded.</p><p>“Well I suppose so,” agreed Dad. He ordered the crown.</p><p>“That’s ten pounds you owe me,” he said.</p><p>Shona had hoped Dad would forget to ask her for the money. She dragged herself upstairs and counted ten pounds from the piggy bank. She didn’t feel like kissing its nose today. She scowled as she put it back in the window.</p><p>Shona grew bored as she waited for the postman to bring her crown. She went into her bedroom and put on the dress.</p><p>“When I get my crown I’ll look even more like a princess,” she whispered to Piggy.</p><p>“Piggy!” she exclaimed, “You don’t look well today. You look so thin. I’m sure you were fatter when Grandma gave you to me.” She picked up the piggy. She was sure it felt lighter too.</p><p>“Here’s the post!” called Dad. Shona hurtled down the stairs and raced down the drive. The startled postman gave her the package and she tore off the wrapper. The crown was even better that it had looked on the computer screen. Shona put it on and ran upstairs to admire herself in the mirror.</p><p>On Monday Shona’s friend, Leah, came to tea. Leah had some new shoes. They were pink satin with embroidered flowers and they fastened with a pearly button. They were so cool.</p><p>After Leah’s visit Shona pestered Dad to buy her some shoes like Leah’s.</p><p>“They’ll go with my new dress,” she said.</p><p>Dad sighed.</p><p>“I’ll go halves” said Shona, rushing to her piggy bank. She came down and offered Dad the money.</p><p>“Oh, go on then,” said Dad. But Shona could tell he wasn’t too pleased.</p><p>That night Shona went to kiss Piggy before she went to bed. His huge smile had gone. His mouth was a straight line which drooped at the edges. She gave him a cuddle and kissed him twice, but still he looked sad. Shona went to bed and dreamed of the pretty pink shoes.</p><p>The next morning she went to check on Piggy straight away. All the painted daisies had faded and what was worse, his curly wurly tail had uncurled. It looked like the tail of a mouse, not that of a piggy at all.</p><p>She rang Grandma Reilly. “Your piggy’s ill.” she cried. “I don’t know what to do!”</p><p>“My piggy? I haven’t got a piggy,” said Grandma Reilly.</p><p>“He’s gone thin, and his flowers are disappearing and his tail ….”</p><p>“Has his tail gone straight?” asked Grandma.</p><p>“Yes,” wailed Shona. “Yes.”</p><p>“You haven’t been feeding him right,” said Grandma.</p><p>“Feeding him?”</p><p>“Yes, he’s a money bank. He needs money. Regular feeds.”</p><p>Shona remembered the money she’d taken out to spend;  first for the crown, then  for the shoes.</p><p>“I can’t take money out?” she asked.</p><p>“Sure you can, sweetie. But don’t just take out. You have to put in as well.”</p><p>Shona ran to find Dad.</p><p>“I want my money back,” she told him.</p><p>Dad was puzzled.</p><p>“The money for the shoes. I want it back.”</p><p>“Now look here, Shona you agreed to go halves …”</p><p>“But I don’t want the shoes.”</p><p>“You don’t want the shoes?”</p><p>Eventually Dad gave Shona the money. Shona took it and clumped upstairs, followed by Dad.</p><p>Dad watched as Shona pushed the money he’d given her into the pig.</p><p>The pig’s tail curled, his flowers came back and his mouth began to curve upwards again.</p><p>“Ah, Grandma Reilly’s pig!” said Dad.</p><p>“You knew?” asked Shona.</p><p>“Of course,” said Dad.  He winked at the pig.</p><p>And the pig winked back, his lovely curly eyelashes squeezing together just for one second.</p>"}