{"title": "The Greedy Brownie", "author": "", "level": "3 to 5,6 to 8,", "category": "Celtic,Classic,Fairy Tale,Folk Tale,", "tag": "", "length": "01 - 05 mins,", "body": "<p>THERE was once a little Brownie who lived in a hollow tree stump. He had been busy all the day playing pranks. His pranks had taken him far away from home to the house of a very important landowner. Into the landowner’s cup of wine he had dropped some sour berries which he had picked on his way. He also put thistles into his boots, so that when the landowner had put them on he had screamed out with pain.</p><p>The Brownie had been away all the day, so that when at last he turned to go back to his home he felt really very tired. On his way back to the wood he passed by a cozy-looking farmhouse. The door of the dairy was open. The Brownie thought this would be a very nice cool place in which to rest for a few moments. So he slipped into the dairy, and curled himself up underneath the bench to have a nice little doze.</p><p>He was so weary that once he had fallen asleep he never woke up again until it was quite dark, when he was disturbed by two lassies (girls) who had come into the dairy.</p><p>One was carrying a candle in her hand, and by its light the pair spotted a big bowl of cream on the shelf. The naughty girls thought that they would drink it for supper. They could only find one spoon on the shelf, so they decided they would each have a spoonful in turn. Lassie Jean took the bowl and carried it to a bench in the corner, and Lassie Meg followed it with the candle. No sooner had the two girls settled themselves than the Brownie, who was now wide awake, and who was himself feeling that some supper might not be out of place, crept up behind them and blew out the candle.</p><p>The lassies at first were very much concerned at being in the dark; nevertheless they determined they would drink the cream, all the same.</p><p>Lassie Jean filled the spoon with the rich delicacy. She was about to raise it to her lips when the naughty Brownie poked his head over her shoulder, and lapped it out of the spoon before it had reached her mouth. Lassie Meg, believing that Lassie Jean had already swallowed some cream while she had had none, stretched out her hand to take away the spoon from her friend. Lassie Jean was not willing to give it up, since she said she had not yet tasted any cream. Lassie Meg was unwilling to believe her, for she declared she had heard her lapping the cream.</p><p>Without waiting for Lassie Jean to explain, she snatched the spoon out of her friend’s hand. She filled it with cream from the bowl, and was about to raise it to her lips when the Brownie jumped from behind Lassie Jean, and settling himself behind Lassie Meg’s shoulders, poked forward his head, and again lapped up the cream from out of the spoon.</p><p>Lassie Jean in her turn snatched back the spoon from Lassie Meg. Thus they went on, for every time one or the other raised the spoonful of cream to her lips it was lapped up by the Brownie. This continued until the bowl was emptied. The Brownie was full of cream, but the poor lassies had not so much as tasted one drop, although each believed the other had drunk it all.</p><p>The lassies were still quarreling when the door of the dairy was opened, and the farmer’s wife entered, carrying a lighted candle in her hand. The moment that she did so the Brownie hopped under the bench and the lassies looked up guiltily.</p><p>The farmer’s wife caught sight of the empty basin. She was very angry with them indeed. When they tried hastily to explain, each blaming the other, the farmer’s wife would not listen, but only grew the more angry. She told them that, since they had supped so well, they should have none of the scones and eggs which she had prepared for the evening meal in the kitchen.</p><p>When the farmer’s wife had entered she had left the door open, so while she was busily scolding the lassies the Brownie slipped out from under the bench and made his escape. As he ran chuckling down the road, he could still hear her angry voice drowning the attempted explanations of the bewildered lassies. When the little fellow curled himself up some time later in the tree trunk he was still laughing.</p>"}