{"title": "Gubble Bubble Kingdom", "author": "Denise McCabe", "level": "3 to 5,6 to 8,", "category": "Fairy Tale,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>‘Hey Seán, let’s go to the garden and make the biggest bubble ever today,’ said Ava.</p><p>‘Oh that’s a super idea,’ replied Seán ‘come on I’ll race you.’</p><p>Giggling they both raced out to the garden and grabbed their bubble wands. They dipped the bubble wands into their bucket and together they started to slowly blow a bubble.</p><p>‘Wow, this is definitely going to be the biggest bubble yet that we’ll do,’ Ava chuckled.</p><p>Suddenly a big gust of wind came and they watched as the bubble started to get bigger and bigger.  It blew towards them and next thing they were inside it!</p><p>‘Oh this is so funny,’ Seán laughed as he tumbled around.</p><p>The bubble then began to float up and up in the air.  It slowly went above the houses and over the hills and up towards the clouds.</p><p>‘Everything looks so tiny from up here,’ Ava gasped.</p><p>‘Hey Ava, look down there,’ Seán yelled as he pointed down.</p><p>Below there was a big grey castle and lots and lots of bubbles around it.</p><p>‘Come on Ava, let’s make our way down.’</p><p>‘But how can we do that?’ she replied.</p><p>‘Watch me,’ Seán giggled. He puffed his cheeks out as much as he could and bent his head down and blew out a large breath.</p><p>‘Good thinking Seán,’ said Ava as she began to do the same.</p><p>After much huffing and puffing, the bubble began to descend and made its way down towards the castle.</p><p>‘Look at all those bubbles,’ cried Ava ‘and why is everything so grey looking?’</p><p>Just then they heard voices calling out ‘Help, Help!’</p><p>In front of them, they saw it was a   king and queen inside a big bubble.</p><p>‘Oh, we’re so glad you’re here in Gubble Bubble Land,’ cheered the king.  ‘The silly jester has messed up with bubbles again now and we are trapped inside.’</p><p>‘But how did he do that?’ asked Ava.</p><p>‘He decided to give the kingdom a good clean, so he filled a bubble bottle from the Ho-Hum River and covered the entire kingdom with its bubbles.  But as you can see, not only did it clean everything it also took the colours away from the kingdom.  And he thought he was doing us a favour by putting us into this bubble.  Sure it’s from the Ho-Hum River and he should have known we can’t get out as that’s from another kingdom!’</p><p>‘Yes,’ interrupted the queen ‘Now he is ruling the entire kingdom, and as a result it has made everyone silly. We need to stop him before he causes any more damage.’</p><p>‘Is there anything we can do to help?’ asked Seán.</p><p>‘There is one thing,’ the queen said frantically. ‘First you will need to go the blue, yellow and red rivers beside the Rainbow Mountain. At the foot of the mountain you will find a bottle shaped like a Trident.  You then need to fill that with water from each of the rivers.  After you do that, you go to the top of the mountain, and blow the largest bubble you can.  But hurry; there is not much time as the rivers only fill up for a short time when there is a full moon.’</p><p>‘Ok, we will be as quick as we can,’ said Ava ‘Come on Seán, we can do this.’</p><p>Seán and Ava jumped back into their bubble and quickly started to float over the kingdom.  They saw that it was indeed chaos.</p><p>People were acting very silly. Some were eating breakfast from their hats. Others were wearing bowls on their head.  Jester was making silly faces and dancing around people as they walked.</p><p>‘Oh, we really need to hurry,’ Seán gasped.</p><p>They quickly floated and floated across the kingdom and over the mountains and up toward the clouds.</p><p>‘Look!’ cried Ava as she pointed ‘I can see the three rivers and there’s the trident shape bottle at the foot of the mountain. C’mon, let’s blow this bubble down harder!’</p><p>After much huffing and puffing they carefully landed the bubble down   as they did before. Ava jumped out and dashed over and grabbed the bottle.  She raced over to each of the rivers and filled it up with water.</p><p>‘Great job, now let’s make our way to the top of this mountain,’ said Seán as he began to blow his cheeks out and move the bubble.</p><p>They floated towards the top of the mountain as fast as they could. When they landed, they jumped out and joined hands together.  They then made a circle with them and poured the bubble water through and together, they blew the biggest, most colourful bubble that was ever seen in the kingdom.</p><p>The bubble began to slowly float down toward the kingdom.  When it got down it landed on top of the jesters head.</p><p>‘Ahh what’s going on, I’m soaking wet,’ the jester shouted.</p><p>It then made a large popping sound and spilled all over the kingdom.  Slowly the kingdom started to regain its colour.</p><p>The kingdom all looked up when they heard the loud noise and cheered ‘hooray for Seán and Ava!’</p><p>Seán and Ava floated down and landed in front of the king and queen.  Just then the king and queen’s bubble popped and they got out and walked over towards them.</p><p>When the jester saw this he thought ‘Oops, I might be in a little bit of trouble here’ and off he scurried through the crowds.</p><p>‘Thank you Seán and Ava,’ said the king.  ‘We can rule the kingdom again. Would you mind hanging on for a while and help us go find that silly jester?’</p><p>‘Oh yes, we would be delighted,’ they both replied.</p><p>From that day on the silly jester never blew a bubble again.</p>"}