{"title": "Hansel and Gretel", "author": "Brothers Grimm", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,", "tag": "", "length": "15 - 20 mins,", "body": "<p>Once upon a time there lived near a large wood a poor woodcutter, with his wife and two children by his former marriage, a little boy called Hansel, and a girl named Gretel. He had little enough to break or bite; and once, when there was a great famine in the land, he could not procure even his daily bread; and as he lay thinking in his bed one evening, rolling about for trouble, he sighed, and said to his wife, “What will become of us? How can we feed our children, when we have no more than we can eat ourselves?”</p><p>“Know, then, my husband,” answered she, “we will lead them away, quite early in the morning, into the thickest part of the wood, and there make them a fire, and give them each a little piece of bread; then we will go to our work, and leave them alone, so they will not find the way home again, and we shall be freed from them.” “No, wife,” replied he, “that I can never do. How can you bring your heart to leave my children all alone in the wood, for the wild beasts will soon come and tear them to pieces?”</p><p>“Oh, you simpleton!” said she, “then we must all four die of hunger; you had better build the coffins for us.” But she left him no peace till he agreed, saying, “Ah, but I shall regret the poor children.”</p><p>The two children, however, had not gone to sleep for very hunger, and so they overheard what the stepmother said to their father. Gretel wept bitterly, and said to Hansel, “What will become of us?” “Be quiet, Gretel,” said he; “do not cry— I will soon help you.” And as soon as their parents had fallen asleep, he got up, put on his coat, and, unlocking the back door, slipped out. The moon shone brilliantly, and the white pebbles which lay before the door seemed like silver pieces, they glittered so brightly. Hansel stooped down, and put as many into his pocket as it would hold; and then going back, he said to Gretel, “Be comforted, dear sister, and sleep in peace; God will not forsake us.” And so saying, he went to bed again.</p><p>The next morning, before the sun arose, the wife went and awoke the two children. “Get up, you lazy things; we are going into the forest to chop wood.” Then she gave them each a piece of bread, saying, “There is something for your dinner; do not eat it before the time, for you will get nothing else.” Gretel took the bread in her apron, for Hansel’s pocket was full of pebbles; and so they all set out upon their way. When they had gone a little distance, Hansel stood still, and peeped back at the house; and this he repeated several times, till his father said, “Hansel, what are you peeping at, and why do you lag behind? Take care, and remember your legs.”</p><p>“Ah, father,” said Hansel, “I am looking at my white cat sitting upon the roof of the house, and trying to say good-bye.” “You simpleton!” said the wife, “that is not a cat; it is only the sun shining on the white chimney.” But in reality Hansel was not looking at a cat; but every time he stopped, he dropped a pebble out of his pocket upon the path.</p><p>When they came to the middle of the forest, the father told the children to collect wood, and he would make them a fire, so that they should not be cold. So Hansel and Gretel gathered together quite a little mountain of twigs. Then they set fire to them; and as the flame burnt up high, the wife said, “Now, you children, lie down near the fire, and rest yourselves, while we go into the forest and chop wood; when we are ready, I will come and call you.”</p><img src='https://xcx.mdavid.cn/img/025.png'></img><p>Hansel and Gretel sat down by the fire, and when it was noon, each ate the piece of bread; and because they could hear the blows of an axe, they thought their father was near: but it was not an axe, but a branch which he had bound to a withered tree, so as to be blown to and fro by the wind. They waited so long that at last their eyes closed from weariness, and they fell fast asleep. When they awoke, it was quite dark, and Gretel began to cry, “How shall we get out of the wood?” But Hansel tried to comfort her by saying, “Wait a little while till the moon rises, and then we will quickly find the way.”</p><p>The moon soon shone forth, and Hansel, taking his sister’s hand, followed the pebbles, which glittered like new-coined silver pieces, and showed them the path. All night long they walked on, and as day broke they came to their father’s house. They knocked at the door, and when the wife opened it, and saw Hansel and Gretel, she exclaimed, “You wicked children! Why did you sleep so long in the wood? We thought you were never coming home again.” But their father was very glad, for it had grieved his heart to leave them all alone.</p><p>Not long afterward there was again great scarcity in every corner of the land; and one night the children overheard their stepmother saying to their father, “Everything is again consumed; we have only half a loaf left, and then the song is ended: the children must be sent away. We will take them deeper into the wood, so that they may not find the way out again; it is the only means of escape for us.”</p><p>But her husband felt heavy at heart, and thought, “It were better to share the last crust with the children.” His wife, however, would listen to nothing that he said, and scolded and reproached him without end.</p><p>Given he agreed the first time it was now harder for him to refuse again, so in the end he consented, but with a heavy heart.</p><p>The children, however, had heard the conversation as they lay awake, and as soon as the old people went to sleep Hansel got up, intending to pick up some pebbles as before; but the wife had locked the door, so that he could not get out. Nevertheless, he comforted Gretel, saying, “Do not cry; sleep in quiet; the good God will not forsake us.”</p><p>Early in the morning the stepmother came and pulled them out of bed, and gave them each a slice of bread, which was still smaller than the former piece. On the way, Hansel broke his in his pocket, and, stooping every now and then, dropped a crumb upon the path. “Hansel, why do you stop and look about?” said the father; “keep in the path.”</p><p>“I am looking at my little dove,” answered Hansel, “nodding a good-bye to me.” “Simpleton!” said the wife, “that is no dove, but only the sun shining on the chimney.” But Hansel still kept dropping crumbs as he went along.</p><p>The mother led the children deep into the wood, where they had never been before, and there making an immense fire, she said to them, “Sit down here and rest, and when you feel tired you can sleep for a little while. We are going into the forest to hew wood, and in the evening, when we are ready, we will come and fetch you.”</p><p>When noon came Gretel shared her bread with Hansel, who had strewn his on the path. Then they went to sleep; but the evening arrived and no one came to visit the poor children, and in the dark night they awoke, and Hansel comforted his sister by saying, “Only wait, Gretel, till the moon comes out, then we shall see the crumbs of bread which I have dropped, and they will show us the way home.” The moon shone and they got up, but they could not see any crumbs, for the thousands of birds which had been flying about in the woods and fields had picked them all up.</p><p>Hansel kept saying to Gretel, “We will soon find the way”; but they did not, and they walked the whole night long and the next day, but still they did not come out of the wood; and they got so hungry, for they had nothing to eat but the berries which they found upon the bushes. Soon they got so tired that they could not drag themselves along, so they lay down under a tree and went to sleep.</p><p>It was now the third morning since they had left their father’s house, and they still walked on; but they only got deeper and deeper into the wood, and Hansel saw that if help did not come very soon they would die of hunger. At about noonday they saw a beautiful snow-white bird sitting upon a bough, which sang so sweetly that they stood still and listened to it. It soon stopped, and spreading its wings flew off; and they followed it until it arrived at a cottage, upon the roof of which it perched; and when they went close up to it they saw that the cottage was made of bread and cakes, and the window-panes were of clear sugar.</p><p>“We will go in there,” said Hansel, “and have a glorious feast. I will eat a piece of the roof, and you can eat the window. Will they not be sweet?” So Hansel reached up and broke a piece off the roof, in order to see how it tasted, while Gretel stepped up to the window and began to bite it. Then a sweet voice called out in the room, “Tip-tap, tip-tap, who raps at my door?” and the children answered, “the wind, the wind, the child of heaven”; and they went on eating without interruption.</p><p>Hansel thought the roof tasted very nice, so he tore off a great piece; while Gretel broke a large round pane out of the window, and sat down quite contentedly. Just then the door opened, and a very old woman, walking upon crutches, came out. Hansel and Gretel were so frightened that they let fall what they had in their hands; but the old woman, nodding her head, said, “Ah, you dear children, what has brought you here? Come in and stop with me, and no harm shall befall you”; and so saying she took them both by the hand, and led them into her cottage.</p><img src='https://xcx.mdavid.cn/img/421px-Hansel-and-gretel-rackham.jpg'></img><p>A good meal of milk and pancakes, with sugar, apples, and nuts, was spread on the table, and in the back room were two nice little beds, covered with white, where Hansel and Gretel laid themselves down, and thought themselves in heaven. The old woman behaved very kindly to them, but in reality she was a wicked witch who captured children, and built the bread-house in order to entice them in, but as soon as they were in her power she killed them, cooked and ate them, and made a great festival of the day.</p><p>Witches have red eyes, and cannot see very far; but they have a fine sense of smelling, like wild beasts, so that they know when children approach them. When Hansel and Gretel came near the witch’s house she laughed wickedly, saying, “Here come two who shall not escape me.” And early in the morning, before they awoke, she went up to them, and saw how lovingly they lay sleeping, with their chubby red cheeks, and she mumbled to herself, “That will be a good bite.”</p><p>Then she took up Hansel with her rough hands, and shut him up in a little cage with a lattice-door; and although he screamed loudly it was of no use. Gretel came next, and, shaking her till she awoke, the witch said, “Get up, you lazy thing, and fetch some water to cook something good for your brother, who must remain in that stall and get fat; when he is fat enough I shall eat him.” Gretel began to cry, but it was all useless, for the old witch made her do as she wished. So a nice meal was cooked for Hansel, but Gretel got nothing but a crab’s claw.</p><p>Every morning the old witch came to the cage and said, “Hansel, stretch out your finger that I may feel whether you are getting fat.” But Hansel used to stretch out a bone, and the old woman, having very bad sight, thought it was his finger, and wondered very much that he did not get fatter. When four weeks had passed, and Hansel still kept quite lean, she lost all her patience, and would not wait any longer. “Gretel,” she called out in a passion, “get some water quickly; be Hansel fat or lean, this morning I will kill and cook him.” Oh, how the poor little sister grieved, as she was forced to fetch the water, and fast the tears ran down her cheeks! “Dear good God, help us now!” she exclaimed. “Had we only been eaten by the wild beasts in the wood, then we should have died together.” But the old witch called out, “Leave off that noise; it will not help you a bit.”</p><p>So early in the morning Gretel was forced to go out and fill the kettle, and make a fire. “First, we will bake, however,” said the old woman; “I have already heated the oven and kneaded the dough”; and so saying, she pushed poor Gretel up to the oven, out of which the flames were burning fiercely. “Creep in,” said the witch, “and see if it is hot enough, and then we will put in the bread”; but she intended when Gretel got in to shut up the oven and let her bake, so that she might eat her as well as Hansel. Gretel perceived what her thoughts were, and said, “I do not know how to do it; how shall I get in?” “You stupid goose,” said she, “the opening is big enough. See, I could even get in myself!” and she got up, and put her head into the oven. Then Gretel gave her a push, so that she fell right in, and then shutting the iron door she bolted it! Oh! how horribly she howled; but Gretel ran away, and left the ungodly witch to burn to ashes.</p><img src='https://xcx.mdavid.cn/img/030.png'></img><p>Now she ran to Hansel, and, opening his door, called out, “Hansel, we are saved; the old witch is dead!” So he sprang out, like a bird out of his cage when the door is opened; and they were so glad that they fell upon each other’s neck, and kissed each other over and over again. And now, as there was nothing to fear, they went into the witch’s house, where in every corner were caskets full of pearls and precious stones.</p><p>“These are better than pebbles,” said Hansel, putting as many into his pocket as it would hold; while Gretel thought, “I will take some too,” and filled her apron full. “We must be off now,” said Hansel, “and get out of this enchanted forest.” But when they had walked for two hours they came to a large piece of water. “We cannot get over,” said Hansel; “I can see no bridge at all.” “And there is no boat, either,” said Gretel; “but there swims a white duck, and I will ask her to help us over.” And she sang:</p><p><em>“Little Duck, good little Duck,</em></p><p><em>Gretel and Hansel, here we stand;</em></p><p><em>There is neither stile nor bridge,</em></p><p><em>Take us on your back to land.”</em></p><p>So the duck came to them, and Hansel sat himself on, and bade his sister sit behind him. “No,” answered Gretel, “that will be too much for the duck; she shall take us over one at a time.” This the good little bird did, and when both were happily arrived on the other side, and had gone a little way, they came to a well-known wood, which they knew the better every step they went, and at last they saw their father’s house.</p><p>Then they began to run, and, bursting into the house, they fell into their father’s arms. He had not had one happy hour since he had left the children in the forest; and his wife was dead. Gretel shook her apron, and the pearls and precious stones rolled out upon the floor, and Hansel threw down one handful after the other out of his pocket. Then all their sorrows were ended, and they lived together in great happiness.</p>"}