{"title": "The Happy Rattle", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Bee,Owl,Snake,Toad,Woodchuck,Woodpecker,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>Willie Woodchuck sat at the entrance of his burrow home whittling with a knife upon a tiny dried gourd, which is a type of fruit with a hard shell that is often used to make things.</p><p>“What are you making?” asked Timothy Toad, as he hopped through the grass and sat in front of Willie.</p><img src='https://xcx.mdavid.cn/img/013.jpg'></img><p>“Oh, I am just whittling because I have nothing else to do!” replied Willie Woodchuck.</p><p>So Timothy Toad hopped on down the path until he met Eddie Elf.</p><p>“Willie Woodchuck is whittling because he has nothing else to do!” said Timothy Toad.</p><p>“I will stop by and see him!” said Eddie Elf. So Timothy Toad hopped along the path until he met Gerty Gartersnake.</p><p>“Willie Woodchuck is whittling because he has nothing better to do!” said Timothy Toad.</p><p>“I will go down that way and see him!” said Gerty Gartersnake, and she started down the path.</p><p>So Timothy Toad hopped down the path until he met Wallie Woodpecker. “Willie Woodchuck is whittling because he has nothing better to do!” said Timothy Toad.</p><p>“I will fly down and see him!” said Wallie Woodpecker, and away he flew. Timothy Toad hopped on down the road until he met Billie Bumblebee.</p><p>“Willie Woodchuck is whittling because he has nothing else to do!” said Timothy Toad.</p><p>“I will buzz down that way and see him!” said Billie Bumblebee, as he buzzed away.</p><p>When Timothy Toad arrived at his home his wife, Tilly Toad, was sweeping off the front steps. “What do you think, Tilly?” Timothy Toad cried, “Willie Woodchuck is, whittling because he has nothing else to do!”</p><p>“Dear me! You don’t say so!” cried Tilly Toad, as she stood her broom in the corner and started down the path. “I will hop down and see him!” she said.</p><p>“I will hop back with you, Tilly!” said Timothy Toad.</p><p>They had not hopped far before they met Eddie Elf, who was singing happily to himself as he walked along. “Willie Woodchuck is whittling on a rattle!” he said, when the two Toads stopped him.</p><p>“We are hopping back to see him,” said Tilly and Timothy Toad. “I will go back with you!” said Eddie Elf.</p><p>They had not gone far until they met Gerty Gartersnake, singing away very happily. “Willie Woodchuck is whittling on a beautiful red and black rattle!” said Gerty Gartersnake.</p><p>“We are going back to see him!” said Tilly and Timothy Toad and Eddie Elf.</p><p>“Then I will go back with you!” said Gerty Gartersnake.</p><p>They had not gone far until they met Wallie Woodpecker, who also was singing happily. “Willie Woodchuck is whittling on a rattle and it is blue, red and black and rattles beautifully.”</p><p>“We are going back to see him!” said Tilly and Timothy Toad and Eddie Elf and Gerty Gartersnake.</p><p>“Then I will go back with you!” said Wallie Woodpecker.</p><p>They had not gone far before they met Billie Bumblebee. “Willie Woodchuck is whittling on a beautiful yellow and blue and red and black rattle and it rattles beautifully.”</p><p>“We are going back to see him!” said Tilly and Timothy Toad and Eddie Elf and Gerty Gartersnake and Wallie Woodpecker.</p><p>“Then I will go back with you!” said Billie Bumblebee, so away they all went until they came to Willie Woodchuck’s home.</p><p>“Where is Willie Woodchuck?” they asked of Winnie Woodchuck, his wife.</p><p>“He has taken his beautiful new yellow and red and blue and black and white rattle, which rattles so beautifully, over to show to Grumpy Grundy, the Owl!” said Winnie Woodchuck.</p><p>“Then we will go there!” said the others.</p><p>“Then I will go with you!” said Winnie Woodchuck.</p><p>Grumpy Grundy, the Owl, was a very cross old creature, and if everything did not go to suit her all the time, she hooted and howled; in fact she had cried so much she had made large red rings around her eyes.</p><p>When Tilly and Timothy Toad and Eddie Elf and Gerty Gartersnake and Wallie Woodpecker and Billie Bumblebee and Winnie Woodchuck arrived at Grumpy Grundy’s place they heard merry laughter and whenever the laughter ceased, they heard the buzz and rattle and hum of Willie Woodchuck’s rattle.</p><p>So they went inside.</p><p>And there was Willie Woodchuck with the beautiful yellow and red and blue and black and white rattle, and when he rattled it Grumpy Grundy rolled on the floor and laughed until the tears ran from her eyes.</p><img src='https://xcx.mdavid.cn/img/014.jpg'></img><p>So they all lifted Grumpy Grundy on a chair and wiped her eyes and what do you think! the red rings around them were wiped away and she looked young and pretty again.</p><p>“Oh dear!” said Grumpy Grundy, the Owl. “I have never enjoyed myself so much before, and I will never be grumpy and be called a Grundy again! No sir! never!” and her eyes twinkled with merriment.</p><p>And all were greatly pleased at the great change in Grumpy Grundy.</p><p>Eddie Elf laughed, Tilly and Timothy Toad chuckled, Gerty Gartersnake giggled, Wallie Woodpecker beat a tattoo on wood, Billie Bumblebee buzzed and Winnie Woodchuck sang a woodchuck song.</p><p>And after that no one could say that Willie Woodchuck had nothing else to do, for he spent his time making beautiful “happy rattles” which he gave away to all the creatures, and everyone laughed and made merry whenever they heard the beautiful yellow and red and blue and black and white rattles which rattled so beautifully and drove away the grumpies.</p><img src='https://xcx.mdavid.cn/img/facebook.png'></img><p>VN:F [1.9.22_1171]- Total nr. of readings: 1,502 Copyright © The author [2014] All Rights Reserved. This story may not be reproduced without the express written permission of the author except for personal use. We would love your thoughts on this story in the comments section below</p>"}