{"title": "What happens to balloons?", "author": "Denise McCabe", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>Yey, it’s that time of year again for the party,’ the balloons shouted out in glee.</p><p>‘Finally we will get used, it’s been a long time sitting in this drawer,’ chuckled Green Balloon.</p><p>It was a lovely sunny day and the balloons were all excited as they queued up to get blown up for the garden party.</p><p>‘Oh I wonder will we get more floaters this year?’ asked Red.</p><p>‘What does that mean?’ whispered Blue Balloon.  He was part of a new packet and this was his first time at an outside party.</p><p>‘You tell him,’ mumbled Orange.</p><p>‘It’s when a gust of wind comes and takes balloons away,’ replied Red Balloon.</p><p>‘And what happens then?’ asked Blue.</p><p>‘Ehh, it’s not good,’ Red sneered.</p><p> </p><p>Blue could hear whispers and chuckles as he waited nervously in the queue.</p><p>‘Hey, don’t listen to that Red, he’s always winding people up,’ said a Pink balloon to Blue. ‘You’ll be ok.  These parties are fun as the children come out and play with us.  It beats sitting in that drawer for the rest of the year.’</p><p> </p><p>After some time all the balloons were finally blown up and put in their places.  As they waited for the children, Red started to get impatient.</p><p>‘Hey, I should be first in the line when the children come, sure it’s always me they want,’ he boasted.</p><p>Red pushed between Blue and Pink and clumsily banged off all the other balloons.</p><p>‘Hey Red, stop that, we are getting loose!’ Pink shouted angrily.</p><p>Suddenly a gust of wind came and Blue could feel his string getting detached. Slowly he could feel himself rise up up in the air.</p><p>‘Oh no, help!’ he called out.</p><p>The balloons all looked up as Blue was floating away.</p><p>‘Hey, if you make it back, let us know how you got on!’ Orange yelled.</p><p>‘Yup – never going to see him again,’ snorted Red.</p><p>‘Oh yeah, hope this is not like last year when we lost three comrades,’ sighed Orange. ‘That was not a good year.’</p><p>‘Hey party is starting,’ yelled Red as he pushed in front of all the balloons and let out a fart.</p><p> </p><p>Blue was still in the sky floating up and up toward the clouds.</p><p>‘Oh, this is so scary. What is going to happen to me?’ he sobbed.</p><p>Just then he heard voices, ‘Hey, we have a newbie, come on, let’s go rescue him.’</p><p>Blue saw a yellow and white balloon coming towards him.</p><p>‘Are you ok?’ asked the White balloon.</p><p>‘Yes I think so,’ sobbed Blue. ‘I was at a party and got detached from my crew.’</p><p>‘Not to worry,’ assured White. ‘It happens all the time.  Stick with us and you’ll be ok.’</p><p>‘But I need to get back to the party,’ Blue gasped.</p><p>‘Ah, you’ll be alright if you miss the party,’ said White. ‘C’mon, follow us and we’ll show you something amazing.’</p><p> </p><p>Blue looked down at the city underneath and giggled ‘Everything looks so tiny.  Hey I see my friends at the party.  Oh what are the children doing?’ he gasped.</p><p>All the balloons at the party were bouncing and fleeing for help.  The children were playing a game of who can poke the most balloons. Red was bouncing on top of everyone trying to escape as the children ran after him laughing hysterically.</p><p>‘Oh, that does not look like a good game,’ he cried.</p><p>‘Nope, you are definitely not missing much there,’ Yellow chuckled. ‘C’mon, let’s go.’</p><p>‘But what do I do without my string?’ Blue asked.</p><p>‘It’s ok, we’ll keep you safe. Hey look at me,’ White giggled as he started bouncing up and down and round and round.</p><p>‘Oh that looks like fun,’ laughed Blue as he started to do the same.  ‘Yippee, I don’t need my string…weeeee!!!’</p><p> </p><p>Blue continued to follow Yellow and White as they floated up and up in the air.</p><p>‘Hurry, we’re almost there!’ yelled White.</p><p>Blue saw in front of him something white and fluffy.</p><p>‘What’s that?’ he gasped.</p><p>‘We call this a cloud,’ said Yellow. ‘Quick, let’s go through it before it blows away.’</p><p>Blue carefully followed White and Yellow through the cloud.</p><p>‘Ooh, this feels tickly and it looks like a yummy marshmallow,’ Blue described as he stuck his tongue out to taste it. ‘Ooh, but it tastes like hairy dinosaur feet and mouldy cheese!’</p><p>‘Oops should have warned you about that one,’ apologised White.</p><p> </p><p>Blue continued to float up and up into the sky and bobble and bobble along. He was amazed when he saw how bright everything around him was.</p><p>‘Hey, where’s the cloud gone?’ he called out.</p><p>‘Ah, this is the land over clouds called Missing Balloon Land. Isn’t it amazing?’ said White.  ‘Quick, follow us.’</p><p> </p><p>Blue followed White and Yellow and he could hear voices and lots of laughter.  As he got closer he could hear cheers.</p><p>‘Hey, we have another one!’ he could hear White saying.</p><p>Blue looked and saw balloons of all different colours everywhere.</p><p>‘Hey everyone meet Blue, he’s another lucky one we found,’ explained White.</p><p>All the balloons bounced up and down and round and round.  A purple balloon came over to Blue and said, ‘Ah the white sticky tongue. I take it White forgot to warn you about sticking it out on the cloud?’</p><p>‘Yes,’ Blue giggled. ‘I won’t be doing that for a while.’</p><p>‘Anyhow, welcome to Missing Balloon Land.  No balloon will ever blow away from here.’</p><p>‘So this is where you go when the wind takes you away. What do you do all day – should I go back and tell my friends?’ asked Blue</p><p>‘Ah this is the exciting part,’ replied Purple. ‘Every day here is like a party. We get to stay blown up and no more going into drawers and waiting for a party to start.’</p><p>‘And you can learn new tricks like this,’ interrupted White as he spun around and around as fast as anyone ever saw.</p><p>‘Wow, that is a great trick,’ squealed Blue.</p><p>‘Hey, let’s get this party started and show Blue how much fun Missing Balloon Land is,’ cried Purple.</p><p>‘Oh that sounds fun,’ Blue laughed as he bounced and rolled over to his new friends.</p><p>Everyone cheered and bounced and bobbled and Blue was the happiest balloon ever.</p>"}