{"title": "A Happy Summer Day", "author": "Wendy Lee Klenetsky", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>One Sunday afternoon last Summer, Bobby went to the park with his Mommy and Daddy. He saw his friends, and walked over to them.</p><p>Bobby and his friends played tag and hopscotch. They also took turns going on the swings and playing in the sandbox. Some girls jumped rope, and some boys had races. They were all having such a great time together.</p><p>Then after a while, Bobby wanted to go and be with his Mommy and Daddy. Because he was playing with other children, Bobby didn’t know that his parents had left the park.  When he turned around and saw that they were gone, Bobby started crying.</p><p>A police officer saw him and came rushing over to find out what was wrong with him. What could have happened to make that boy cry?</p><p>“My name is Bobby, and my Mommy and Daddy are LOST!” he said to the nice policeman. “I don’t know where they went. Can you help me find them?”</p><p>The policeman said to Bobby, “Bobby, let’s go to the bus stop. That will be a good place to wait for them. They will see us there”.</p><p>Then the policeman took Bobby to the bus stop.  Just as the policeman had said, he and Bobby waited together, and before long his Mommy and Daddy  got to the bus stop.  Bobby ran to them, and gave them each a big hug and kiss. The policeman said to Bobby, “See, Bobby, I TOLD you that they would find us at the bus stop and take you home. Right?!”</p><p>Bobby smiled and said “That’s EXACTLY what he said, Mommy and Daddy, and BOY was he right!”</p><p>Bobby’s Mommy and Daddy thanked the policeman for taking such good care of their boy. Then they took Bobby by the hand and headed for home.</p><p>When they got back to their house, Bobby smiled up at his Mommy and Daddy and said “This WAS a happy Summer day!</p>"}