{"title": "Happy Ending", "author": "Larry A. Kayser", "level": "9 to12,Teen,", "category": "Funny,Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>No, you’re not reading this story backwards. Thanks to my parents, “Happy Ending” is my name. Yep. That’s why I was Happy as a lark when our morning newspaper, The Publi City Seeker, announced a contest. “Five hundred dollars to the person with the best name in town.” My brother needed a new wheelchair, but my family couldn’t afford one. I just had to win that money for him. Then my smile faded. There was a list of some of the people being considered. Dustin Attic, Fran Tick, Barb Dwyer, Stan Dup, Paulette Mego, Vincent Agift, Sam Pul, Rob Banks, Lee King, Adam Zapple. They were on the list. I was not.</p><p>You see, Publi City tends to attract folks with great names. You’ve heard of Eileen Dover and her husband Ben? They live here. So do Anne Teek, Lisa Carr, Polly Ester, Myles Long and Rick Shaw.</p><p> </p><p>At the school bus stop, I usually watch Derrick Krane, Ella Vaidre, Duane Pype, Barry Kade, Alaine Clozur and Bill Ding at a nearby construction site. Today, I had to turn away.</p><p> </p><p>On the bus, Mendy Sox, Alf Abet, Stu Pendus, Barbie Dahl, Denton Fender, Morris Better and Cher Toize were bouncing out of their seatbelts. They had all heard about the contest. So had Larry Ette, Drew Gunn, Morrie Spect, Hugo Furst, Manny Kinn and Alma Knack. Wonda Whye couldn’t understand all the fuss.</p><p> </p><p>We drove past Tim Burr Landscaping, where Pete Moss, Forrest Ranger, Rose Busch, Will Ting, Moe D’Laune and Lief Blower work. They all have super names.</p><p> </p><p>We picked up Anna Mull near the zoo. The veterinarian there is Les Payne. His helpers are Alba Tross, Rhoda Hource, Tad Poll, Don Key, Bob Katz and Ellie Phant. Cousins Liz Arrde and Sally Mander run the reptile house. I’m not sure what Dinah Sawyer does. She’s been around since the Dawna Tyme.</p><p> </p><p>As the driver, Avery Goodman, waited for Jay Walker to cross the street, I saw Clara Nett, Sarah Nade, Bea Miner, Kurt Incall, Dan Singh, Kerry Okie and Carol Singer go into the Amanda Lynn Strummer Music Hall.</p><p> </p><p>It was worse at school. Everyone was running all over the place, except for Salvatore Hizpance. He stayed seated. Gladys Eeya was too wound up to say hello. Ivana Duwell crossed her fingers. Lance Lyde, Pam Perd and Jack Pott thought they’d get most of the votes. Alfredo Nuttin was confident. Lew Zerr and Lois Steem complained that they never win anything. Lucy Lastik almost jumped out of her gym shorts. The only one who remained calm was Mel Lowe.</p><p> </p><p>In the lunchroom, Chuck Waggen, Sue Shi, Marge Errin, Frank Furter, Roland Buter, Vinny Gerr, Mack Aronie, Ann Chovey, Hal Ebutte and May O’Nays gulped down their food, then talked about the contest. Lou Steeth and Bev Ridge sipped juice while Harriet A. Burger. Stewart Ichoke gagged with excitement. Carmela Korn, Hazel Nutt, Cheri Pye and Dixie Kupp even skipped desert. After swallowing a Candi Barre, Ima Hogg chased Ray Zenz.</p><p> </p><p>I asked everybody, except Anita Schaur, Dee Zaster and Yuri Pulsive, if they felt I had a chance to get that wheelchair. Janice Notshurr had no idea. Bess Twiches and Jenna Rossity offered assurance. Xavier Bredth told me to forget about it. A girl said “Hope U. Wynn”, but she was Faye Kinnit. Doris Schutt ignored me. For once, bullies Terry Fie, Ruth Lis and Dick Tator didn’t bug me. Katie Didd.</p><p> </p><p>It was no better after class. Althea Thoon waved goodbye as she hopped onto her bike. Reed Enrite, Hy Marx and Paige Turner joined Noah Lott in the library. Matt Triss took a nap. Ali Bye made up an excuse and left. Neil Downe was praying for good luck. Molly Kuehl read a science book. Wanda Rinn went for a walk. Owen Moore was at his part-time job. Ty Knotts had to get to a Boy Scout meeting. I could not find Van Ishe anywhere. Holly Dai hadn’t gone to school at all.</p><p> </p><p>The results were to be printed in the Eve Ning edition of the Seeker. At home, I listened to radio station WISE while waiting. That was not too smart. Raynor Schein and Augusta Wynde forecast the weather. Sports are covered by Vic Torrie, Leo Tarrd and Jim Nayseum. Mike Rafone plays songs. Joe Kerr does comedy.</p><p> </p><p>Who would get the most votes? That was the big question. Speaking of questions… Isabel Ringen? Lucia Wayout? Juan Tuhelp? Mae I. Gonow? Izzy Holme? Sheena Ghost? Harold R. Yew? Jaunita Ryde? Candice Waite? Watson Yurface? Dewey Hafta?</p><p> </p><p>The Hugh Mungus number of great names was Justin Credibul! When the paper came, I forced myself to look. Was I, Happy Ending, winner of the five hundred dollars?</p><p> </p><p>Nope. It was my brother, Surprise.</p>"}