{"title": "Hero Man – Episode 3: The Haunted Cave", "author": "Varun, aged 9", "level": "3 to 5,6 to 8,", "category": "By Children,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Chapter 1 – Million Dollar ticket</p><p>Vroom! Ralph hit the ball and ran for the first base. He was safe. It was summer and he was playing baseball with his friends, Michael, Jack, Steve and Robin. Ralph was expecting another mission but it hadn’t come, so he wanted to explore the jungle called River Safari.</p><p>He wanted to see if there are any missions to do. His friends also wanted to go with him.</p><p>“Guys!” Ralph’s mother shouted.</p><p>Ralph stopped and shouted “What’s the matter, Mom?”</p><p>Ralph’s mom called him and his friends to come inside. When Ralph and his friends entered, they saw that Ralph’s mom was so cheerful.</p><p>She told them that they had won a million-dollar grand prize and that was when they bought a lottery ticket! They were going to River Safari and they had five tickets and it was one for each of them.</p><p>Ralph and his friends shouted “YAY!”</p><p>Mom said that they were going to leave at 12:00 A.M. and then Ralph and his friends started discussing what to do there.</p><p>“We will explore the River Safari!”  suggested Mike.</p><p>“We could live there for five days!”  said Steve.</p><p>“Can’t we just go to a special place?” asked Jack.</p><p>“We can explore the haunted cave,”said Robin.</p><p>“That’s perfect, Robin,” said Ralph.</p><p>“YESS!” they all shouted …………….</p><p>Chapter 2 – The Plan</p><p>It was midnight, 11:30 and Ralph was driving his friends to Austin Airport. Finally they reached the airport. The wind was so chilly and breezy that they ran with their suitcases. Ralph’s luggage was heavy because he had his Hero Man suit and his other items. They took their tickets, went inside the airplane, and off they flew …..</p><p>“Roar!!!” the airplane sounded. Ralph and his friends reached their stop, Hodgenville, Kentucky.</p><p>“Where is River Safari?” Michael asked.</p><p>“I think it is near 65 Market Street,” Ralph guessed.</p><p>They went to the location that Ralph had guessed and sure enough, he was right.</p><p>They went to take their coupons and rented a cabin.</p><p>Then they discussed how to kill the deadly soldier in the haunted cave.</p><p>They started a brainstorming list of ideas and their idea was like this –</p><img src='https://xcx.mdavid.cn/img/hc-300x175.png'></img><p>“That’s a perfect plan guys,” Ralph said.</p>< Smack > they did a high five.<p>Steve said “um, guys, I am feeling a little nervous, what if the soldier cooks us for his meal?” Everybody laughed.</p><p>“If we all work together, we can do anything,” Ralph said. The rest of them shouted, “Yes Ralph…….”</p><p>Chapter 3 – Time for Battle</p><p>Ralph was disguised as Hero Man and he was with his friends, searching for the deadly soldier in the cave, suddenly something appeared near them.</p><p>It was the deadly soldier.</p><p>His appearance was shocking because he had a werewolf face, skeleton body, and a ghost’s legs (actually he had no legs at all!)</p><p>Suddenly the soldier spit out something smoky and everyone covered their noses.</p><p>But Hero Man used his Ice Blast to clear out the smoke and then he tried to burn the soldier but the fire didn’t work on him.</p><p>But Hero Man didn’t give up, he used every power he had and they didn’t work on him either.</p><p>Then Hero Man remembered how to kill the soldier.</p><p>It was – To kill the deadly soldier of River Safari you must mix the ice and fire to kill the deadly soldier and it must be 75 degrees hot and 50 degrees cold….</p><p>So Hero Man concentrated on how to do that while the rest were fighting with the deadly soldier’s cronies and when they were finished, Hero Man shot a power mixed with ice and fire. The mixed ball of power reached to the deadly soldier’s chest, but nothing happened to him! So Hero Man started flying toward the grossest pool [it had carbon di-oxide] and the deadly soldier followed him. Suddenly, Hero Man gave a jerk in his flying speed, causing the deadly soldier to fall in the pool and drown. Hero Man and friends waited for his another attack. Michael said, “I guess that he’s dead.”</p><p>The others agreed.</p><p>They smacked a high five.</p><p>When Hero Man was going, he found something shiny and grabbed it……..</p><p>Chapter 4 – Returning Home</p><p>The next day Ralph and his friends were at the airport. They took their tickets and went to their airplane.</p><p>After sometime they reached their hometown, Austin, Texas and they went home on Ralph’s car.</p><p>When they reached home, their Mom asked “so how was trip?”</p><p>“It was nice Mom,” Ralph said.</p><p>“Bye Ralph,” their friends said.</p><p>“Bye guys,” Ralph said.</p><p>Then Ralph went to the bath and when he was finished he sat down to read a newspaper of his picture when he brought freedom at River Safari. He decided to hide it.</p>"}