{"title": "The Heart of Christmas", "author": "Brendan Farrell", "level": "6 to 8,", "category": "Christmas,Modern,Original,", "tag": "Bird,Robin,", "length": "05 - 10 mins,10 - 15 mins,", "body": "<p>Santa was feeling tired. He was sitting on a park bench feeding bread to the pigeons when the thought struck him hard.   He didn’t want to be Santa anymore; he’d been too long at it!   All that climbing down chimneys and ‘ho ho ho’-ing was beginning to wear him down.   It was time to quit; time to hand over Rudolph’s reins to somebody else.   What people didn’t seem to realise in the world was the Santa was more than just a part of Christmas, like holly with red berries, or rich Christmas pudding, or golden turkey or Christmas crackers, or a choir singing ‘The holly and the ivy’.   The truth was (and only a very few people knew it!) that none of these things would exist without Santa.   Santa was the centre core of it all.   Santa was like the boss of a gigantic world-wide company – a company that distilled the water so that it made the grass grow in a special way at Christmas or arranged the sunlight that shone through the window on Christmas morning while presents were being opened.   Without him it would curl up and die and December would be as drab as January.   No magic sparkle from a Christmas bauble, no secret tasting of a piece of pudding on Christmas Eve, no unbelievable excitement in the heart of a child.   To put it simply, No Santa – No Christmas.</p><p>Santa’s heart was heavy, but he knew he had to go, to give the job to someone else, but who?   That was the question.   Santa thought long and hard and deeply about this question.   When people were driving to work in the morning Santa was thinking and when Santa was thinking, little pieces of Christmas glitter would fall from the sky.</p><p>Santa liked to take long walks in the country and it was on one of these walks that he got his idea.   Christmas, which Santa held in his heart … a heart which he held fully open like an umbrella covering the whole world every December 25th … Christmas, Santa decided could only be given to someone who would continue to cherish and safeguard it as he had done all his life.   Santa didn’t know of any human on the whole planet earth that he could entrust Christmas to, so Santa decided that he would give Christmas to a creature from the animal world.   But which animal?   There were birds and bats and foxes and lizards and frogs and toads and cats and dogs and a list that went on and on.   In the week before Christmas when the spirit of Christmas was starting to fall down on the earth like an invisible snow, Santa took a long walk through a forest watching the animals.   In the end Santa settled finally and definitely on one animal and it was a bird – the robin red-breast.</p><p>Three days before Christmas when the snow came and Santa was walking by a fast flowing river, a robin came to Santa and landed on his forefinger and Santa knew this was the one.   This was the robin he would give Christmas to.   So Santa closed his eyes and touched the tiny head of the robin.   As Santa let go of Christmas it poured into the robin – everything that Christmas ever was or would be from the magic in the child’s eye to the sound of Christmas carols in a church covered with snow flowed into the tiny robin.   These things all had an ingredient without which they would be nothing and it was Santa, the heart of Christmas, it was all things Christmas and Santa gave it all to a red-breasted robin.</p><p>The result was that Santa was no longer Santa, he was simply Nick, and the red-breasted robin was a very special robin.   The robin knew this immediately, and he knew that Christmas that year depended now on him.   But the robin knew it was an impossible task for him to fulfil the role of Santa.   How could he – a tiny bird – get presents to every child in the world on Christmas Eve just as Santa had done since Christmas began?   The robin didn’t know how it was possible to do this but he loved the feeling of having all of Christmas inside him and as he bounced off the rooftops and set a burst of whistling into the snowy air with two days to go to Christmas he, like Santa, had an idea.   The robin knew that Christmas would have to be given to a person and since Santa was tired and didn’t want the job anymore the robin would have to find someone else.</p><p>In the meantime the robin knew he would have to fly around the world scattering Christmas everywhere, which he did, and all the time as he was doing this the robin wondered ‘who would be the new Santa?’</p><p>A speckled pigeon went scurrying for a piece of bread, keeping one watchful eye on the raggedly old man who threw the bread to him – it was Nick and he had his head bent low as he sat on the park bench.   A torn newspaper lay on the ground and from Nick’s eyes tears were falling, splashing onto it.   ‘Oh no’ he said in a quiet whisper.   ‘Oh no’ he repeated.   ‘What have I done?   Santa is no more… Santa is no more…’ he said the words aloud and they seemed to echo off the rooftops and up into the sky.   ‘This isn’t right’ he clenched his teeth and wiped his eyes with the sleeve of his old coat.   He realised he’d made a mistake.   He was Santa – he couldn’t just give up being Santa!   There was only one thing for it.   He’d have to find that robin.   He started to run through the park, calling ‘Robin red-breast, robin red-breast… wherever you are, come back to me, come back to me…’</p><p>Meanwhile, in another park, the robin red-breast was watching another old man.   The man looked to the robin like a good prospective Santa – he had a rosy-cheeked face which was covered with a beautiful white beard – so he decided this man was the right one.   The robin flew down from a tree and landed on the man’s shoulder, but the man was asleep and didn’t even notice.   The robin lifted its tiny head and let out a long shrill whistle while he let go of the spirit of Christmas from himself and let it pour down into the old man.</p><p>The man woke with a startled look on his face.   He knew something had happened to him but he didn’t know what it was.   He looked around him half expecting to see a wizard or something because he felt absolutely filled with magic.   He went running through the park – half-crazed, with every inch of his body bursting with the spirit of Christmas.   The flicker of his eyebrow was carol singers singing ‘In Excelsis Deo’ in a boy’s voice so sweet it would melt your heart.   The stamping of his feet was Santa’s reindeers treading the air on a snowy December 25th.   His breath was the breath of Santa which if bottled could be sold for a million dollars to a rich man on a hot summer’s day.</p><p>Back in the other park Nick was still running and calling for the robin red-breast to come back to him.   The entrances to the two parks met the same road and as the two men reached the gates they caught sight of one another.   Trance-like now, they walked towards each other and met face to face.   Nick was the first to speak. ‘Have you seen him… have you see him?’ he said.</p><p>‘Who?’ asked the second man.</p><p>‘The robin, the robin, the robin red-breast…’ said Nick.</p><p>The other man shook his head ‘No…’</p><p>The two men stood looking at each other.   ‘Who are you?’ said Nick.</p><p>‘I’m Jack’ said the other man.   ‘I’m nobody special… but something’s happened to me… I don’t know what it is that happened to me, but something did …’</p><p>Nick stared at him for a long time ‘I know who you are’ he said eventually.</p><p>‘Who am I?’ asked Jack.</p><p>‘You’re Santa’ replied Nick.</p><p>‘I’m Santa you say.   Hah … I’m not Santa!   I may look like Santa – but then so do you …’ said Jack.</p><p>‘I was Santa…’ said Nick sadly.</p><p>‘What happened, tell me’ said Jack.</p><p>They sat down together on a park bench and Nick told Jack his story about what it had been like to be Santa and how he had foolishly grown tired of it and given it all away.   Jack looked at his hands.   He didn’t know what to say.   His hands seemed to glisten with a Christmas glow.   Behind the two men was a holly bush with red berries on it and on one of the branches of the bush sat a robin.   The robin flew over and landed on Jack’s shoulder.   The robin cocked his head and looked at Jack.    Jack suddenly understood everything so he reached out his hand and let Christmas go.   It flowed like a silver river into the robin, through him and back into Nick, the real Santa.   Jack didn’t want to be Santa, he wouldn’t know how to be Santa, but he liked the fact that he had been Santa for a little while and when it all left him a small fire still burned inside him and he was a very happy man.   Santa was also happy as he’d been given a second chance.   Tears of joy were flowing down Santa’s face as he realised what a terrible mistake it had been to give up being Santa and how glad he was to be back in the job he loved!</p><p>It was Christmas Eve night and the snow was falling from the sky.  In a small park Santa’s sleigh was slowing descending from the sky and it landed on the snow encrusted grass.   Santa let go of the reins and got out of his sleigh.   He walked over to a park bench.   Jack was sitting there.</p><p>‘Hello, Jack’ said Santa.</p><p>‘Santa’ Jack said, smiling.   ‘You’ve come back!’</p><p>‘Jack, my friend’ said Santa, putting his hand on the man’s shoulder.   ‘You gave me back all my joy and saved me from a life of misery … will you do something else for me?’</p><p>‘What’s that?’ asked Jack.</p><p>‘Come with me’ said Santa.   ‘Come with me into the air above the world and help me bring Christmas to everyone.   What do you say?’</p><p>Jack was delighted to be invited on such a wonderful trip and so he climbed aboard Santa’s sleigh and they flew off into the sky.</p><p>That year all the children got extra special presents, because Santa was saved by Jack.   They both travelled to a billion homes around the world on Christmas Eve and in every single one of those homes Santa left a special note to the children saying how glad he was to be Santa and that he would never tire of bringing the spirit of Christmas and, of course, Christmas presents to them.</p><p>Santa was saved and so the heart of Christmas still beats.</p>"}