{"title": "Hero Man – Episode 2: The Cambria World", "author": "Varun, aged 9", "level": "3 to 5,6 to 8,", "category": "By Children,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<h2>Chapter 1 – A U.F.O.</h2><p>It was a beautiful, spring day in 74 Austin Street and Ralph was playing baseball with his friends. They were Robin and Jack. They knew that Ralph was a super hero named as Hero Man. He once defeated the scientist cats, when they made a bomb blast. Now, Ralph was waiting for his second mission.</p><p>“Come on guys, let’s get in,” said Ralph. “It’s cloudy.”</p><p>Just as they were about go in, Robin screamed “YIKES, WHAT’S THAT?”</p><p>A large U.F.O appeared from nowhere. “It is a U.F.O!” screamed Jack.</p><p>It was large as ten houses. It landed on hill. A man with a hat covered with stars, a cloak, and a wand came flying with something magnetic on his feet. Then he landed near Ralph, Robin and Jack. The wizard’s dress said Cambria World. He was the Wizard of the Cambria World and he was staring at them.</p><h2> Chapter 2 – The Wizard in Trouble</h2><p>The friends were stunned for a moment. Then Ralph spoke. “I am Ralph and these are my friends Robin and Jack. Who are you and why you are here?”</p><p>The wizard said in a deep voice. “So you are Hero Man.”</p><p>“Yes, and again I ask, who are you?” Ralph said.</p><p>The wizard said “I’m the wizard of the Cambria world and I need your help”.</p><p>“Why?” Ralph asked.</p><p>“An evil witch named Spakey has been killing the people of our country,” answered the wizard. “He has very powerful magic. We can’t stop him. So I came here looking for Hero Man and I finally found you. Will you come?”</p><p>“Sure, I will come. But what is the Cambria world?” Ralph asked.</p><p>“It’s an enchanted world” the wizard said. “Now come.”</p><p>“Wait a minute,” said Ralph. “Can my friends come too?”</p><p>“Sure,” the wizard said.</p><p>“Come on guys, let’s go,” said Ralph.</p><p>He quickly changed himself into Hero Man.</p><h2>  Chapter 3 – The Cambria World</h2><p>As they entered the U.F.O., the wizard spoke: “Actually this not the U.F.O, it is the Cambria Spaceship. “</p><p>“Oh ok,” said Hero Man, “sorry to say that” then the spaceship began to rise and then took off. Within minutes it landed in the Cambria World. It was chilly and breezy.</p><p>“It is so beautiful,” Robin said. “What is this? It is midnight.”</p><p>“Yeah ….. What? It’s midnight!” screamed the wizard suddenly.</p><p>“What happened?” asked Hero Man.</p><p>“It is midnight and Spakey can get more power and he can defeat anybody at this time,” said the wizard.</p><p>“But not me,” said Hero Man.</p><p>Suddenly, something swooped down and laughed manically at them. It was Spakey</p><h2> Chapter 4 – Battle Time!</h2><p>“Oh no,” the wizard said.</p><p>“Ha ha ha ha,” laughed Spakey manically.</p><p>“Battle with me, Spakey!” Hero Man shouted.</p><p>Spakey laughed. “Battle with me! Ha ho check this out….. Ha!”</p><p>Hero man was shooting his Fire Blast. They both started the battle. Hero Man was fighting. In the middle of the fight, Hero Man said, “Go to Spakey’s hiding place and find the valuables he stole from the castle”</p><p>Robin said, “Ok.”</p><p>Robin and Jack started to run and the wizard flew with them. Then, Hero Man used the Ice Blast and Spakey was on freeze. After sometime he became a normal human being, when Hero Man saw his friends and the Wizard returned.</p><p>He saw a gold medallion in the Wizard’s hand. Hero Man saw that it was glowing brightly.</p><p>“This is sacred Strength Medallion,” said the wizard. You may come to my castle for…… a surprise.”</p><h2> Chapter 5- We Are Heroes</h2><p>Then, the Wizard led Hero Man and his friends. When they went inside they were shocked, the castle was filled with dance, fun, and food.</p><p>“Please come to my throne,” said the wizard, then he called to everybody and they were absolutely still.</p><p>“In honor of Hero Man, Robin and Jack, I give a freedom for everybody.”</p><p>“Yipee!” cheered the crowd.</p><p>“Can we go now?”  asked Hero Man.</p><p>“Sure,” replied the wizard.</p><p>In an instant Hero Man and his friends had disappeared and Hero Man was Ralph again. He yawned and said “Bye, guys.”</p><p>“Bye Ralph,” Robin and Jack said together. “We will help you in your next mission.”</p><p>And it had been a long day for Hero Man and his friends.</p>"}