{"title": "Hero Man – Episode 1: The Scientist Cats", "author": "Varun, aged 9", "level": "3 to 5,6 to 8,", "category": "By Children,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>It was a hot, summer day and Ralph (Hero Man) was walking to his friend’s home.</p><p>“When is my first mission?” he wondered. While he was wondering, he heard people screaming and shouting. It was fire!!! Ralph quickly ran into his house. While he was running to his home, he called his friend, Robin. Ralph said “Hey Robin, I could be late for your magic trick, I’m sorry, bye.” Robin said “it’s ok, bye.”</p><p>When Ralph reached home, he took out his clothes and wore his armor, protective suit, wrist power watch, a GPS device, and lenses with a small alarm to know if he had another mission to do. So, he rushed to the Main Public Street (the place where the fire was.) There was so much fire that he couldn’t believe. So, he went inside, took out the trapped people and made sure that everyone was safe. He also combined ice & water then sprayed it over the damaged museum.</p><p>Then his alarm said “This fire was a bomb blast, it was the crime of three scientist cats, they are evil and they have so many powers than you, Hero Man. They live at the 74 East Street. They live in a building called Pleasant Apartments”.</p><p>Hmm,” thought Hero man, “so where is that Pleasant Apartments?”</p><p>He took out his GPS and set the route to 74 East Street, it was just 100.1 miles!!! So Hero Man used Reach Blast to get there quickly. When he saw a welcome board it said ‘Welcome to New York City,’ then he asked someone for routes. Hero Man asked “Where is the Pleasant Apartments?”</p><p>A man nearby said “It’s near the Subway Station.” Hero man said “Thank you very much”. The man said “You’re most welcome”. Then he headed down the street and finally reached the Pleasant Apartments.</p><p>Then he asked a girl who was walking-by “Where are the scientist cats?” Then she said “They live in the apartment 334.Why do you want to meet them?” she asked.</p><p>“I’m not going to meet them I’m going to crush them”. Then he explained how they made a building blast in his city.</p><p>“Oh, ok” said the girl.</p><p>Then Hero man ran upstairs and kicked opened the door.</p><p>“You are going to be arrested, scientist cats!” he said.</p><p>Then, his mind filled with power, strength and fury that he blasted all their powers. Then the cats started to run away. He chased the cats down the street, but he couldn’t catch up with them. So he used his Reach Blast and caught them. Then he took them to the jail and explained the officer how they blasted their building.</p><p>“You will pay for this, cats,” he said.</p><p>Then Hero man went to his home using his Reach Blast and changed himself into Ralph and called his friend, Robin.</p><p>He said “Sorry Robin I could not come for your magic trick. I will come next time”.</p><p>“It’s OK,” said Robin, “bye Ralph.”</p><p>“Bye Robin,” said Ralph. Then Ralph went to rest. That was the glory of Hero Man.</p>"}