{"title": "The Hummingbirds", "author": "Sharon Krager", "level": "3 to 5,6 to 8,9 to12,", "category": "Illustrated,Modern,Original,Poem,", "tag": "Bird,Hummingbird,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/image002.jpg'></img><p>My Grandma had two bushes just outside her kitchen window. They were beautiful. The bushes were called Rose of Sharon, with lots of light purple blossoms all over. They stayed on the bushes from July to early October, and we loved to watch the hummingbirds swarm around them every year.</p><p>In and out of the blossoms they would go. They fluttered from one bush to another back and forth with the sound of tiny wings going as fast as they could.. Grandma and I would sit in the swing on the porch. We would be very quiet and try not to move too much. The hummingbirds would not notice us sitting there watching them. Some of them were yellow and some of them were blue. We sometimes saw three or four of them at a time. How beautiful they were.</p><img src='https://xcx.mdavid.cn/img/image0042.jpg'></img><p>On my tenth birthday, my Grandma bought me a ceramic hummingbird. I was so very proud of that bird. I placed in high upon a shelf in my bedroom where no one would be able to bother it. That was the safest place I could find to keep it. When I was lying in my bed, I would watch that ceramic bird and think of the summertime when we watched the real ones flying round and round.</p><p>Grandma was a camera buff, and one quiet summer evening we were sitting in our usual spot on the porch. She had her camera with her and she took a picture of one of the hummingbirds in flight. It was the most beautiful picture that I had ever seen. She let me have it to put in my scrapbook and keep forever. That was a good keepsake for me.</p><img src='https://xcx.mdavid.cn/img/image006.jpg'></img><img src='https://xcx.mdavid.cn/img/image008.gif'></img><p>I always liked to spend time at Grandmas house.  We did lots of things together. I helped her water flowers and cut weeds in the yard. She always told me that if a hummingbird flies at you and looksyou right in the eye it was good luck. Well that is just what happened to me one day when I was helping her do things in the yard. I bent over to pick up some broken branches and when I stood up, there it was. One of those wonderful birds flew up and stayed in the air looking me right in the eye.  Its little wings were fluttering to beat the band. They were faster than I could ever see them.  It was like magic to me. My heart skipped a beat and I watched it as it went on about its business looking for more blossoms. I don’t know what kind of good luck I had after that day, but I will always remember that beautiful little bird caught in the air like a statue looking at me with those tiny black eyes and long pointy beak.</p><p>Summers came and went and as a young girl, going to Grandmas and watching those hummingbirds was the highlight of my visits with her. I still have the statue she gave me up on my shelf. Even though I am a little older now, we still like to sit on the porch swing and watch them flutter back and forth from one bush to another.</p><img src='https://xcx.mdavid.cn/img/image010.gif'></img><p>I never grow tired of watching the hummingbirds. Each year when they come back I am anxious to see them. That is when I always know that spring has arrived again.</p><p>When I am older and have grandchildren of my own, we will do the same thing that I did with my grandma. We will watch the hummingbirds flutter around from blossom to blossom and flower to flower.  They might come and feed at my little red feeders and stay around long enough for us to get a fleeting glimpse of the mystery of the precious hummingbird.</p><p> </p><p style=\"text-align: center;\"><strong>POEM: THE HUMMINGBIRD</strong></p><p style=\"text-align: center;\">Hummingbird, hummingbird, where do you go</p><p style=\"text-align: center;\">When you leave me every year,</p><p style=\"text-align: center;\">When winter comes to let us know</p><p style=\"text-align: center;\">Its great season now is here.</p><p style=\"text-align: center;\">Hummingbird, hummingbird, come back to me</p><p style=\"text-align: center;\">When sweet spring is on the hill,</p><p style=\"text-align: center;\">I love your fluttering pretty wings</p><p style=\"text-align: center;\">And I know I always will.</p>"}