{"title": "I am glad to be me", "author": "Shearon Hurst", "level": "9 to12,Teen,", "category": "Instructional,Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>One day while sitting on the porch steps I begin to wonder about how simple life would be if I were someone else.  How could I have allowed my life to be such a mess?  So many problems, so many decisions, and so much pressure I could barely lift my head up sometimes.  Yesterday, my life was so alive and carefree.  Now, hanging out with my friends after choir practice, and deciding where to meet for the next church outing seemed so far away.  Gosh, it’s not easy being thirteen.  No one seems to understand how I feel or what I’m going through.  I know it will be a waste of time talking to my mother about my situation and the many things happening to me.  She will never understand or have the time; she always appears to be so busy.  Oh well, I guess I’ll just have to sit here and try to figure things out for myself.</p><p>I started to get up and realized I couldn’t go back into the house now; they’re expecting my aunt to come over with her new baby soon.  They may ask me to help do something, and I didn’t feel like doing anymore cleaning.  Mom had us cleaning for days, and I will never understand why.  Nobody will be looking at the house, and surely the baby won’t care whether or not the house is clean.  Speaking of the baby, here’s my aunt with her now.</p><p>Little Angee is such a beautiful baby, and she always appears to be so happy.  That’s it, that’s the answer to my problem.  How simple my life would be if I were a baby.  No problems, no pressure, and no decisions to make.  Just thinking about it brought a smile to my face.  Nothing to do except be pampered and adored all the time.  Someone would feed me, give me a bath, clothe me, and I would get all the attention I needed.  What a wonderful feeling that must be.</p><p>Everybody was rushing out of the house to see the new baby.  See what I mean? Everybody wants to see the baby.  Man, that baby has got it made. They all decided to sit outside on the porch for a while and enjoy the beautiful weather. You’ve got to be kidding me, all that house cleaning gone to waste.  Someone needs to go inside and appreciate how hard I worked for this visit.  Everyone’s gathering around little Angee now, and this baby loves every minute of it.  I don’t blame her; I would too.  So many arms to conquer, and so little time to do it; life comes at you fast.</p><p>I declare that baby can “coo” and giggle on key.  Oh, why couldn’t that be me?  It’s just not fair.  She hasn’t done anything to deserve all that attention.  Oh, oh, something’s wrong, little Angee isn’t giggling anymore.  And I notice the relatives slowly passing her from person to person trying to get her calm.  Now they’re talking in some ridiculous baby voice while asking her, “What’s wrong precious?”  Why are they doing that?  They know she can’t answer them.  Now they’re passing her back to her mother, and she too asks the same question.  Like me, little Angee must be tired of hearing it because she got even louder.</p><p>My aunt makes the decision that she must be wet, so she proceeds to stick her finger in her diaper.  Yuck!  How would she feel if someone did that to her in front of everyone?  How embarrassing!  I don’t think Angee liked it either because she raised her voice a little louder.  My mother asked my aunt if she was hungry.  Well, she wasn’t hungry; she had been fed just before they came over, and the finger in the diaper proved she wasn’t wet.</p><p>My aunt was somewhat flustered by now and once more asked, “Honey, what’s wrong?”  Little Angee kept right on crying.  I begin to notice how everyone started making excuses as they edged their way pass me to go inside.  I listened as some said they needed to get some water, use the bathroom; or it’s getting a warm.”  It wasn’t warm; it was February, and the people that went to the bathroom didn’t come back.  I guess any excuse was a good reason to get away from all that crying.  Angee’s mom stated pacing back and forth with Angee trying to get her quiet.  I begin to feel really sorry for little Angee.  It seemed as long as she was happy and giggling everyone wanted to be around her and hold her.  However, the minute things started going wrong, which led to her crying and becoming fussy they deserted her.</p><p>Wow, being a baby isn’t as wonderful as I thought it would be.  At least, I could talk, express how I was feeling, and let people know how I felt.  Little Angee couldn’t do that.  She couldn’t let them know how she felt, why she was crying, whether or not she was hungry or didn’t like what they were doing to her.</p><p>Soon only a couple of people were left on the porch with my Aunt.  Little Angee was calming down, so I thought I would ask my aunt what was wrong with her.  My aunt told me; sometimes too much attention isn’t good for you.  She said, all the passing around irritated her, and crying was Angee’s way of letting them know she wasn’t happy with it</p><p>”Little Angee had just taught me a couple of valuable lessons.  One, find a way to make those you care about, and care about you listen to what’s bothering you.  I would find a way to help my mother understand what I was going through.  No, I wasn’t going to resort to crying as my little cousin did to get my point across, but it’s important that she is aware of how I feel.  I will find a way.  Second and the most important lesson, I am so blessed to be who I am.  I never realized this or appreciated it before.  Unlike little Angee, I am able to express how I felt, and it’s time I started doing that more often.  I am so glad to be me.</p>"}