{"title": "Jampu Frog", "author": "Manjari Shukla", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Frog,", "length": "01 - 05 mins,", "body": "<p>Jampu frog was very naughty.</p><p>He followed a single daily routine. He used to jump in and out of the pond. He enjoyed the sound created by the splash and so he spent hours around that pond.</p><p>When all his friends used to rest on the soft green grass on hot summer noon, he used to ensure that he jumped from the highest possible point, so that more and more water could be splashed around.</p><p>In the process he enjoyed the most when huge drops of water washed the faces of all those enjoying sound sleep on the grass. The expressions of surprise and annoyance of all the faces gave him great pleasure.</p><p>He neither slept during the daytime nor could he see others sleeping comfortably on soft green grass.</p><p>His best friend Pampi always warned him-“You should not trouble your friends daily like this. Otherwise when you get into trouble, no one will come to help you.”</p><p>“Hahaha…then you also have it.” And Jampu used to throw water on Pampi’s face.</p><p>Finally Pampi stopped advising him.</p><p>One day when he was repeating his same favourite act of jumping in the pond, he stumbled while jumping from a high point. Before he could understand, he landed inside the jute bag of a man who was collecting grass near the pond.</p><p>He could hardly get any time to think, before that man sealed the mouth of the bag and left.</p><p>Jampu started trembling with fear.</p><p>After some time when the man reached home, he kept the bag near the entrance, had his food and went to sleep. Jampu found some space to pull his head out of the bag, and looked around. He recognized the man. He was the same fellow who came to the pond daily to collect grass for his goat. He took a sigh of relief and then started thinking. How to reach home? He did not know the way back but his only hope was this man lying on the bed.</p><p>He kept calm and decided to wait till morning. All through the night he felt ashamed of his mischief while praying for his own safety. All through the night he kept crying with hunger and thirst.</p><p>Next morning the man emptied the contents of the before his goat. Jampu used all his strength to stay attached to the bag and not fall on the ground. As soon as the contents of the bag were unloaded, the man put the empty bag on his shoulder and left the house. All along the way Jampu prayed that the man should reach his usual spot without stopping anywhere else.</p><p>As soon as he reached the pond and kept the bag on the ground, Jampu jumped out of the bag and with all his strength took a long jump. Within no time he was sailing on the water safely.</p><p>All his friends who were scared till now felt happy to see him back.</p><p>Jampu had now decided to behave as a good friend to all his mates.</p>"}