{"title": "How Johnny Cricket Saw Santa Claus", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Christmas,Classic,Illustrated,Original,", "tag": "Cricket,", "length": "05 - 10 mins,", "body": "<p>When the first frost came and coated the leaves with its film of sparkles, Mamma Cricket, Papa Cricket, Johnny Cricket and Grandpa Cricket decided it was time they moved into their winter home.</p><p>Papa and Mamma and Grandpa Cricket carried all the heavy Cricket furniture, while Johnny Cricket carried the lighter things, such as the family portraits, looking glasses, knives and forks and spoons, and his own little violin.</p><img src='https://xcx.mdavid.cn/img/044.jpg'></img><p>Aunt Katy Didd wheeled Johnny’s little sister Teeny in the Cricket baby buggy and helped Mamma Cricket lay the rugs and wash the stone-work, for you see the Cricket winter home was in the chimney of a big old-fashioned house and the walls were very dusty, and everything was topsy-turvy.</p><p>But Mamma Cricket and Aunt Katy Didd soon had everything in tip-top order, and the winter home was just as clean and neat as the summer home out under the rose bush had been.</p><p>There the Cricket family lived happily and every thing was just as cozy as any little bug would care to have; on cold nights the people who owned the great big old fashioned house always made a fire in the fireplace, so the walls of the Cricket’s winter home were nice and warm, and little Teeny Cricket could play on the floor in her bare feet without fear of catching cold and getting the Cricket croup.</p><p>There was one crack in the walls of the Crickets’ winter home which opened right into the fireplace, so the light from the fire always lit up the Crickets’ living room. Papa Cricket could read the Bugville News while Johnny Cricket fiddled all the latest popular Bug Songs and Mamma Cricket rocked and sang to little Teeny Cricket.</p><p>One night, though, the people who owned the great big old fashioned house did not have a fire in the fireplace, and little Teeny Cricket was bundled up in warm covers and rocked to sleep, and all the Cricket family went to bed in the dark.</p><p>Johnny Cricket had just dozed into dreamland when he was awakened by something pounding … ever so loudly … and he slipped out of bed and into his two little red topped boots and felt his way to the crack in the living room wall.</p><p>Johnny heard loud voices and merry peals of laughter, so he crawled through the crack and looked out into the fireplace.</p><p>There in front of the fireplace he saw four pink feet and two laughing faces way above, while just a couple of Cricket-hops from Johnny’s nose was a great big man. Johnny could not see what the man was pounding, but he made an awful loud noise.</p><p>Finally the pounding ceased and the man leaned over and kissed the owners of the pink feet. Then there were a few more squeals of laughter, and the four pink feet pitter-patted across the floor and Johnny could see the owners hop into a snow-white bed.</p><p>Then Johnny saw the man walk to the lamp and turn the light down low, and leave the great big room.</p><p>Johnny Cricket jumped out of the crack into the fireplace and ran out into the great big room so that he might see what the man had pounded. The light from the lamp was too dim for him to make out the objects hanging from the mantel above the fireplace. All he could see were four long black things, so Johnny Cricket climbed up the bricks at the side of the fireplace until he came to the mantel shelf, then he ran along the shelf and looked over. The black things were stockings.</p><p>Johnny began to wish that he had stopped to put on his stockings, for he was in his bare feet. He had removed his little red topped boots when he decided to climb up the side of the fireplace and now his feet were cold.</p><p>So Johnny started to climb over the mantel shelf and down the side of the fireplace when there came a puff of wind down the chimney which made the stockings swing away out into the room, and snowflakes fluttered clear across the room.</p><p>There was a tiny tinkle from a bell and, just as Johnny hopped behind the clock, he saw a boot stick out of the fireplace.</p><p>Then Johnny Cricket’s little bug heart went pitty-pat, and sounded as if it would run a race with the ticking of the clock.</p><p>From his hiding place, Johnny Cricket heard one or two chuckles, and something rattle. Johnny crept along the edge of the clock and holding the two feelers over his back looked from his hiding place….</p><p>At first all he could see were two hands filling the stockings with rattly things, but when the hands went down below the mantel for more rattly things, Johnny Cricket saw a big round smiling face all fringed with snow-white whiskers.</p><img src='https://xcx.mdavid.cn/img/045.jpg'></img><p>Johnny drew back into the shadow of the clock, and stayed there until the rattling had ceased and all had grown quiet, then he slipped from behind the clock and climbed down the side of the fireplace as fast as he could. Johnny Cricket was too cold to stop and put on his little red boots, but scrambled through the crack in the fireplace and hopped into bed. In the morning Mamma Cricket had a hard time getting Johnny Cricket out of bed. He yawned and stretched, put on one stocking, rubbed his eyes, yawned, put on another stocking and yawned again. Johnny was still very sleepy and could hardly keep his eyes open as he reached for his little red-topped boots.</p><p>Johnny’s toe struck something hard, he yawned, rubbed his eyes and looked into the boot. Yes, there was something in Johnny Cricket’s boot! He picked up the other boot; it, too, had something in it!</p><p>It was candy! With a loud cry for such a little Cricket, Johnny rushed to the kitchen and showed Mamma, then he told her of his adventure of the night before.</p><p>Mamma Cricket called Papa and they both had a laugh when Johnny told how startled he had been at the old man with the white whiskers who filled the stockings in front of the fireplace. “Why, Johnny!” said Mamma and Papa Cricket. “Don’t you know? That was Santa Claus. We have watched him every Christmas in the last four years fill the stockings, and he saw your little red topped boots and filled them with candy, too. If you will crawl through the crack into the fireplace you will see the children of the people who own this big house playing with all the presents that Santa Claus left them!”</p><p>And, sure enough, it was so!</p>"}