{"title": "The Jumping Match", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,Funny,Illustrated,", "tag": "Flea,Frog,Grasshopper,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/p129i.png'></img><p>The Flea, the Grasshopper, and the Frog once wanted to see which of them could jump the highest. They announced a competition and invited the whole world and every one else besides who liked to come and see the grand sight. Three famous jumpers they were, as all should say, when they met together in the room.</p><p>“I will give my daughter to whoever jumps highest,” said the King. “It would not be good for you to have the jumping and to have no prize.”</p><p>The Flea was the first to come forward. He was very well-mannered, and bowed to the audience on every side, for he was from a royal family and was used to humans.</p><p>Next came the Grasshopper. He was not quite as elegant as the Flea, but he knew how to behave himself, and looked well in his smart green uniform. He said as well that his family came from Egypt and were thought very highly of.</p><p>“And I sing so well,” he said, “that many other crickets, who sometimes hear me, are very jealous.”</p><p>This was how the Flea and the Grasshopper talked themselves up, each thinking himself quite suitable for the princess.</p><p>The Frog did not say a word, but people said that perhaps he was the best at thinking; and the house dog who sniffed at him seemed to think he was ok. A noisy old man in the audience was so taken by him that he kept saying the Frog could tell the future.</p><p>“I say nothing yet,” cried the King, “still I know what I think.”</p><p>And now the match began. The Flea jumped so high that no one could see what had happened, he never landed. So people said that he had not jumped at all—which was disgraceful after all the fuss he had made.</p><p>The Grasshopper jumped only half as high, but he leaped into the King’s face, who was disgusted by this.</p><p>The Frog stood for a long time, as if lost in thought, people began to think he would not jump at all.</p><p>“I’m afraid he is ill!” said the dog and he went to sniff at him again. Suddenly he made a sideways jump into the lap of the princess, who sat close by on a little golden stool.</p><p>“There is nothing higher than my daughter,” said the King; “therefore to jump into her lap is the highest jump that can be made. Only someone clever would ever have thought of that. Therefore the Frog has shown that he has sense. He has brains in his head, that he has.”</p><img src='https://xcx.mdavid.cn/img/p131i.png'></img><p>And so he won the princess and they lived together very happily most of the time.</p><p>“I jumped the highest, for all that,” said the Flea; “but I don’t care. The princess may have the slimy creature, if she likes. Being the best doesn’t always help you win. I am too good and light for this part of the world.”</p><p>And so the Flea went off to another country to find his fortune.</p><p>The Grasshopper sat by the bank of a river and thought about the world and its ways and said, “People only care about things that look pretty.” Then he began to sing – and it is from this Flea’s song that we have taken this little story.</p>"}