{"title": "Katie and Nicole", "author": "Natalie Rodriguez", "level": "9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "Over 20 mins,", "body": "<p>“Que?” [Translation: What?] I ask, and my eyes draw away from a marvelous colorful picture of SpongeBob Squarepants and his best friend, Patrick.  I drew this picture—a work in progress.</p><p>“I asked if you wanted any leche,” [leche means milk] my mom says with a stern tone.  I don’t like the sound of that.</p><p>“No, thank you, Mama.” I stack away my drawing and colored pencils. “I’m famished.”</p><p>My mom stares at me with her round, brown eyes. “Famished?” A small smile crawls upon her face. “Since when did you learn to use a word like that?”</p><p>I shrug, even though the following words do not back that up. “I used to hear Monica say it all the time to her mom.” I gather up my baby pink backpack and all-time favorite item—my SpongeBob and Patrick lunchbox—and rise. “Well, I’m ready for school.”</p><p>Monica Ford was the first person I met when my family and I had moved into the local suburban neighborhood.  She was tall, tan, and had skin smoother than a baby’s bottom.  After all, she did get me into the habit of rubbing baby lotion on my face, as though it were sunblock. But unlike me, forty-seven pounds and underweight at eight years old, Monica had extra meat on her bones.  She was not fat.  She just had something boys our age went crazy for, something I lacked in.  Boobs.</p><p>“My sister,” Monica said to me at recess one day, “says that at our age, we are supposed to start growing a set.”</p><p>“But what if we don’t…you know get them…at all…” I sounded like a tiny rabbit lost in the woods.</p><p>Monica stared at me with her baby blue eyes, a sight that made the boys bat their own eyelashes, before she said with that stern tone like my mom’s, “Like I said, at our age, we are supposed to.”</p><p>I had to use the bathroom.  My eyes watered up and Monica had noticed.</p><p>“It’s nothing,” I lied.   I must have stayed in that locked stall for a good ten minutes, crying.</p><p>Monica was suspended a few weeks later when she had flashed her set of twins to a boy of our age during recess one day, behind the baseball field bathrooms.  But he did not show his.</p><p>I stood guard with the boy’s best friend, Antonio,  who was also pretty white for a Mexican such as myself.  Monica also pointed out how she looked more “Mexican” than me. Antonio was the first to strike up a conversation.  He went on and on about last night’s math homework—division.  I nodded like I was listening.  He annoyed the heck out of my poor little burning red ears.</p><p>Before either of us knew, we had company. “What are you two doing over here?” It was Mrs. Affleck, one of the second grade teachers, giving us a fright and making us leap inches off the floor.</p><p>We were all sent to the front office.  The lady who always answers the phones called our parents.  The boy who saw Monica’s boobs burst into tears as soon as his mom stormed into the building and dragged him out to the car.  Once they were outside, I saw her grabbing a hold of his ear.  Antonio and I were let off of the hook, since we actually never saw anything.  We were ordered to report back to class.</p><p>Before I walked away, Monica stood up.</p><p>“Ouch!” I nearly bawled because her hands squeezed around my wrists.</p><p>“Call me later,” she said.  It was weird…she looked me dead in the eyes. “Okay.”</p><p>“I’m serious!”</p><p>“I said I will!” I winced and pulled away from her.  My wrists scorched like fire, turning redder by the second.  Tears swirled in Monica’s eyes. “Promise,” I said a moment later.</p><p>Then, as though on cue, her parents stormed in and screamed, mostly at Monica, using curse words and telling her how disappointed they were to learn of her behavior.  That last one, “You’re a disappointment to the family,” hit home for Monica.  She followed her parents without a sound.  I was amazed how she listened to them instead of stirring up a fight.  Each parent had a firm hold of her wrists.</p><p>What gets me was the fact that Monica never cried—at all.  I waited by the house phone for what seemed like hours.  I jumped to my feet whenever the telephone rang.</p><p>“Not for you, Katie,” my mom or dad informed me.</p><p>But when it was Monica who finally called, “Katie,” she said from the other line, “did you hear me?”</p><p>I did, but it could not be true.</p><p>“We’re moving, Katie,” she repeated. “For good.”</p><p>Then she burst into tears, and so did I.  We spoke for a few more minutes, until her dad shouted, “BED!”</p><p>It has been over a year since Monica and I last spoke.  It used to make me very sad to the point where I cried myself asleep.  It was like she died or something worse, which made me cry even more. I always choked on my own tears.  It worried my parents, who were tempted to send me off to a shrink (guess that is a bad thing since “shrink” was always whispered in our house).</p><p>“But she’s only a child,” I overheard my parents argue to each other.</p><p>Eventually,  I felt better.   I woke up a few minutes before my mom  came into my bedroom to wake me up for the day.  I functioned and attended school, completed homework and ate dinner every night with my parents and older sister, Luz, without bursting into tears.  I assumed it was just a phase…at least that was what my parents informed me.</p><p>“Sometimes,” my mom said to me one night, “not all of your friends are meant to be in your life forever.  People come and go.”</p><p>Luz once told me that I could just sit and wonder why this or that happened or turn to God and pray about my anger, sadness or whatever is bothering me. “God has better and bigger plans for each and every one of us.”</p><p>Oh, yeah!  I forgot to mention my family is very religious—all born and raised Catholic.</p><p>“Here we are,” my mom says as we pull up to the pickup/drop off zone, then she puts the Suburban into park. “Have a great day, sweetie.”</p><p>I stare out the passenger window at those bold burgundy letters imprinted atop the white building, where the stone staircase leads to Eagles Elementary School.   Today is the first day back, the first day of fourth grade.</p><p>Monica was my only friend here.</p><p> </p><p>I can already sense their eyes on me, but my mom says I am just being paranoid.  As we pull up into the line of cars where kids my age and older exit with backpacks, lunch boxes and even projects, my mom turns to me and says, “Nicole, you’re doing it again.”</p><p>Biting my nails.  Oh how much my mom despises when I do that.  She always says that boys hate when girls—especially my age—bite their fingernails like it is made out of taffy. “But taffy is GOOD.”</p><p>“Nicole…”</p><p>I take a few more nibbles, until she yanks my hand away from my mouth.  Being a multi tasker as well, she puts the Honda into park.  She turns to me, but I only stare out the passenger window, watching student after student roam the grounds.  That weird feeling comes back to the pit of my stomach like, I ate something sour and spicy.</p><p>“You know,” my mom says lightly, “you’re not the only one who’s starting their first day.  There will be other kids who are in the same spot as you today.  So…”</p><p>I say nothing, but I feel my eyes enlarge as they jump from person to person…groups of students…all with friends.</p><p>“I can go in with you, if you want.”</p><p>And my expression said it all.</p><p>My mom and I squeeze through the crowd, as I tug a hold of my backpack straps like I am about to take off into the sky.  We make our way to the front office.  Before I know it, we are at the counter where there are many elderly women with salt and pepper hairdos. “Excuse me,” my mom said all businessy, as if she was at an interview, and sets my school schedule down onto the counter. “My daughter, Nicole, is new here, and I was just wondering if anyone could show her around.”</p><p>“Room 20 is around the corner,” one of the women says and slides a sheet of paper in front of us.  It is a school map. “But, she’ll have to find help or find the room herself.  Our staff blocks off all classrooms until the bell rings.  Everyone waits in the cafeteria until they’re excused.”</p><p>And I am right, people look at me.  A girl with frizzy red hair and her circle of friends giggle and turn away from our direction.   A boy with jet black hair circles around the nearby pillar and sits back down with his friends, who all do a double—for some a triple—take on me.</p><p>This is so embarrassing. Nobody else is standing with their mom.  Just me.  I want to cry right here.</p><p>“Well,” my mom starts up as we approach an empty table in the back of the outdoor cafeteria, which has a blue and white theme, “some kids are just rude.  Not offering to help you out.  Don’t ever be like them, Nicole.”</p><p>“I’m not mom—”</p><p>“They’re all just a bunch of spoiled brats.”</p><p>I notice there are a few parents present.  Several of them glance our way as if shooting laser beams out of their eyes.  When they see my mom looking their way, most of them turn their backs to us.  One couple even forces their son to move to a different table.  I just sit there, side by side with my mom, and sigh.  This will be a long day.</p><p>“Well,” my mom starts up again, “you know how to read maps.   See that room right there?”</p><p>I nod…on the verge…no not now…holding back the tears.</p><p>“Right, um, well just follow that path here…”</p><p>As my mom goes on, thinking I am listening, I notice a new set of eyes on me from across the room.  And she heads our way…</p><p>Everything appears in slow motion as this skinny, short, pigtailed girl, who must be my age, stops at our table. “Excuse me,” she squeaks.  It takes me a moment to realize that this is her real voice. “I overheard you earlier about finding Room 20.  I have the same class.”</p><p>My mom perks up and smiles, as does this strange girl.  On the other hand, I am too busy to notice anything but this girl’s SpongeBob Squarepants themed backpack and metal lunch box. It makes me smile, because I have an I Love Lucy metal lunch box at home.</p><p>“I’m Katie,” she says.</p><p> </p><p>That Nicole is sure a quiet one.</p><p>“I’m Nicole,” she says.</p><p>As soon as the bell rings for the day to begin, her mom, who Nicole definitely has the same Snow White skin and cherry lips, turns to me. “Take care of my little Nicole.  Thank you for wanting to help her out.”</p><p>Why wouldn’t I help out?</p><p>“I just remember what it was like to be new myself.” (Oh, did I ever).</p><p>On my first day of school at Eagles Elementary, as a first grader, I met Monica Ford. Our teacher, Ms. Gata, asked Monica if she could show me around the grounds.  To be honest, I do not know exactly how Monica and I became friends.   She was silent, until we passed by certain destinations. “Over there are the bathrooms we use during lunch and the volleyball court. We can’t pass that hill over there; they monitor us all around.”</p><p>She kept talking and talking and would not shut up.  I was a ghost from there on out.</p><p>By the time Nicole’s mom leaves and the rest of the student body heads off to class, I look at Nicole, who tightens her fingers around the bottom of her backpack straps.  There are waves of crinkles on her forehead, exactly like the ones my mom gets whenever she goes outside for a quick cigarette smoke. “Don’t tell dad,” she always tells me.</p><p>“I know I said that my name is Nicole,” her voice tunes me back in, “but sometimes, people call me Nikki for short.”</p><p>She is silent and gazes at me.  It takes me a moment to see her hand sticking out for a shake.  For whatever reason, I stare at it, like it belongs to Frankenstein, until, “It’s nice to meet you, Nikki.”</p><p>And we officially meet once we shake hands and head off to class.</p><p> </p><p>I am tempted to say something else for a continuous conversation with this bubbly blonde hair creature, called Katie.  She guides me through another swarm of students, some of whom do a double take (I can feel their eyes peel and unpeel off of me), then directly to Room 20, where a line of our classmates already wait. “Here we are,” she says as we reach the back of the line.</p><p>I cannot help but squeeze harder onto the ends of my backpack straps (now it truly feels like I am about to skyrocket to the moon).  I can taste the sour and spicy bubbles in the back of my mouth.  Before I turn to vomit, a very pretty lady—a spitting image of that one young starlet who won a bunch of awards for her work in that one film—unlocks the door to Room 20.</p><p>“That’s Mrs. Grimes,” Katie fills me in, like we are on some secret top mission. “From what I’ve heard, she’s super nice!  And she loves Betty Boop and I Love Lucy—a lot.”</p><p>I cannot help but smile as Mrs. Grimes opens the door and kicks down the door stop to our classroom.  She welcomes us with a warm kind smile. “Come on in.”</p><p> </p><p>The first day of fourth grade is, pretty much, the same as any other first day of school. Since Mrs. Grimes announces that she has yet to assign us an actual seating chart, Nicole and I find empty desks in the back row of the tiny classroom.  Mrs. Grimes talks real fast (probably a mom and wife, too), but I catch the information about what we are going to learn this year.  I am pretty stoked about next semester’s project of the wax museum figures.  It is a project that every student has to complete in order to graduate to the next class level.  I have seen the older kids do it before.  They dress up as a historical figure such as Abraham Lincoln or Amelia Earhart, and stand very still, until someone “pushes” a sticker that serves as a button on their costume.  Once their button is “pushed,” they give a speech in character and tell who they are, for what they are well known, and so forth.  Last year, I pushed a girl’s button, and she perked up, and then spoke with a southern accent, “I used to star on my own Disney Channel TV show.  Fun fact: I sang the show’s theme song.”  I forgot the name of the show.</p><p>Mrs. Grimes passes out a double-sided sheet of paper with questions that we are to answer individually.  She tells us to take our time, because, after all, we have only another three and a half hours until school comes to an end.  The first day of school is always the shortest.  Luz promised she would take me to McDonalds later for a Happy Meal (I heard it comes with a Shrek action figure).  I take out a number two pencil, as Mrs. Grimes hands me a paper. “Thank you,” I say.</p><p>I glance over to my left side and that small smile of mine immediately vanishes.</p><p>Nicole is as still as a boulder at the edge of a cliff.  Her hands are locked together, just sitting on top of her sheet of paper.  My eyes scan around and see the rest of our classmates are trying to stay awake.  Most are in a rush to answer the questions on the white sheet of paper.</p><p>With the temptation to speak, the words are on the tip of my tongue, until Nicole pulls out a blue pencil pouch from her backpack.  Next, she takes out a teal lead pencil, that has one of those gummy thingies on the grip, so one’s hand will not hurt as they write.  Monica used to slip those gummy grips onto all of her pencils, complaining that her hand hurt.</p><p> </p><p>Question 1: Name?</p><p>Nicole…</p><p>I hesitate and think real hard on this one, until I jot down…</p><p>De Los Reyes. Question 2: Age? Easy!</p><p>9 years old. Question 3: Birth date?</p><p>July 7th, 1992.</p><p>Yeah, that is right.</p><p>As I continue to answer the list of questions—most ask about my favorite things such as books, movies, color and food—I cannot stir away the thought of my dad.</p><p>Usually, I slept like a baby, but when I heard my bedroom door creak open one cold night… “Shh-shh,” my dad said and sat at the edge of the bed.</p><p>I rubbed the sleepy dust out of my eyes. “Hi, dad.” It was only moments before I saw the suitcase at his feet. “Daddy…what’s going on?” “Daddy’s going away for a while…” “Where?”</p><p>On cue, his forehead crunched up like an infant getting their monthly shots.  I sat up straighter; we found ourselves locked in a hug, holding on for dear life.  We remained in each other’s arms for a while—crying too.</p><p>“I’m sorry, Nicole.”</p><p>And that was the last time I ever saw my dad, Ricardo Diaz. My parents never got along.</p><p> </p><p>I stared at the clock on the wall that is above the shiny sink: the big hand struck the twelve.  YES!  It was now 11am.  So far, Mrs. Grimes went over math problems and before that, she showed us her former students’ work as examples for our own upcoming projects.  But the only thing that stuck with me was the fact that Nicole had been extra quiet since Mrs. Grimes collected our questionnaires minutes ago.  I asked if she was okay and even tried to see what she put down for numbers seven and twelve, to get a laugh out of her; but nothing.</p><p>Nicole returned from the bathroom ten minutes after leaving.   Some heads, including Mrs. Grimes, turned to look; but most end up looking back at the overhead that projects our notes onto the white board.  I volunteered to show Nikki where the bathroom was, but Mrs. Grimes is one of those teachers who do not like to have friends tag along with each other during class session.  She is probably afraid that friends will never return to class.  After Nicole hung up the bathroom pass—a big paddle with the words “Bathroom Pass – Room 20—onto the door hook, she took her seat.  I caught Vicki, Sierra and Amy, who all look identical with their long red hair, as though they are part of a cult, shoot dirty looks at Nicole and snicker a bit.</p><p>But why?  She never did anything wrong to them.  In fact, she made no attempt to talk to anyone else, except for me.  Their behavior made me angry; and I saw my fingers curl into miniature boxing gloves.</p><p>Nicole sniffles, and the row in front of us, including myself since it tunes me back into present time, do a double take toward her; only, my eyes stay on her.   Her eyes are red and watery.  I glimpse around the room.  Everyone is at work and Mrs. Grimes continues to chatter away about how to find the answer to question twelve.  Oops, I thought we were still on number eight.</p><p>Forget it.  I am already too far behind to scribble down the answers.  So, I lean in and ask,</p><p>“You okay?”</p><p>“Shh,” one of the cult girls in front of us says, with her finger against her lips.</p><p>I stick out my tongue as soon as the Manson girl turns away (I watched a two-hour documentary on the Manson girls—and she like one of them).   At first, I am unaware that sticking out my tongue actually makes Nicole chuckle. “Now I’m okay,” she says with a nod and sniffles back the tears.</p><p>I smile back.</p><p> </p><p>Oh, goodie!   Only half an hour to go before the bell rings.   After my return from the bathroom, where I broke down in one of the stalls (thank God the bathroom was empty) I did not expect Katie and I to actually…bond.</p><p>Math wraps up around 11am.  Mrs. Grimes takes the hint and stops talking, due to the many half shut eyes and pouty lips in the class she sees.  She calls it a day and pops in the movie, The Mouse and the Motorcycle.   Most of my classmates move to the back of the room for a better view of the TV, that hangs on the wall.  Katie and I laugh at the funny looking—not to mention—talking mouse.   The film receives a few gasps and “ewweeessss” because of the cheesy special effects and the fact that a boy wants to befriend a mouse, named Ralph.  If I ever saw a talking mouse, I would run away and scream at the top of my lungs.</p><p>We are unable to finish the film due to time.  There are a few “ahhs” when Mrs. Grimes ejects the video from the VCR.  The bell rings, and now my classmates holler and cheer. “Hip hip!” a boy in a Godzilla T-shirt riots up.</p><p>“Hooray!” the class chants back, including Katie and me, as we all walk out.</p><p>“See you all tomorrow!” Mrs. Grimes shouts after us.  We all wave goodbye. “Have a great rest of the day!”   For the first time, I notice her empty left ring finger (so not a wife— maybe not a mom either).</p><p>It must be a habit of mine—assuming that all ladies are tied down—as my mom once put it, “If a woman is not married by a certain age…”</p><p>“What?  What happens?” I had asked (all I needed to see was my mom’s eyes roll). But, then again, my mom is also no longer married.</p><p>“Bye, Ms. Grimes,” I tell her.</p><p> </p><p>Nicole and I follow additional students to the front of the school, where most parents already drive off after their sons or daughters hop into the cars.  A lot of students assemble into a line.   Two young workers, in matching navy blue collared shirts, guide the group to the after school day care, which is next to the main building.  Nicole and I are lost in conversation.  It is nice.</p><p>I ask, “Have you read the book?”</p><p>“No,” she says. “But, at my other school, I did a report on Ramona and her Father.  I really liked it.”</p><p>I flinch.  She reads…for fun.</p><p>“Do you read on your own time?” she asks.</p><p>“No.” I try my best to not look so grossed out. “I’m not really a fan of books.  Though my sister says those Harry Potter books are good.”</p><p>And, boy, does this get her chatty, as she goes on and on about how she read all of them. “There’s another book coming out soon!” Her best fan girl moment. “Last time, my mom took me to the midnight arrivals at the book store.  I just love them!  All of them!”</p><p>We wait underneath the oak tree.  Nearby are a few other students; some stand alone.  I continue to listen.  But when she starts on the book character names, I cannot help but pitch in, “The Weasleys?  Hermione?  Harry?  At least, Ron is the most normal one…”</p><p>“Yeah, but he’s a wuss!  He freaks out over everything!”</p><p>“Are your parents big readers?” I ask, to keep my fair share in the ongoing conversation. Bump!  She gets teary—and blood—red eyes again.  I cannot help but wince, ready to spit out an apology, until…“Kind of,” she finally replies and gives a small sniffle. “I sometimes see my mom reading magazines, but that’s pretty much it.  And…” She goes mute for a moment.</p><p>“…my dad…”</p><p>A car horn honks.</p><p>I lean in closer; but she struggles to speak; the words do not come out.  Then, another car honk, followed by, “Nicole!”</p><p>We see her business dressed mom, waiting in the line of cars at the drop off/pickup zone. My mom and sister drop me off and pick me up in this area too.  Nicole’s mom waves at me along with her, “Hello.”  I return the same gesture.</p><p>Nicole sighs and tugs onto her backpack straps.  Before she walks away, she turns her back to her mom, and then faces me. “Thank you.  I’m really glad to have met you today.”</p><p>I feel a warm feeling spread through me, like melted butter on homemade bread. “You want to meet tomorrow?”  It is all I can ask.</p><p>She smiles. “I’d like that.  Where?” “How about right here?”</p><p>She scans around.   We both see her family van inching closer to the front of the line.</p><p>“Okay.”</p><p>“Okay,” I repeat but with a smile. “See you tomorrow then.”</p><p>And off she goes, as I wait for my ride.  Before I know it, our family Honda pulls up into the driveway, at the back of the line.  I see Luz, who waves me over.  I grip nice and tight onto my belongings.  Mcdees </p><p> </p><p>I jump into the passenger seat and buckle up.  When I look at my mom, whose eyes are on me like a hawk, my smile vanishes. “What?”</p><p>My mom smiles and puts the car back into drive. “Nothing,” she says. “You just look really happy.”</p><p>Oh, how my mom could just burst into tears…but happy tears.  For the first time, I feel that way too.  I set a hand upon hers and return the hopeful smile. “I have a feeling that things will get better.”</p><p>Now, she really stifles back the tears and nods. “Me too, baby.  Me too.”</p><p>I look out the passenger window and catch a glimpse of Katie running by.   My eyes follow her over to a gray Honda, which pulls up directly behind our black Suburban.   As my mom waits for the cars in front of ours to leave, I gaze out the back window.</p><p>Katie buckles herself in, as she and the pretty brunette, of whom she looks exactly like a miniature version, exchange a few words.  Katie’s eyes soon find mine, as my mom and Katie’s sister both press their feet down onto the gas pedal and pull out into traffic.   We lead.   They follow us.   For a brief moment, it is just us two as though we are the only nine year olds on Earth.  Katie flashes her teeth at me; and I do the same before my mom makes a left turn, and they turn right.  We drive away and cut off a few other angry and impatient drivers, but even at a distance from that gray Honda, I know that Katie’s eyes are still with mine.</p><p>Their horn blows.  I see Katie waving over her shoulder. “Don’t think about it,” my mom says, until, “Alright, just once.”</p><p>Beep!</p><p>But I keep my hand on the horn, laughing out every bit of joy that suddenly rushes over me. Usually, my mom would smack my hand away.  But this time, she just watches me and shakes her head with a small laugh.</p><p>It will all be alright.  We will all be alright.</p>"}