{"title": "Kayla’s Holiday Surprise", "author": "Artie Knapp", "level": "6 to 8,9 to12,Teen,", "category": "Instructional,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Kaylas-Holiday-Surprise-opt.jpg'></img><p style=\"text-align: center;\"><strong>Illustration by Sunayana Nair Kanjilal</strong></p><p>After the final bell rang the students were reminded that there was no school on Monday.</p><p>“Enjoy your extra day off,” said the teacher to her class.</p><p>As the students reached for their backpacks a young girl asked her friend,</p><p>“What is Labor Day again?”</p><p>“I’m not sure,” said the young boy. “I just know we get an extra day off from school.”</p><p>An extra day of fun suited Kayla just fine. She loved breaks. In fact, recess was Kayla’s favorite part of the school day. After the school bus dropped Kayla off, she ran into the arms of her mom.</p><p>“How was school, Kayla?” asked her mom.</p><p>“It was great, Mom. I am excited about no school on Monday.”</p><p>“You just started back to school two weeks ago. Already in need of a break, huh?” asked Kayla’s mom with a laugh.</p><p>Kayla smiled at her mom. She picked up a basketball that lay on the edge of the driveway. She dribbled it a couple of times and then swish! A perfect shot!</p><p>“Great shot, Kayla!” said her dad.</p><p>“Thanks, Dad” said Kayla.  “Hopefully my friends can come over and play basketball this weekend!”</p><p>“I’ll call their parents and see, Kayla” said her mom. “Your homework needs to come first, though.”</p><p>Kayla said that she wasn’t assigned any homework for the holiday weekend. So, she was going to have as much fun as possible.</p><p>Kayla slept in the next morning. Saturday was her favorite day of the week. It rained most of the day, so Kayla enjoyed playing video games inside. On Sunday, her friends came over and played basketball for several hours.</p><p>Then it was Labor Day, you know, that extra day off that Kayla was so looking forward to. But Kayla was awakened early that morning by her dad. He told Kayla that in honor of Labor Day, the family would be cleaning both inside and outside the house. Kayla couldn’t believe it. This was a holiday. A day where she was supposed to be enjoying freshly squeezed lemonade while playing in her tree-house.</p><p>As Kayla wiped her eyes, she began to wonder if this was just a bad dream.</p><p>“Kayla, your breakfast is ready. We have a lot of work to do today. Let’s get a move on,” said Kayla’s mom.</p><p>Okay, it was not a bad dream after all. For Kayla, it was a nightmare.</p><p>Kayla stumbled into the kitchen, still sleepy from being waken up so early. As she sat down at the kitchen table, Kayla calmly asked her parents: “Are you serious about working today? Isn’t Labor Day a holiday?”</p><p>“Yes, Kayla. It is,” replied her dad. “But your mom and I thought working hard today would make you appreciate why Labor Day is observed in the first place.”</p><p>Kayla’s mom went on to explain that Labor Day is a holiday to honor the hard work that people do throughout the year.</p><p>At first, Kayla felt disappointed about having several chores to do. First up, was helping to dry and put away the breakfast dishes. After that, Kayla helped give her puppy a bath. She scrubbed and scrubbed. It was hard work. But it was also a lot of fun. Kayla was covered in just as many soap suds as her puppy. Then it was on to yard work where Kayla helped to pick up sticks. She pretended that the smallest ones were basketballs, as she shot them into a large trash-can.</p><p>Kayla felt proud at how much better the yard looked. Her puppy enjoyed it too, as he ran around chasing a stick she threw him. When she was done with her chores, Kayla enjoyed relaxing in her tree-house. The lemonade tasted wonderful after a hard day of work.</p><p>The next day Kayla’s teacher asked her students what they did on their extra day off. Twin brothers Matt and Mark shared that they went boating with their family. A young girl, Cassie, said that her family had a picnic at the lake. When Kayla talked excitedly about her day her classmates were surprised. Not because of all the work she had to do, but because of how much fun she had doing it.</p>"}