{"title": "Keep out of Trouble", "author": "Amelia Chambers", "level": "Teen,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>“Go straight home Joe.  Keep out of trouble!”  Sergeant Murphy’s deep voice echoed down the narrow street.</p><p>Thirteen-year-old Joe fully intended to go straight home.  His near brush with the law for the minor infringement of riding a bicycle on the pavement would be a lesson.  He knew he had escaped lightly with a friendly warning from the community officer.  Thank goodness he was a friend of his father’s and neither knew of his more nefarious activities!</p><p>To date he had avoided any contact with the authorities and he intended to remain undetected for his petty crimes!  Pushing back his long, lank, black hair he clambered on his “borrowed” bicycle and pedalled down the street, head down against a growing gale.</p><p>Rain’s on the way, he thought and pedalled harder.</p><p>A cloud burst in the grey sky and huge drops of cold water fell onto Joe’s bare hands gripping the handlebars.  He shivered involuntarily.  His navy hoodie and worn denim jeans gave little warmth against the harsh Irish weather.  Not wanting to become drenched, he decided to take shelter in an abandoned Victorian house on the outskirts of the village.  Once a family home, the occupants had long gone and it had fallen into ruin.  He’d been to the old house before, therefore thought nothing of cycling up the narrow pathway of the overgrown garden, entering the property.  Trees with withered branches, lined his route, swaying in the buffeting wind.  When he reached the imposing entrance Joe abandoned the bicycle on the path, ran up the steps of the porch and pushed the unlocked front door wide open.</p><p>Ignoring the creaking hinges Joe tumbled through the doorway into a large, dark hall.  He stood quietly to catch his breath and allow his eyes to acclimatise to the black interior.  The last time he had been in the house was in the middle of summer, when sunlight had blazed through the broken windowpanes casting patterns on the tiled floor.  Now the atmosphere was completely different.  He could hear the rain pelting on the windows and the wind howling through the chilly corridor.  An eeriness engulfed him and he shivered involuntarily.</p><p>“Perhaps this wasn’t such a good idea after all,” he muttered, the sound of his own voice offering little assurance.</p><p>The wooden door groaned under the force of the gale and he turned to shut it plunging the house into an inky blackness.  “No not a good idea, at all,” he murmured, purposefully widening his eyes to peer into a room to his right.  The house remained mute.</p><p>Feeling his way though the open doorway, the door long gone, leaving copper hinges hanging on the jamb, Joe made his way into a high ceilinged room with mullioned windows, through which dim shafts of light landed in small droplets on the red-brick floor.  Several of the tiles were cracked, some had even been removed.  Joe’s sneakers stuck uncomfortably to the tacky tiling and he stared uncomprehendingly at the strange graffiti scored into the walls: black spirals, alongside weird red and orange, unintelligible symbols.  They were a new addition since the summer too. Silver-grey cobwebs hung from the ceiling, cascading down the walls and windows, creating a curtain of animated gossamer.  An array of dead flies and weevils lay rotting on the filthy windowsills.  Large drops of rain bounced off the grimy glass, a timpani of ominous throbs.</p><p>A shimmer of movement shattered the blackness.</p><p>“What was that?”  Joe turned swiftly.</p><p>A large, black rat scurried out from his hidey-hole stopping in the centre of the long lost lounge.  He sniffed the air, his nose and whiskers twitching, his yellow, beady eyes surveying the room.</p><p>Joe bolted back into the hallway, his momentum ploughing him through the door of the room opposite.  Rats!  He hated rats!</p><p>Was being alone in this abandoned house with a nest of rats preferable to being out in a storm?</p><p>His heart beating fast, a sudden clatter of metal on ceramic tile caused Joe to stop in his tracks.  He stood stock-still.  He barely breathed.  His mouth was dry.  His whole body trembled.  His senses strained to hear and see into the blackness of the second room.</p><p>A cloying odour invaded his nostrils.  A strong pungent smell.  Yuk!  His nose wrinkled and he involuntarily put his hand to his mouth.  A chill breeze blew across his fingers.  Another clatter of metal on tile screeched through the darkness.  Joe screamed and fell to the floor.</p><p>He didn’t land on the cold broken floor.  To his surprise he fell onto a soft, damp cushion.</p><p>What on earth?</p><p>His hands involuntarily grasped the wadded, musty material.  It was dark in colour and the shape was indiscernible. The smell was disgusting.  Joe gagged and hurriedly clambered to his feet.</p><p>“I’ve gotta get out of here.”</p><p>His fall had disorientated him.  In the blackness of the room he’d no idea where the door was located.  He opened his eyes wider again in the hope he could discern some shapes, some recognisable forms.</p><p>A sudden flash of lightning lit up his environment. But instead of finding himself alone in a room, a mirror image of the rat infested lounge, the unexpected light revealed a monstrous, shadowy shape of a man bearing down on him.  Joe shrieked in terror.  He spun away from the immanent threat and, panic-stricken, ran in the opposite direction.</p><p>Terrified beyond senseless, a boom of thunder coincided with his collision into a wall.  He crumpled to the floor.  Heavy sobs built up in his throat.  He had entered a nightmare.  Stumbling and scratching at the walls, Joe struggled to his feet.</p><p>“You’ll hurt yourself badly, if you’re not careful,” a reassuring voice whispered in his ear.</p><p>Torchlight suddenly shone in Joe’s face.  He squinted and the circle of light dropped slightly illuminating his immediate surroundings.</p><p>Paddy Kelly, Joe’s older cousin and partner in crime stood before him.</p><p>“You gave me quite a scare,” chuckled Paddy, a lad of seventeen going on seventy.  “I thought you were the cops!”  He shone the torch on the far wall revealing a web of cracked and falling plaster surrounding a large marble fireplace.  Joe quickly surmised Paddy, masked in an old dark green anorak and tattered khakis, had been removing the ornamental, stone mantelpiece.  The clatter of metal on tiles had been Paddy’s hammer and chisel, the tools of his criminal trade, when they had fallen to the floor.</p><p>Paddy grinned, revealing unsightly, yellow teeth.  “I’ll get a good price for it.  These old houses are filled with treasures.”  He bent down and placed the torch on the floor so it strategically shone on his handiwork.  He then picked up tools and began to chip away at the undamaged plaster.  With each crunch of the hammer, the fireplace loosened.</p><p>Joe smiled and in a tone of bravado, he far from felt, said, “I’ll keep watch.”  He did not want to admit he had been as frightened as Paddy – if not more so.</p><p>“Fair play, my lad.  They’ll be a few euro in it for you, as usual,” Paddy muttered, hitting the chisel with a firm thump of his hammer.</p><p>Now fully cognisant of the room, which had once been a second lounge, Joe turned towards the door only to see a dirty, old duvet on the floor.  He realised this was the cause of the offensive smell and deduced Paddy would later use it to wrap up his ill-gotten gains.  He wiped his hands on his trousers and re-entered the hallway.  Slowly he pulled open the large, wooden door, aided by the pressure of the wind and rain.</p><p>A dark, upright figure stood silently before him.  Joe’s mouth dropped open and a scream struggled in his throat.  His body shook and terror engulfed him once again as the tall figure on the porch towered over him.</p><p>“Spotted the bike outside. Very similar to one just reported stolen.”  Sergeant Murphy’s baritone revealed the true horror of Joe’s situation.  The burly policeman peered into the darkness over Joe’s trembling shoulder.  “But what are you up to in here?”</p>"}