{"title": "King O’Toole and his Goose", "author": "Joseph Jacobs", "level": "6 to 8,9 to12,", "category": "Celtic,Classic,Folk Tale,Irish,", "tag": "Goose,", "length": "05 - 10 mins,", "body": "<p>OCH, I thought all the world, far and near, had heard of King O’Toole—well, well, but the darkness of mankind is untellable! Well, sir, you must know, as you didn’t hear it before, that there was a King, called King O’Toole, who was a fine old King in the old ancient times, long ago; and it was he that owned the churches in the early days. The King, you see was the right sort; he was the real boy, and loved sport as he loved his life, and hunting in particular; and from the rising o’ the sun, up he got, and away he went over the mountains after the deer; and fine times they were.</p><p>Well, it was all mighty good, as long as the King had his health; but, you see, in the course of time the King grew old, he became stiff in his limbs, and when he got older in years, his heart failed him, and he was at a loss for a distraction, because he couldn’t go a-hunting no longer; and, by dad the poor King was obliged at last to get a goose to amuse him. Oh, you may laugh, if you like, but it’s truth I’m telling you; and the way the goose amused him was this-a-way: You see, the goose used to swim across the lake, and go diving for trout, and catch fish on a Friday for the King, and flew every other day round about the lake, entertaining the poor King. All went on mighty well until, by dad, the goose got old in years like her master, and couldn’t occupy him no longer, and then it was that the poor King was lost entirely. The King was walking one morning by the edge of the lake, lamenting his cruel fate, and thinking of drowning himself, that could get no enjoyment in life, when all of a sudden, turning round the corner, whom should he meet but a mighty decent young man coming up to him.</p><p>“God save you,” says the King to the young man.</p><p>“God save you kindly, King O’Toole,” says the young man.</p><p>“True for you,” says the King. “I am King O’Toole,” says he, “prince and plennypennytinchery of these parts,” says he; “but how came you to know that?” says he.</p><p>“Oh, never mind,” says Saint Kevin.</p><p>You see it was Saint Kevin, sure enough—the saint himself in disguise, and nobody else. “Oh, never mind,” says he, “I know more than that. May I make bold to ask how is your goose, King O’Toole?” says he.</p><p>“Goodness, how came ye to know about my goose?” says the King.</p><p>“Oh, no matter; I was given to understand it,” says Saint Kevin.</p><p>After some more talk the King says, “What are you?”</p><p>“I’m an honest man,” says Saint Kevin.</p><p>“Well, honest man,” says the King, “and how is it you make your money so easy?”</p><p>“By making old things as good as new,” says Saint Kevin.</p><p>“Is it a gypsy you are?” says the King.</p><p>“No,” says the saint; “I’m no gypsy by trade, King O’Toole; I’ve a better trade than a gypsy,” says he—”what would you say,” says he, “If I made your old goose as good as new?”</p><p>My dear, at the word of making his goose as good as new, you’d think the poor old King’s eyes were ready to jump out of his head. With that the King whistled, and down came the poor goose, just like a dog, waddling up to the poor cripple, her master, and as like him as two peas. The minute the saint clapped his eyes on the goose, “I’ll do the job for you,” says he, “King O’Toole.”</p><p>“By Jaminee!” says King O’Toole, “if you do, I’ll say you’re the cleverest fellow in the seven parishes.”</p><p>“Oh, by dad,” says St. Kevin, “you must say more than that—I’m not so soft,” says he, “as to repair your old goose for nothing; what’ll you give me if I do the job for you? That’s the question,” says Saint Kevin.</p><p>“I’ll give you whatever you ask,” says the King; “isn’t that fair?”</p><p>“Nothing fairer,” says the saint, “that’s the way to do business. Now,” says he, “this is the bargain I’ll make with you, King O’Toole: will you give me all the ground the goose flies over, the first offer, after I make her as good as new?”</p><p>“I will,” says the King.</p><p>“You won’t go back on your word?” says Saint Kevin.</p><p>“Honor bright!” says King O’Toole, holding out his fist.</p><p>“Honor bright!” says Saint Kevin, back again, “it’s a bargain. Come here!” says he to the poor old goose—”come here, you unfortunate ould cripple, and it’s I that’ll make you the sporting bird.” With that, my dear, he took up the goose by the two wings—”Criss o’ my cross an you,” says he, marking her to grace with the blessed sign at the same minute—and throwing her up in the air, “whew,” says he, just giving her a blast to help her; and with that, my jewel, she took to her heels, flying like one of the eagles themselves, and cutting as many shapes as a swallow before a shower of rain.</p><p>Well, my dear, it was a beautiful sight to see the King standing with his mouth open, looking at his poor old goose flying as light as a lark, and better than ever she was; and when she lit at his feet, patted her on the head, and “My Darling,” says he, “but you are the darling of the world.”</p><p>“And what do you say to me,” says Saint Kevin, “for making her the like?”</p><p>“By japers,” says the King, “I say nothing beats the art of man, apart from the bees.”</p><p>“And do you say no more nor that?” says Saint Kevin.</p><p>“And that I owe you,” says the King.</p><p>“But will you give me all the ground the goose flew over?” says Saint Kevin.</p><p>“I will,” says King O’Toole, “and you’re welcome to it,” says he, “though it’s the last acre I have to give.”</p><p>“But you’ll keep your word true,” says the saint.</p><p>“As true as the sun,” says the King.</p><p>“It’s well for you, King O’Toole, that you said that word,” says he; “for if you didn’t say that word, there was no chance your goose would ever fly again.”</p><p>When the King was as good as his word, Saint Kevin was pleased with him, and then it was that he made himself known to the King. “And,” says he, “King O’Toole, you’re a decent man, for I only came here to test you. You don’t know me,” says he, “because I’m disguised.”</p><p>“Musha! then,” says the King, “who are you?”</p><p>“I’m Saint Kevin,” said the saint, blessing himself.</p><p>“Oh, queen of heaven!” says the King, making the sign of the cross between his eyes, and falling down on his knees before the saint; “is it the great Saint Kevin,” says he, “that I’ve been talking with all this time without knowing it,” says he, “all as one as if he was a lump of a lad?—and so you’re a saint?” says the King.</p><p>“I am,” says Saint Kevin.</p><p>“By Japers, I thought I was only talking to a decent boy,” says the King.</p><p>“Well, you know the difference now,” says the saint. “I’m Saint Kevin,” says he, “the greatest of all the saints.”</p><p>And so the King had his goose as good as new, to occupy him as long as he lived; and the saint supported him after he came into his property, as I told you, until the day of his death—and that was soon after; for the poor goose thought he was catching a trout one Friday; but, my goodness, it was a mistake he made—and instead of a trout, it was a thieving horse-eel; and instead of the goose killing a trout for the King’s supper—by dad, the eel killed the King’s goose—and small blame to him; but he didn’t eat her, because he dared not eat what Saint Kevin had laid his blessed hands on.</p>"}