{"title": "King of the Jungle", "author": "Joy Moore", "level": "3 to 5,6 to 8,9 to12,", "category": "Instructional,Modern,Original,", "tag": "Lizard,Monkey,Sloth,Tiger,Turtle,", "length": "01 - 05 mins,", "body": "<p>At the end of Swamp Lane, stood a tree with a banana dangling from a limb. Below three little lizards gazed upward.</p><p>Gig raised his knobby finger out of the slime and pointed. “I’ll get that banana before you blink. I have jumbo-mumbo muscles.”</p><p>Zipper did a pirouette and answered, “Yeah but you’re not nimble like me.”</p><p>Sprout’s friends never talked to him. His eyes went back and forth from Gig to Zipper to the banana.</p><p>Zipper and Gig continued to point, strut and stick out their chests.</p><p>Branches snapped, twigs cracked and mud squished.</p><p>A crowd of Sloths, Tigers and Turtles began to gather around.</p><p>“What will you give to the one who gets the last banana?” asked Gig and Zipper.</p><p>The sloths, tigers and turtles gathered into a huddle.</p><p>The tigers said, “Those branches are too tiny for me. They’ll never make it.”</p><p>“I get droopy easy. Surely they will also,” laughed the sloths.</p><p>The turtles answered, “If I can’t climb then they can’t climb.”</p><p>“Shall we make the prize, king of the jungle?” replied the Tigers.</p><p>“Yeah, yeah, yeah. Then we’ll have a good laugh,” they all said.</p><p>The head tiger turned to the Lizards, “The one who picks the last banana will be crowned king of the jungle.”</p><p>Gig’s eyes narrowed. “I want to be King of the jungle.”</p><p>“I want to be King of the jungle,” answered Zipper.</p><p>Sprout said nothing at all.</p><p>Gig and Zipper put themselves in a row. After a while Sprout did also.</p><p>A hush fell over the crowd.</p><p>“Three, two, one- GO!”</p><p>Gig and Zipper sprinted up. Sprout took off after them.</p><p>Below the Sloths yelled, “You’re getting exhausted.”</p><p>Behind them the Tigers hollered, “You’re too galumphing for that branch.”</p><p>The Turtles mocked, “Stay on the ground. It’s where you belong.”</p><p>Gig peered at the animals below. They were tiny dots. Fright over-whelmed him. When his body began to tremble he lost his grip. Whoosh-whoosh. Down he splashed into the swampy waters.</p><p>Zipper saw Gig go flying by. His teeth began to rattle with terror. “What am I doing?” he shrieked. Plat-plop. He came spiraling down also and crept into the jungle alone.</p><p>Sprout continued up the tree.</p><p>The Turtles shouted ever louder, “Hey, down here! Look down here!”</p><p>The Sloths cried, “It’s time for your nap.”</p><p>The Tigers shouted, “Impossible!”</p><p>Sprout went higher.</p><p>The crowd increased their yelling.</p><p>The Sloths cried, “You’ll get snatched by an Eagle up there.”</p><p>“That branch is gonna snap any second,” said the Tigers.</p><p>The Turtles said, “You can’t climb trees. Just accept it.”</p><p>Higher and higher and higher and faster and faster and faster he went until there he was right at the very tip-top. Sprout grabbed the banana and held it up.</p><p>The crowd roared with applause and stomped their feet.</p><p>Sensitive to vibration Sprout looked down and was surprised to see the creatures below cheering.</p><p>His heart skipped a beat at the sight.</p><p>When he came down the animal paparazzi thrust one microphone after another into his face.</p><p>“Tell us your secret.”</p><p>Sprout smiled.</p><p>“How did it feel up there?”</p><p>Sprout started to write.</p><p>“What kept you going?”</p><p>“Will you do it again?”</p><p>“Where you ever afraid?”</p><p>Their questions went on and on and on.</p><p>When Sprout was finished he handed them the note.</p><p>I am deaf.</p><p>“Attention, attention, announcing the king of the jungle.”</p><p>“Make-way, make-way, for the king of the jungle.”</p>"}