{"title": "Knapsack Charlie", "author": "Pat St. Pierre", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p> Charlie always carried a backpack wherever he went. Because of this everyone called him Knapsack Charlie. His backpack was a pretty blue backpack with wide straps and shiny buckles and it went flip, flop, flip, flop.</p><p>Charlie knew something about his backpack that no one else knew. Whatever Charlie found he put in his backpack. He had a feather, gum, acorns, tissue, a smooth gray stone, a screw, a piece of paper, string, a broken crayon, and much more.</p><p>“Why do you save all those silly things?” asked his older brother. “You’ll never use them.”</p><p>“But maybe I will,” answered Charlie. Charlie thought to himself I need everything I have in my backpack.</p><p>Flip, flop flip, flop walked Knapsack Charlie.</p><p>“Charlie, must you take that backpack wherever you go?” asked mom.</p><p>“Yes,” said Charlie “I might need something that’s in my backpack. Just the other day my friend needed a red crayon and I had one in my backpack,” answered Charlie.</p><p>Dad said, “If you always carry that backpack, your shoulders will turn in.”</p><p>“I walk with my shoulders pushed back,” answered Charlie. Charlie smiled. He knew that he had many valuables in his backpack.</p><p>Flip flop, flip, flop walked Knapsack Charlie.</p><p>“Oh, look what I found,” said Charlie. He opened his backpack and added a paper clip, a bottle cap, and an empty juice can.</p><p>The following morning Charlie, his brother, and his mother were in the dentist’s office. “I’m bored,” said his brother. “I wish I had something to read.”</p><p>Charlie opened his backpack and pulled out a comic book. “Here, you can read this,” he said. “It’s a good thing you had your backpack,” replied his brother.</p><p>On the ride home, the car went, spurt, spurt, and then it stopped. Mother said, “Oh, dear, I forgot my cell phone and the car just ran out of gas. I’ll have to call the gas station.” She looked in her purse. “I can’t seem to find any change for the phone booth,” she said.</p><p>Charlie peered into backpack, “I have two quarters,” he said to his mother.</p><p>“Thank you, said mother. “I’m happy that you brought your backpack with you.”</p><p>Later that afternoon Charlie was at the tennis court watching his father play tennis. ‘Fiddlesticks,” exclaimed his dad. “My sneaker lace just broke.”</p><p>Charlie looked in his backpack and pulled out a shoelace. “I have a brown shoelace. “Do you want it?” he asked.</p><p>“I sure do,” replied his dad. “That backpack of your certainly comes in handy.”</p><p>Flip, flop, flip, flop Knapsack Charlie walked away smiling.</p><p>Charlie had treasures in his backpack and now everyone knew what Charlie knew all the time.</p><img src='https://xcx.mdavid.cn/img/Knapsack-Charlie-photo-opt.jpg'></img>"}