{"title": "Larkin Wyley’s Paleontology Adventure", "author": "Artie Knapp", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Larkin-Wyley-opt.jpg'></img><p>BEFORE THE SUN had even broke across the horizon, young Larkin Wyley was anxious to start his day. Larkin was confident he was going to make a paleontology discovery so big and so grand, that it would put his name in the Kid’s Hall of Fame.</p><p>As his parents drove him to the digging site, it was hard for Larkin to contain his excitement.</p><p>“Just think, in a couple of hours I may be holding something millions of years old!” said Larkin.</p><p>“Well, that would be something, Larkin. But remember, paleontology is hard work. The most important thing is to just have fun today,” said his dad.</p><p>“And if things don’t turn out like you had hoped, that’s okay. Just keep at it,” said Larkin’s mom.</p><p>Larkin appreciated his parents’ advice, but quickly reminded them about the local farmer who had discovered a fossilized dinosaur egg many years before.</p><p>“Where there’s one, there’s sure to be more!” said Larkin with great excitement.</p><p>Then the Wyley family drove up a long country dirt-road, where Larkin’s grandparents owned land that stretched as far as the eye could see. And it was there that Larkin knew he would find his T-Rex.</p><p>So after a nice hearty breakfast with his family, Larkin set out on his exciting quest for the discovery of a lifetime.</p><p>The backyard of his grandparents’ farmhouse was where Larkin decided to break ground first. So he started to dig. And then he dug. And then he dug. And then he dug some more. But nothing!</p><p>So after a nice hearty lunch with his family, Larkin continued his exciting quest for the discovery of a lifetime.</p><p>The front-yard of his grandparents’ farmhouse was where Larkin decided to break ground next. So he started to dig. And then he dug. And then he dug. And then he dug some more. And then, BINGO!!! Much to Larkin’s amazement, he unearthed what clearly was the next best thing to a fossilized dinosaur egg – dinosaur bones…</p><p>The bones were caked in mud. Larkin gathered them up and ran towards the house as fast as he could.</p><p>After rushing inside and announcing his discovery to his family, it was brought to Larkin’s attention that he had actually unearthed steak bones buried by his grandparents’ dog Millie.</p><p>Larkin wasn’t happy, and neither was Millie for that matter. Larkin felt embarrassed about mistaking steak bones for those of a dinosaur, but his family reminded him that paleontology was hard work, and to just keep at it.</p><p>So after a nice hearty dinner with his family, Larkin continued his exciting quest for the discovery of a lifetime.</p><p>Close to his grandparents’ farmhouse lied a long and winding creek, and it was there that Larkin decided to break ground next. So he started to dig. And then he dug. And then he dug. And then he dug some more. But nothing!</p><p>Larkin felt discouraged. He remembered his family telling him that paleontology was hard work, but that was little comfort to him.</p><p>The sun was starting to set, so Larkin knew he had to call it a day. As he began to refill the last hole, Larkin noticed an orange-colored rock sticking out of the mud. He picked the rock up and wiped the dirt off of it. The rock was unlike any Larkin had seen before. But he gave the rock little thought, and placed it in his shirt-pocket.</p><p>After going back inside, Larkin’s family could tell that he was disappointed by the look on his face.</p><p>“How did it go, honey?” asked Larkin’s mom.</p><p>“Not good,” said Larkin staring downward. “All I found today was Millie’s steak bones, and this orange rock.”</p><p>As he held the rock in the air, Larkin’s family erupted in cheers. You see, it wasn’t a rock that Larkin had found after all; it was a well preserved Indian arrowhead. And although the Indian arrowhead wasn’t the dinosaur artifact he had dreamed of finding, Larkin still felt quite proud about his discovery.</p><p>An invitation from the Kid’s Hall of Fame would come another day, but Larkin did get his picture in the paper for donating his Indian arrowhead to the local museum. When asked if he ever thought he would discover such a find, Larkin replied, “Well, digging for artifacts is hard work, and you just have to keep at it. But yes, yes I did.”</p>"}