{"title": "Little Brother and Sister", "author": "Brothers Grimm", "level": "6 to 8,9 to12,", "category": "Classic,Fairy Tale,", "tag": "Deer,", "length": "10 - 15 mins,", "body": "<p>There was once a little brother who took his Sister by the hand, and said, “Since our own dear mother’s death we have not had one happy hour; our stepmother mistreats us every day, and, when we come near her, kicks us away with her foot. Come, let us go away into the wide world.”</p><p>So all day long they travelled over meadows, fields, and stony roads. By the evening they came into a large forest, and laid themselves down in a hollow tree, and went to sleep. When they awoke the next morning, the sun had already risen high in the heavens, and its beams made the tree so hot that the little boy said to his sister, “I am so very thirsty, that if I knew where there was a stream, I would go and drink. Ah! I think I hear one running;” and so saying, he got up, and taking his Sister’s hand they went to look for it.</p><p>The wicked stepmother, however, was a witch, and had seen the departure of the two children: so, sneaking after them secretly, as is the habit of witches, she had enchanted all the streams in the forest.</p><p>In time they found a stream, which ran over the pebbles, and the Brother would have drunk out of it, but the Sister heard how it said as it ran along, “Who drinks of me will become a tiger!” So the Sister exclaimed, “I beg you, Brother, drink not, or you will become a tiger, and tear me to pieces!” So the Brother did not drink, although his thirst was very great, and he said, “I will wait till the next brook.” As they came to the second, the Sister heard it say, “Who drinks of me becomes a wolf!”</p><p>The Sister ran up crying, “Brother, do not, pray do not drink, or you will become a wolf and eat me up!” Then the Brother did not drink, saying, “I will wait until we come to the next spring, but then I must drink, you may say what you will; my thirst is much too great.”</p><p>Just as they reached the third brook, the Sister heard the voice saying, “Who drinks of me will become a fawn—who drinks of me will become a fawn!” So the Sister said, “Oh, my Brother do not drink, or you will be changed into a fawn, and run away from me!” But he had already kneeled down, and he drank of the water, and, as the first drops passed his lips, his shape took that of a fawn.</p><p>At first the Sister wept over her little, changed Brother, and he wept too, and knelt by her, very sorrowful; but at last the young girl said, “Be still, dear little fawn, and I will never leave you!” and, taking off her golden garter, she placed it around his neck, and, weaving rushes, made a lead for him. This she tied to him, and taking the other end in her hand, she led him away, and they travelled deeper and deeper into the forest.</p><p>After they had gone a long distance they came to a little hut, and the young girl, peeping in, found it empty, and thought, “Here we can stay and dwell.” Then she looked for leaves and moss to make a soft couch for the Fawn, and every morning she went out and collected roots and berries and nuts for herself, and tender grass for the Fawn. In the evening when the Sister was tired, and had said her prayers, she laid her head upon the back of the Fawn, which served for a pillow, on which she slept soundly. If the Brother could have regained his own proper form as a human, their lives would have been happy indeed.</p><p>Thus they lived in this wilderness, and some time had gone by when it happened that the King of the country had a great hunt in the forest; and now sounded through the trees the blowing of horns, the barking of dogs, and the cry of the hunters, so that the little Fawn heard them, and wanted very much to join in.</p><p>“Ah!” said he to his Sister, “let me go to the hunt, I cannot hold myself back any longer;” and he begged so hard that at last she consented.</p><p>“But,” she told him,” “return again in the evening, for I shall shut my door against the wild huntsmen, and, that I may know you, do you knock, and say, ‘Sister, dear, let me in,’ and if you do not speak I shall not open the door.”</p><img src='https://xcx.mdavid.cn/img/017.png'></img><p>As soon as she had said this, the little Fawn sprang off quite glad and merry in the fresh breeze. The King and his huntsmen saw the beautiful animal, and chased him; but they could not catch him, and when they thought they certainly had him, he sprang away over the bushes, and got out of sight.</p><p>Just as it was getting dark, he ran up to the hut, and, knocking, said, “Sister dear, let me in.” Then she unfastened the little door, and he went in, and rested all night long upon his soft couch. The next morning the hunt was started again, and as soon as the little Fawn heard the horns and the tally-ho of the sportsmen he could not rest, and said, “Sister, dear, open the door; I must be off.”</p><p>The Sister opened it, saying, “Return at evening, mind, and say the words as before.” When the King and his huntsmen saw him again, the Fawn with the golden necklace, they followed him, close, but he was too nimble and quick for them. The whole day long they kept up with him, but towards evening the huntsmen made a circle around him, and one wounded him slightly in the hind foot, so that he could run but slowly. Then one of them slipped after him to the little hut, and heard him say, “Sister, dear, open the door,” and saw that the door was opened and immediately shut behind him. The huntsman, having observed all this, went and told the King what he had seen and heard, and he said, “Tomorrow I will pursue him once again.”</p><p>The Sister, however, was terribly afraid when she saw that her Fawn was wounded, and, washing off the blood, she put herbs upon the foot, and said, “Go and rest upon your bed, dear Fawn, that your wound may heal.” It was so slight, that the next morning he felt nothing of it, and when he heard the hunting cries outside, he exclaimed, “I cannot stop away—I must be there, and no-one shall catch me so easily again!” The Sister wept very much and told him, “Soon will they kill you, and I shall be here alone in this forest, forgotten by all the world: I cannot let you go.”</p><p>“I shall die here in frustration,” answered the Fawn, “if you do not, for when I hear the horn, I think I will jump out of my skin.” The Sister, finding she could not prevent him, opened the door, with a heavy heart, and the Fawn jumped out, quite delighted, into the forest.</p><p>As soon as the King saw him, he said to his huntsmen, “Follow him all day long till the evening, but let no one do him any harm.” Then when the sun had set, the King asked his huntsman to show him the hut; and as they came to it he knocked at the door and said, “Let me in, dear Sister.” Upon this the door opened, and, stepping in, the King saw a maiden more beautiful than he had ever seen before. She was frightened when she saw not her Fawn, but a man enter, who had a golden crown on his head. But the King, looking at her with a kindly glance, held out to her his hand, saying, “Will you go with me to my castle, and be my dear wife?” “Oh, yes,” replied the maiden; “but the Fawn must go too: him I will never abandon him.”</p><p>The King replied, “He shall remain with you as long as you live, and will always be taken good care of.”</p><p>The King took the beautiful young girl up on his horse, and rode to his castle, where the wedding was celebrated with great splendor and she became Queen, and they lived together a long time; while the Fawn was taken care of and played about the castle garden.</p><p>The wicked stepmother, however, on whose account the children had wandered into the world, had thought that long ago the Sister had been torn into pieces by the wild beasts, and the little Brother in his Fawn’s shape hunted to death by the hunters. As soon, therefore, as she heard how happy they had become, and how everything prospered with them, envy and jealousy were aroused in her wicked heart, and left her no peace; and she was always thinking in what way she could bring misfortune upon them.</p><p>Her own daughter, who was as ugly as night, and had but one eye, said, “The luck of being a Queen has never happened to me.””Be quiet, now,” replied the old woman, “and relax. “When the time comes I will help  you.”</p><p>As soon, then, as the time came when the Queen gave birth to a beautiful little boy, which happened when the King was out hunting, the old witch took the form of a chambermaid, and got into the room where the Queen was lying, and said to her, “The bath is ready, which will restore you and give you fresh strength; be quick before it gets cold.” Her daughter being waiting nearby, they carried the weak Queen between them into the room, and laid her in the bath, and then, shutting the door, they ran off; but first they made up an immense fire in the stove, which they had planned must soon take all the air from the room and kill the poor young Queen.</p><img src='https://xcx.mdavid.cn/img/020.png'></img><p>When this was done, the old woman took her daughter, and, putting a cap upon her head, laid her in the bed in the Queen’s place. She gave her, too, the form and appearance of the real Queen, as far as she was able; but she could not restore the second eye, and, so that the King might not notice it, she turned her upon that side where there was no eye.</p><p>When midnight came, and every one was asleep, the nurse, who sat by herself, wide awake, near the cradle, in the nursery, saw the door open and the true Queen come in. She took the child in her arms, and rocked it a while, and then, shaking up its pillow, laid it down in its cradle, and covered it over again. She did not forget the Fawn, either, but going to the corner where he was, stroked his head, and then went silently out of the door. The nurse asked in the morning of the guards if any one had passed into the castle during the night; but they answered, “No, we have not seen anybody.” For many nights afterwards she came constantly, but never spoke a word; and the nurse saw her always, but she would not trust herself to speak about it to any one.</p><p>When some time had passed away, the Queen one night began to speak, and said—</p><p><em>“How fares my child! how fares my fawn?</em></p><p><em>Twice more will I come, but never again.”</em></p><p>The nurse made no reply; but, when she had disappeared, went to the King, and told him. The King exclaimed, “Oh, mercy! what does this mean?—the next night I will watch myself by the child.” So in the evening he went into the nursery, and about midnight the Queen appeared, and said—</p><p><em>“How fares my child! how fares my fawn?</em></p><p><em>Once more will I come, but never again.”</em></p><p>And she nursed the child, as she usually did, and then disappeared. The King dared not speak; but he watched the following night, and this time she said—</p><p><em>“How fares my child! how fares my fawn?</em></p><p><em>This time have I come, but never again.”</em></p><p>At these words the King could hold back no longer, but, springing up, cried, “You can be no other than my dear wife!” Then she answered, “Yes, I am your dear wife;” and at that moment her life was restored and she was again as beautiful and charming as ever.</p><p>She told the King what the witch and her daughter had done and he had them both tried, and sentenced. The spell on the little Fawn was broken, and he turned human once again. The Brother and Sister lived happily together to the end of their days.</p><img src='https://xcx.mdavid.cn/img/022.png'></img>"}