{"title": "LITTLECAR EDWARD", "author": "Paul R. Hernandez", "level": "3 to 5,6 to 8,", "category": "Instructional,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Once upon a time in a great big city lived FIRETRUCK BARNEY.   He was big, powerful and the brightest red color you could imagine.</p><p>At Fire Station #1 where he lived, FIRETRUCK BARNEY was the lead fire truck and always led the other fire trucks whenever they had to go fight any fires in the city.</p><p>Fire chief Anderson always said that FIRETRUCK BARNEY was the best fire truck that he had ever seen.</p><p>It was the job of all the firemen at Fire Station #l, to constantly wash and clean FIRETRUCK BARNEY between fires and his bright red color always sparkled in the sunlight.</p><p>FIRETRUCK BARNEY was married to CHIEF’S CAR ANNIE.   She was not as big as FIRETRUCK BARNEY, but she was also bright red and able to move very fast.</p><p>In time, FIRETRUCK BARNEY and CHIEF’S CAR ANNIE became the parents of LITTLECAR EDWARD.</p><p>“Hmmmmm” said FIRETRUCK BARNEY when he first saw LITTLECAR EDWARD, “he is not very big is he, and look, he is more white then red.”</p><p>“He is just a baby” said his wife.   “Give him time and he will probably grow up to be just like you.”</p><p>But as time went on, LITTLECAR EDWARD did not turn red or get very much bigger, but he was very, very fast and could run circles around everyone at Fire Station #1, including FIRETRUCK BARNEY.</p><p>FIRETRUCK BARNEY loved LITTLECAR EDWARD and gave him an official siren and some flashing signal lights still hoping that he would someday become a fire truck, just like himself.</p><p>LITTLECAR EDWARD loved the siren and lights and would go up and down the fire station with the siren going full blast and the lights flashing brightly pretending to be a fire truck just like his father.</p><p>In time FIRETRUCK BARNEY became very sad because LITTLECAR EDWARD did not get big and strong like him and did not change color.</p><p>Because of LITTLECAR EDWARDS’S size, Fire Chief Anderson determined that he could not use him as a fire truck and decided that he would be used to carry drinking water and extra fire fighting equipment for the firemen of Fire Station #1.</p><p>Deep inside his little heart, LITTLECAR EDWARD felt that he was destined to do great things just like his father, but he did not really know what this would be, but he decided that he would do the job that Fire Chief Anderson had assigned to him to the best of his ability.</p><p>So whenever there was a fire, you would see FIRETRUCK BARNEY in front, followed by CHIEF’S CAR ANNE carrying Fire Chief Anderson, the other fire trucks and then in the back would come LITTLECAR EDWARD, his siren blaring loudly and his lights flashing brightly.</p><p>One dark and lonely night, everyone at Fire Station #1 were suddenly awakened by a fire alarm.   Fire Chief Anderson yelled to all his men “I just received word that there is a big fire over in Pleasantville and that several homes are on fire.”</p><p>Quickly all the firemen were up and ready to go.   In a matter of seconds FIRETRUCK BARNEY was out the station house door, followed by CHIEF’S CAR ANNE, the other fire trucks and in the rear came LITTLECAR EDWARD, his siren blaring loudly and his lights flashing brightly.</p><p>When they arrived in Pleasantville, they saw that it was indeed a bad fire.   The firemen immediately set to work putting out the fires, and rescuing the people that were trapped in their homes</p><p>“My son Carlos is trapped inside my home.” said a lady that had been rescued.   “I could not get to him after the fire started, please help him.”</p><p>Upon finding out in which house Carlos was trapped, the firemen ran into the house to try and find him.   After what seem like an eternity, everyone heard a voice coming from the burning house.   “We found him and we are coming out.”</p><p>Suddenly the firemen came out of the housing carrying Carlos who was limp in their arms.   “We think he is still alive, but he has inhaled a lot of smoke and has some burns.”</p><p>Fire Chief Anderson kneeled down beside Carlos who was having difficulty breathing and who was crying because of his burns.</p><p>“This is very serious, we have to get him to the hospital right away, but I don’t know how we can do that right now.   An ambulance will take a long time to get here from the city, and I need all my fire trucks to fight the fire.”</p><p>“How about LITTLECAR EDWARD” someone said, “He is very fast and should have little trouble in getting Carlos to the hospital.”</p><p>So Carlos was put into LITTLECAR EDWARD and away they went, with the siren blaring loudly and the lights flashing brightly and they arrived at the hospital in record time.</p><p>Because LITTLECAR EDWARD had been so fast, Carlos recovered nicely.</p><p>So from that time on, LITTLECAR EDWARD became Fire Station #1’s official ambulance, with an official seal on both his doors and the firemen proudly cleaned and polished him up, just like his father.</p><p>His parent’s FIRETRUCK BARNEY and CHIEF’S CAR ANNE no longer cared that he was not big and red, because they now understood that size and color are not as important as the deeds that you accomplish, and LITTLECAR EDWARD’S dedication and ability in saving lives now made him bigger then life.</p>"}