{"title": "The Little Match Girl", "author": "Hans Christian Andersen", "level": "6 to 8,9 to12,Teen,", "category": "Christmas,Classic,Fairy Tale,Illustrated,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/p117i.png'></img><p>It was New Year’s Eve and dreadfully cold. The snow fell quickly in the darkening light as evening came on. In the cold and the darkness, there walked along the street a poor little girl, bareheaded and with no shoes on. When she left home she had slippers on, it is true, but they were much too large for her feet. Her mother had used those slippers till then, but the poor little girl lost them running across the street when two carriages were passing quickly by. When she looked for them, one was not to be found, and a boy grabbed the other and ran away with it.</p><p>So on the little girl went with her bare feet, that were red and blue with cold. In an old apron that she wore she had bundles of matches and she also carried a bundle in her hand. No one had bought so much as a bunch all long day and no one had given her even a penny.</p><p>Poor little girl! Shivering with cold and hunger she crept along, feeling miserable.</p><p>The snowflakes fell on her long hair, which hung in pretty curls about her neck, but she did not think of her beauty or of the cold. Lights shone from every window, and she could smell the beautiful smell of roast goose being cooked for New Year’s Eve in all the houses. She could not stop thinking about it.</p><p>In a corner between two houses, she sat down. She tucked her little feet in underneath herself, but still she grew colder and colder. She did not dare to go home, as she had not sold any matches and could not bring any money. Her father would certainly would not be pleased. Besides, it was cold enough at home, as they had only a roof above them that was full of holes.</p><img src='https://xcx.mdavid.cn/img/p119i1.png'></img><p>Now her little hands were nearly frozen with cold. She thought that maybe a match might warm her fingers if she lit it. So at last she drew one out. She struck it and how it blazed and burned! It gave out a warm, bright flame like a little candle, as she held her hands over it. A wonderful little light it was. It really seemed to the little girl as if she sat in front of a great iron stove with a lovely fire inside it. So nicely it burned that the little girl stretched out her feet to warm them. How comfortable she was! But then the flame went out, the stove vanished, and nothing remained but the little burned match in her hand.</p><p>She rubbed another match against the wall. It burned brightly, and where the light fell on the wall she could suddenly see right through it into the room. A snow-white cloth was spread upon the table, on which were laid beautiful china plates, while a stuffed roast goose cooked away and made a most delicious smell. And what was more delightful still, and wonderful, the goose jumped from the dish, with knife and fork still in its breast, and waddled along the floor straight towards the little girl.</p><p>But the match went out then, and nothing was left to her but the thick, damp wall.</p><p>She lit another match. And now she was under a most beautiful Christmas tree, larger and far more prettily decorated than the one she had seen through the glass doors at the rich merchant’s. Hundreds of candles were burning on the green branches, and little painted figures, like she had seen in shop windows, looked down on her. The child stretched out her hands to them, but then the match went out.</p><p>Still the lights of the Christmas tree burned higher and higher into sky until she saw one fall,, forming a long trail of fire.</p><p>“Now some one is dying,” murmured the child softly, for her grandmother, the person who had loved her the most, and who was now dead, had told her that whenever a star falls a soul goes up to heaven.</p><p>She struck yet another match against the wall. It lit and in its brightness her dear old grandmother appeared before her, beaming love and kindness.</p><p>“Oh, grandmother,” cried the child, “take me with you. I know you will go away when the match burns out. You, too, will vanish, like the warm stove, the splendid New Year’s feast, the beautiful Christmas tree.” And to make sure her grandmother would not disappear, she lit a whole bundle of the matches against the wall.</p><p>And they burned with such a brilliant light that it became brighter than the midday sun. Her grandmother had never looked so grand and beautiful. She took the little girl in her arms and both flew joyfully together, climbing higher and higher, far above the earth, away from cold and hunger, to heaven.</p><p>They found her the next morning, leaning against the wall, with red cheeks and smiling mouth—frozen to death on the last evening of the old year. “She wanted to warm herself, the poor little thing,” people said. “I wonder why she looks so happy?” some people asked. No one imagined what beautiful things she had seen, or how happily she had gone with her grandmother into the new year.</p>"}