{"title": "Little Dorothy and Toto", "author": "L. Frank Baum", "level": "6 to 8,9 to12,", "category": "Classic,Fairy Tale,Fantasy,Illustrated,", "tag": "Dog,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/image11.jpg'></img><img src='https://xcx.mdavid.cn/img/dropd.jpg'></img><p>orothy was a little Kansas girl who once accidentally found the beautiful Land of Oz and was invited to live there always. Toto was Dorothy’s small black dog, with fuzzy, curly hair and bright black eyes. Together, when they tired of the grandeur of the Emerald City of Oz, they would wander out into the country and all through the land,peering into queer nooks and corners and having a good time in their own simple way. There was a little Wizard living in Oz who was a faithful friend of Dorothy and did not approve of her traveling alone in this way, but the girl always laughed at the little man’s fears for her and said she was not afraid of anything that might happen.</p><img src='https://xcx.mdavid.cn/img/image12.jpg'></img><p>One day while on such a journey, Dorothy and Toto found themselves among the wild wooded hills at the southeast of Oz—a place usually avoided by travelers because so many magical things abounded there. And, as they entered a forest path, the little girl noticed a sign tacked to a tree, which said: “Look out for Crinklink.”</p><p>Toto could not talk, as many of the animals of Oz can, for he was just a common Kansas dog; but he looked at the sign so seriously that Dorothy almost believed he could read it, and she knew quite well that Toto understood every word she said to him.</p><p>“Never mind Crinklink,” said she. “I don’t believe anything in Oz will try to hurt us, Toto, and if I get into trouble you must take care of me.”</p><p>“Bow-wow!” said Toto, and Dorothy knew that meant a promise.</p><p>The path was narrow and wound here and there between the trees, but they could not lose their way, because thick vines and creepers shut them in on both sides. They had walked a long time when, suddenly turning a curve of the pathway, they came upon a lake of black water, so big and so deep that they were forced to stop.</p><img src='https://xcx.mdavid.cn/img/image13.jpg'></img><p>“Well, Toto,” said Dorothy, looking at the lake, “we must turn back, I guess, for there is neither a bridge nor a boat to take us across the black water.”</p><p>“Here’s the ferryman, though,” cried a tiny voice beside them, and the girl gave a start and looked down at her feet, where a man no taller than three inches sat at the edge of the path with his legs dangling over the lake.</p><p>“Oh!” said Dorothy; “I didn’t see you before.”</p><p>Toto growled fiercely and made his ears stand up straight, but the little man did not seem in the least afraid of the dog. He merely repeated: “I’m the ferryman, and it’s my business to carry people across the lake.”</p><p>Dorothy couldn’t help feeling surprised, for she could have picked the little man up with one hand, and the lake was big and broad. Looking at the ferryman more closely she saw that he had small eyes, a big nose, and a sharp chin. His hair was blue and his clothes scarlet, and Dorothy noticed that every button on his jacket was the head of some animal. The top button was a bear’s head and the next button a wolf’s head; the next was a cat’s head and the next a weasel’s head, while the last button of all was the head of a field-mouse. When Dorothy looked into the eyes of these animals’ heads, they all nodded and said in a chorus: “Don’t believe all you hear, little girl!”</p><img src='https://xcx.mdavid.cn/img/image14.jpg'></img><p>“Silence!” said the small ferryman, slapping each button head in turn, but not hard enough to hurt them. Then he turned to Dorothy and asked: “Do you wish to cross over the lake?”</p><p>“Why, I’d like to,” she answered, hesitating; “but I can’t see how you will manage to carry us, without any boat.”</p><p>“If you can’t see, you mustn’t see,” he answered with a laugh. “All you need do is shut your eyes, say the word, and—over you go!”</p><p>Dorothy wanted to get across, in order that she might continue her journey.</p><p>“All right,” she said, closing her eyes; “I’m ready.”</p><p>Instantly she was seized in a pair of strong arms—arms so big and powerful that she was startled and cried out in fear.</p><p>“Silence!” roared a great voice, and the girl opened her eyes to find that the tiny man had suddenly grown to a giant and was holding both her and Toto in a tight embrace while in one step he spanned the lake and reached the other shore.</p><p>Dorothy became frightened, then, especially as the giant did not stop but continued tramping in great steps over the wooded hills, crushing bushes and trees beneath his broad feet. She struggled in vain to free herself, while Toto whined and trembled beside her, for the little dog was frightened, too.</p><p>“Stop!” screamed the girl. “Let me down!” But the giant paid no attention. “Who are you, and where are you taking me?” she continued; but the giant said not a word. Close to Dorothy’s ear, however, a voice answered her, saying: “This is the terrible Crinklink, and he has you in his power.”</p><p>Dorothy managed to twist her head around and found it was the second button on the jacket—the wolf’s head—which had spoken to her.</p><p>“What will Crinklink do with me?” she asked anxiously.</p><img src='https://xcx.mdavid.cn/img/image15.jpg'></img><p>“No one knows. You must wait and see,” replied the wolf.</p><p>“Some of his captives he whips,” squeaked the weasel’s head.</p><p>“Some he transforms into bugs and other things,” growled the bear’s head.</p><p>“Some he enchants, so that they become doorknobs,” sighed the cat’s head.</p><p>“Some he makes his slaves—even as we are—and that is the most dreadful fate of all,” added the field-mouse. “As long as Crinklink exists we shall remain buttons, but as there are no more buttonholes on his jacket he will probably make you a slave.”</p><img src='https://xcx.mdavid.cn/img/image16.jpg'></img><p>Dorothy began to wish she had not met Crinklink. Meantime, the giant took such big steps that he soon reached the heart of the hills, where, perched upon the highest peak, stood a log castle. Before this castle he paused to set down Dorothy and Toto, for Crinklink was at present far too large to enter his own doorway. So he made himself grow smaller, until he was about the size of an ordinary man. Then he said to Dorothy, in stern, commanding tones:</p><p>“Enter, girl!”</p><p>Dorothy obeyed and entered the castle, with Toto at her heels. She found the place to be merely one big room. There was a table and chair of ordinary size near the center, and at one side a wee bed that seemed scarcely big enough for a doll. Everywhere else were dishes—dishes—dishes! They were all soiled, and were piled upon the floor, in all the corners and upon every shelf. Evidently Crinklink had not washed a dish for years, but had cast them aside as he used them.</p><p>Dorothy’s captor sat down in the chair and frowned at her.</p><p>“You are young and strong, and will make a good dishwasher,” said he.</p><p>“Do you mean me to wash all those dishes?” she asked, feeling both indignant and fearful, for such a task would take weeks to accomplish.</p><p>“That’s just what I mean,” he retorted. “I need clean dishes, for all I have are soiled, and you’re going to make ’em clean or get trounced. So get to work and be careful not to break anything. If you smash a dish, the penalty is one lash from my dreadful cat-o’-nine-tails for every piece the dish breaks into,” and here Crinklink displayed a terrible whip that made the little girl shudder.</p><p>Dorothy knew how to wash dishes, but she remembered that often she carelessly broke one. In this case, however, a good deal depended on being careful, so she handled the dishes very cautiously.</p><p>While she worked, Toto sat by the hearth and growled low at Crinklink, and Crinklink sat in his chair and growled at Dorothy because she moved so slowly. He expected her to break a dish any minute, but as the hours passed away and this did not happen Crinklink began to grow sleepy. It was tiresome watching the girl wash dishes and often he glanced longingly at the tiny bed. Now he began to yawn, and he yawned and yawned until finally he said:</p><img src='https://xcx.mdavid.cn/img/image17.jpg'></img><p>“I’m going to take a nap. But the buttons on my jacket will be wide awake and whenever you break a dish the crash will waken me. As I’m rather sleepy I hope you won’t interrupt my nap by breaking anything for a long time.”</p><p>Then Crinklink made himself grow smaller and smaller until he was three inches high and of a size to fit the tiny bed. At once he lay down and fell fast asleep.</p><p>Dorothy came close to the buttons and whispered: “Would you really warn Crinklink if I tried to  escape?”</p><p>“You can’t escape,” growled the bear. “Crinklink would become a giant, and soon overtake you.”</p><p>“But you might kill him while he sleeps,” suggested the cat, in a soft voice.</p><p>“Oh!” cried Dorothy, drawing back; “I couldn’t poss’bly kill anything—even to save my life.”</p><p>But Toto had heard this conversation and was not so particular about killing monsters. Also the little dog knew he must try to save his mistress. In an instant he sprang upon the wee bed and was about to seize the sleeping Crinklink in his jaws when Dorothy heard a loud crash and a heap of dishes fell from the table to the floor. Then the girl saw Toto and the little man rolling on the floor together, like a fuzzy ball, and when the ball stopped rolling, behold! there was Toto wagging his tail joyfully and there sat the little Wizard of Oz, laughing merrily at the expression of surprise on Dorothy’s face.</p><p>“Yes, my dear, it’s me,” said he, “and I’ve been playing tricks on you—for your own good. I wanted to prove to you that it is really dangerous for a little girl to wander alone in a fairy country; so I took the form of Crinklink to teach you a lesson. There isn’t any Crinklink, to be sure; but if there had been you’d be severely whipped for breaking all those dishes.”</p><img src='https://xcx.mdavid.cn/img/image18.jpg'></img><p>The Wizard now rose, took off the coat with the button heads, and spread it on the floor, wrong side up. At once there crept from beneath it a bear, a wolf, a cat, a weasel, and a field-mouse, who all  rushed from the room and escaped into the mountains.</p><p>“Come on, Toto,” said Dorothy; “let’s go back to the Emerald City. You’ve given me a good scare, Wizard,” she added, with dignity, “and p’raps I’ll forgive you, by’n’by; but just now I’m mad to think how easily you fooled me.”</p>"}