{"title": "Little Puffy", "author": "Paul R. Hernandez", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>Once upon a time in the great outdoors there lived a family of cumulus clouds.</p><p>Depending on the winds that inhabited the upper stretches of the sky, they were moved all over the world providing shade, rain, snow, thunder and lightning according the conditions of the moment.</p><p>This family of cumulous clouds consisted of Father Giganta, Mother Olyntus and three sons named Thunda, Banga and Little Puffy.</p><p>Being cumulous clouds Giganta, Olyntus, Thunda and Banga were a sight to behold.</p><p>They were extremely dense, white in color, fluffy looking, flat and extremely unstable which accounted for the thunder and lightning they were able to generate at a moments notice.</p><p>The third son, Little Puffy, was very different and Father Giganta and Mother Olyntus were very embarrassed by his appearance.</p><p>Little Puffy, you see, was just a little pink, round cloud, that try as he might was never able to generate more then a couple of drops of rain.</p><p>Thunda and Banga were always making fun of their brother Little Puffy.   “Hey there useless” they both called out, “why don’t you just disappear, you know that you will never amount to anything.”</p><p>Just then a strong, cold wind came up traveling north and Father Giganta called out to Olyntus, Thunda and Banga “Let’s go, it’s time for our journey to the north pole.   We have to go cover it with all the snow that we can generate.”</p><p>“Dad, can I go along this time?” asked Little Puffy,” I know that if I try real hard that I can make a little snow.”</p><p>“ I am sorry son,” said Giganta “you know that you don’t have the density necessary to create snow, and anyway, because of your small size the wind will blow you all over the sky.</p><p>“Yes son,” Olyntus volunteered, “your father is right, you better stay here where you will be safe.”</p><p>Both Thunda and Banga snickered and Little Puffy felt very bad that he could not go along with the family.</p><p>After Giganta, Olyntus, Thunda and Banga had disappeared over the horizon, Little Puffy started to cry and his tears fell to the ground as rain.</p><p>As Little Puffy looked down to see where his tears had fallen, he was startled by a little grey bird that flew up to him.</p><p>“Hey little cloud, where is your family? he asked “all the animals in the forest below need their help.”</p><p>“I am sorry but my family has gone to the North Pole to cover it with snow.”   “What is the problem?” asked Little Puffy.</p><p>“Look over there in the middle of the forest, do you see that small wisp of black smoke?” asked the little grey bird, “It is a campfire that was left by a human family, that is slowly starting to build up, and if someone doesn’t put it out, it will destroy a large part of the forest harming many of the animals.”</p><p>Little Puffy slowly turned to where the little grey bird had pointed, and was able to see the black smoke.</p><p>“I don’t know what we are going to do” said the little grey bird, “your family was our last hope because they would have easily put out the fire with a little of their rain.”</p><p>Just then a thought came to Little Puffy, why couldn’t he help them; he was just as much a cloud as anyone in his family.</p><p>“Don’t worry little bird, I will help you!” said Little Puffy.</p><p>“What can you do?” asked the little grey bird, “You are just a little pink cloud, and none of the animals have ever seen you drop any rain or snow on the forest.”</p><p>Little Puffy sucked in as much air as he could, trying to grow as large as he could, but try as he might, he remained a pretty little pink cloud.</p><p>But Little Puffy did not let this stand in his way, “Come on little bird, we have to go put out the fire.”</p><p>And away flew the bird, but Little Puffy could not move, and then he remembered, clouds cannot move without the help of the wind.</p><p>“What shall I do, there is no wind today, and if wait until one comes up, it may be too late to save the forest.”</p><p>Just then the little grey bird flew back to him, “Come on little cloud, the fire is growing larger, and we don’t have very much time left.”</p><p>“I just remembered, clouds cannot move without the help of the wind,” said Little Puffy, “and there is no wind blowing at this time to help move me over the fire.”</p><p>Just then, like lightning hitting him, Little Puffy got an idea.   “Little grey bird, do you think that you can ask all the birds of the forest to fly up here to help us.”</p><p>“I think that if all the birds flap their wings behind me at the same time that they will create sufficient wind to move me over the fire.”</p><p>In a matter of minutes, the little grey bird returned with hundreds of birds, and with their help they created enough wind to move Little Puffy over the fire.</p><p>As Little Puffy looked down, he saw that the fire was now more then just a little wisp of black smoke.   He could see smoldering ambers glowing a dangerous red color and he knew that flames could sprout at any moment.</p><p>Little Puffy started to strain and squeeze as much as he could, but all that he could generate were a couple of drops of rain which he knew would not be enough to put out the fire.</p><p>Knowing that he was not going to be able to help the forest creatures, Little Puffy  became very sad.   As he continued to think of all the animals that lived in the forest that would be without their homes if the fire were to start, suddenly he started getting darker and darker.</p><p>Then without knowing what was happening, Little Puffy started to cry, and his tears became a torrent of water which fell upon the fire, putting it out.</p><p>Up from the forest arose hundred of voices of little animals “Thank you little cloud, for saving our homes.” And Little Puffy felt very happy that he had been able to help them.</p><p>When his family returned from the north pole, his mother Olyntus asked “Well Little Puffy, what did you do while we were gone?” “Nothing exciting” replied Little Puffy, but from that day on, Little Puffy did not feel any less a cumulus cloud then the rest of his family, knowing that in times of need, he would also be able to contribute to the needs of the world.</p>"}