{"title": "Love – Power of Guinea Pig", "author": "Tina Brescanu", "level": "6 to 8,9 to12,", "category": "Instructional,Modern,Original,", "tag": "Guinea Pig,", "length": "15 - 20 mins,", "body": "<p style=\"text-align: center;\">For Emilia, your heart is full of love, your belly is full of happiness and your mouth is full of fun, it’s an honour being your mum</p><p> </p><p>“I love you,” Elva said, courageously putting her finger through the cage bars. Elva lay on the shop floor, nodding her head, happily talking to her chosen guinea pig.</p><p>“I love this one. Look, look mum, she’s nibbling me.” The vanilla and caramel coloured guinea pig tasted one of Elva’s fingers while making little happy noises: “wheek, wheek, wheek.”</p><p>“Awh, she sounds lovely. Isn’t she lovely mum!” Elva spread herself out on her stomach, rolling around and peeckabooing with the guinea pig.</p><p>“Yes Elva, she’s lovely. Is she the one? You decide.” Elva’s mum, Sigrid, hunkered down beside Elva.</p><p>Elva mimicked the happy noise of the guinea pig: “wheek, wheek, wheek, yes, you’re going to be my pet and I’m going to care for you, a love of a lot.” Elva giggled.</p><p>“That’s right; you’re going to care for her.” Sigrid repeated while letting the little guinea pig nibble her too.</p><p>“I will mum, every day.” Elva pushed her face forward and opened her eyes extra wide to show her mum the seriousness of her responsibility.</p><p>“Several times a day,” her mum reminded her.</p><p>“Yes, mum,” Elva agreed.</p><p>“Good.” Sigrid stood up. “She’s cute and lovely and also lots of work and responsibility.”</p><p>Elva lifted herself off the floor to calm her mum down with a hug.</p><p>“Remember, a pet is for life,” Sigrid said embraced in one of Elva’s love squeezes.</p><p>“Yes mum, I know.  I’m a big girl now, I’m seven and I’m ready for a pet.”</p><p>“I hope so, and you know your dad, he is not going to help at all.”</p><p>“Yes, he made that very clear. “Animals belong in the outdoors. All animals!” Elva mimicked her dad but in a happy voice so as not to scare the guinea pig.</p><p>“Isn’t that awful,” Elva said to her guinea pig. Mum laughed. “We can’t change other people Elva.”</p><p>“I know,” Elva sighed and shrugged her left shoulders up and the right down, reversed and then two quick rowing stretches with both arms. Elva loved living in her body and was never fully still.</p><p>The animal caretaker came and asked if Elva had made her choice and opened the cage to let Elva pick exactly the one she wanted. He showed her how to pick up her guinea pig first.</p><p>“First, you reach under the belly, then, place your other hand under the back legs as you lift the guinea pig.”</p><p>Elva did exactly what she had been shown to do and the guinea pig stood still and let Elva scoop her up while looking at Elva with her cute little face. She nuzzled into Elva’s neck and Elva giggled in delight.</p><p>“Love, that’s what I’ll call you, what do you think of your new name, Love?”</p><p>“Wheek, wheek, wheek, wheek.”  Love kept nuzzling her neck. “I think she loves her name.”</p><p>“You handle her with love, gentleness and great care. I predict you’ll be best friends,” the animal caretaker said. Elva smiled.</p><p>“I know,” she said. I’m a natural guinea pig lover.”</p><p>Mum paid for Love and all the bits and pieces she would need. Mum rang dad and when he came, mum packed the cage, food and toys into the boot of the car while Elva settled Love into a box full of holes.</p><p>“Just for safety, holding her might seem like a good idea, but this way you can be sure she’ll get to her new home without escaping,” the animal caretaker said. Elva promised Love it was only a short ride home and much faster than walking.</p><p>At home, Elva had already made space for Love’s cage. She made a little enclosure by placing books and toys in a circle on the floor and let Love out to discover while she fixed up the cage.</p><p>She put old newspapers at the bottom, then hay and straw. She filled the water bottle and hung it between the cage bars, she added a salt bar and some yummy fruit treats and a wooden house with a ladder and a bowl of dry food on the roof of the house.</p><p>“Wow, I wouldn’t mind living in there,” said her older brother Jay as he came home, eager to be introduced to the new family member.</p><p>“Love, this is my brother Jay, Jay meet Love.”</p><p>“He’s lovely,” said Jay.</p><p>“She’s a she.” Elva made the important stuff clear, but Jay protested.</p><p>“If she’s love, then she’s both a she and a he. Love doesn’t have a preference.”</p><p>Elva loved her brother. “Ok, you can call Love male, and I call her female. After thinking she added: “If I love her more than I love you, am I a bad sister?”</p><p>“No, because love can’t be measured.” Jay picked up Love and cuddled her.</p><p>“What does that mean?”</p><p>“It means love is always love, there is no less or more, it’s all just love.”</p><p>“So when I look at Love and my heart is swelling with love, and when I look at you and get a warm feeling in my body, it’s all love?”</p><p>“Yes, clever sister.” Jay gave Love to her and ruffled her hair. She was very clever.</p><p> </p><p>Elva loved looking after Love. Love was her new best friend. They played every morning before Elva went to school. They played in the afternoon when she came home from school. They had a last cuddle before Elva went to bed. Elva’s heart had opened wide since Love came into her life.</p><p>“The power of Love is love.”  Elva’s mood changed with Love, instead of angry and on the edge, she became calm and centred.</p><p>“All credit to you, Love,” she said.</p><p>Elva changed her twice a week which was aplenty for Love to always have a clean and snug home.</p><p>Elva invited her friends to meet Love when she had settled.</p><p>“She’s so cute,” her friend Lollo said.</p><p>“You’re so lovely, yes you are,” Mia talked silly with Love.</p><p>“Hahaha, did you hear, she purrs, a guinea pig purr,” her friend Roe said.</p><p>“What’s she saying?” Mia asked.</p><p>“She loves all of you,” Elva translated.</p><p>“We love you too, they replied.”</p><p>“She knows,” Elva said.</p><p>“How?” her friends chorused.</p><p>“By the way you look at her, by the way you hold her, by the way you talk to her and by the way you feed her. Here, try to give her some spinach. She loves spinach.” Elva grabbed a bunch from the tray she kept prepared for Love and gave to her friends to feed Love.</p><p>They played with Love until it was time for her friends to go home. They hadn’t done any of the stuff they used to do before Love came to live with Elva, but no one minded.</p><p>“Can we come tomorrow again, please?” All her friends made heart signs with their hands in Love’s direction.</p><p>“Yes, Elva sighed happily, but not on Saturday, we’re going to my cousins on Saturday.”</p><p>“Who’ll look after Love?”</p><p>“I’ll bring her.”</p><p>“How?” her friends chorused again which made Elva giggle. She loved telling her friends all about her new friend and hope they wouldn’t be jealous. There was no need to be jealous as Love made Elva expand and grow. She wanted everyone to feel the same.</p><p>“Look.” Elva showed her pink guinea pig carrier case. She had made it cosy for Love with scrunched up newspaper to hide in, hay and some nibbly fruit and nut bars. She couldn’t wait to bring Love to meet her cousins. Laughter bubbled out of her, she loved her sound of love and thanked Love for teaching her how to laugh.</p><p>“It’s lovely,” her friends laughed with her. Elva thanked them all.</p><p>“Yes, lovely for little Love.” Elva twirled around, adding her trademark pushing out of the stomach. Happiness had made a home in Elva and she was showing it off.</p><p>Her cousins did like Love, they loved her so much they wanted to keep her, or at least get their own guinea pig.</p><p>“A pet is for life, not just for fun,” her cousin’s parents said.</p><p>“Life is fun, it’s even funnier with Love,” Elva spoke up for her cousins. She wished for everyone to have a little Love in their life. After a long day’s play, Elva was exhausted, but still insisted on her night time ritual with Love.</p><p>“You’re so cute, I’d love to let you sleep in my bed, but I won’t, I’ll let you fall asleep on my lap instead,” Elva said to Love when they came home. She stroked her little body while looking into those full of love eyes and fell asleep. Elva’s mum brought Love to her house and Elva to her bed.</p><p>“See you Love, see you tomorrow.</p><p>“Wheek, wheek, wheek.”</p><p>“Awh.” Elva was totally in love.</p><p>The next day, Elva woke up with a sniffle. Her mum gave her extra vitamins in the form of fruit and said her body would do the rest of the healing work automatically and naturally.</p><p>She played and talked with Love before going to school. She always changed her on a Tuesday evening and a Saturday morning. She had a special bin for Love, which was pink too, the colour of love.</p><p>She included Love in every story she wrote in school. She wrote poems about her too, which she was happy to recite for the class, even if they would never win an award. She was in love with Love and everything she wrote was beautiful and wonderful.</p><p>In geography she informed everyone that guinea pigs originally came from South America, and it was part of their culture to eat guinea pigs.</p><p>“I would never eat guinea pigs, they are little love starters, “Elva said, surprising the teacher.</p><p>“Where did you hear that?”</p><p>“I don’t know, I just feel it,” Elva answered truthfully.</p><p>The teacher allowed her to bring in Love for show and tell one week. Elva’s mum brought in Love in her carrier after lunch and Elva talked about Love like she had never talked about anything. Love had transformed Elva and she wanted to make her class understand that a guinea pig was more than a pet, it was a friend.</p><p>“Not as good as your real friends.” The teacher wanted to keep it real, but Elva was more real than she had ever been in her whole life.</p><p>“Love is my best friend, just like all my best friends, there is no one better, but I would die without Love.” Elva perspired and her face turned red.</p><p>“No you would not, it’s a pet, not a human, it’s not good to exaggerate.”</p><p>“I’m not.” Elva put Love into her cage, closed it gently, lifted the cage and began to walk, she continued past her desk and out the door.</p><p>“Elva, come back, we haven’t finished,” the teacher called.</p><p>“I have,” she growled and ran out the door, clutching the carrier while speeding down the street.</p><p>“You’re the best teacher I’ve ever had,” Elva told Love. We’re a good combination.”</p><p>She told her mum what the teacher had said and her mum agreed adults could sometimes be very insensitive.</p><p>“A lot of people think they know all about love but most are still learning, Love is teaching you more than school can in this area.”</p><p>“I bless you mum for you are the best.”  Love bubbled to the surface of Elva.</p><p>Together, Elva and mum set up the adventure track for Love in the living room and let Love run free.</p><p>The next day her mum came with her to school and told the teacher Love was indeed a friend and the thought of living without someone you love can feel like dying. The teacher apologised to Elva, saying she had been uncaring and hardhearted in her view of love.</p><p>“Maybe you should get a guinea pig, they share their love until you’re all loved up.” Elva shook hands with the teacher, before hugging her mum and telling her loudly “I love you” before giving Love, who had come to grant her forgiveness too, to her mum to bring home.</p><p>She scratched her arms but paid no attention to why. In the afternoon, she invited her friends for a guinea pig picnic. She prepared a basket of food, for Love too, and put her in a special lead for guinea pigs and when they found a good grassy spot Elva let Love run free.  Love loved the grass, she was bubbling and purring and wheeking, she was also chutting and whining. They all ate together, and then they took turn snuggling with Love. Elva sneezed and scratched her arms where little red bumps were now visible.  She pulled the blanket over her arms and relaxed in the sun, cuddling with Love.</p><p>People passing commented on their love union, saying they looked lovely together.</p><p>“I know,” she said, we’re both lovely and we’ll be together forever and ever.</p><p>She sneezed and scratched her arms again.</p><p>“Summer colds are the worst,” she said.  At home she covered up with long sleeved shirts and when her mum asked if she wasn’t hot she said she must have got a summer cold and sneezed loudly.</p><p>“You do look like you’ve got a bad dose,” her mum said and looked at her more closely. There was no hiding the red eyes and runny nose. Elva didn’t want to go to the doctor.</p><p>“I’ll be fine. I don’t believe in taking medication for colds and neither do you, mum.”  Elva was right. Her mum let her stay at home to rest and recuperate. Elva played with Love for three days and those days were the best in her life, she could feel herself become Love, become bigger than herself, or smaller, until there was no boundaries, she was a guinea pig too, she played and snuggled and smooched and imprinted Love in her heart forever.</p><p>When her face became blotchy and her nose like a tap, her mum brought her to the doctor.</p><p>She knew what the doctor was going to say, Love had already told her.</p><p>“Elva, you’re allergic to guinea pigs, you’re allergic to Love.”</p><p>She knew it. “OK, just give me the medicine, I’ll take anything you say,” she announced, proud for being brave in a difficult situation.</p><p>The doctor made a sad face and said sorry. Mum said sorry too.</p><p>“NO…there’s no sorry.” Elva’s face dropped and her body slumped to the floor.</p><p>“I’m sorry, there is no medicine. The only cure is to get rid of the guinea pig.”</p><p>“Get rid of….get rid of…Love…NEVER!”</p><p>“I understand how you must feel.”</p><p>“No you don’t. Are you seven? Do you have a guinea pig who’s your best friend in the whole wide world?”</p><p>“No, but…”</p><p>“Well then, you don’t know, and I’m not going to get rid of Love. Thank you and good bye.”</p><p>She got up, banged the door, ran out, continued across the road without looking, then through the park, along the canal, and all the way home. She packed Love into her carrier and ran down to the woods where she had built a retreat for her and Love.</p><p>There she poured her heart out.</p><p>“You are the best friend I have ever had, the best friend I will ever have. You always listen, you never give out, you don’t care if I use the right word or a bad word. We do fun stuff together. We go on adventures. We watch movies together. We discover new things together: you taught me to eat and like spinach, celery and broccoli. Thanks Love.” Elva hiccupped. You taught me to be calm, to slow down, to enjoy the little things, like cuddling and looking into your cute face.”</p><p>She cried so hard she passed out with the effort.  Her mum found her there. Elva had forgotten her mum knew of their retreat, she had invited her for being the best mum ever. Sigrid scooped Elva up into her arms.</p><p>“Mum, you’ll save money if you let me keep Love, I’ll never want to go to Zoo’s, amusement parks, adventure lands or even the beach, as long as I have Love.”</p><p>“Love has certainly taught you all about love, it sets you free, you need nothing else.”</p><p>“Well, you do need food.” Elva gasped for air. She was all cried out.</p><p>“Yes, and I think Love is hungry, or isn’t that what that sound means?” Love made noises of hunger and Elva realised she couldn’t run away from what was happening.</p><p>“I’ll never let anyone take Love from me. NEVER! EVER!” Elva trudged home with her mum wishing for a happy ending.</p><p>Later that evening someone rang the doorbell and a teenage girl introduced herself. Elva overheard their conversation and the loudest shatter ever made Elva jump.</p><p>“Did you hear that mum? That was the sound of my heart breaking.”</p><p>The teenage girl came in to the living room where Elva sat on the floor, holding Love for dear life.</p><p>She sat down on the floor too.</p><p>“Hi, I’m Amor. I’ve been looking for Love for such a long time.</p><p>Elva looked at her with tears streaming down her face.</p><p>“What do you mean? You could have gotten any guinea pig and called her Love. Why do you have to take mine?</p><p>“She’s not mine, just as she was never yours, she’s handed down by the power of love. Do you know what the power of guinea pig is?” Amor asked. Elva shook her head.</p><p>“It’s love, their special power is love.”</p><p>“I called her Love.” Elva stopped crying.</p><p>“You are a special guinea pig lover.”</p><p>Elva liked the sound of that.</p><p>“I can see that you have taken the responsibility of her seriously, she is beautiful.”</p><p>Elva knew Love was beautiful, but Elva didn’t look great. Her eyes were almost blood shot and she had to blink a few times to see properly.</p><p>“Sometimes a pet is not for life; sometimes you are given the power of the pet, which in this case is love, gentleness and responsibility much quicker, like you. I can see you’re a very powerful girl, full of love.</p><p>Elva felt different, better in some strange way than she had a few months ago.</p><p>“Letting go is a hard lesson to learn so early in life,” Amor said, stretching her arms out for Love.</p><p>Elva kissed Love one last time and handed her over to the girl.</p><p>“Will you call her Love?”</p><p>“Yes, that’s her name and her power. Love started wheeking almost immediately. Elva broke into crying again, ripping and crushing crying.</p><p>Sigrid rushed in and hugged Elva close.</p><p>“We all miss Love,” Elva’s mum said, but sometimes the heart has to team up with the brain to reach the best decision for everyone. Love will live in your heart.”</p><p>The girl hugged Elva in a group hug with Love before leaving.</p><p>“You are giving me the best gift in my whole life; it’s not just a guinea pig, it’s Love. I’ll always remember you. Thank you.”</p><p>Elva’s heart didn’t agree to give Love away, but her mum was right, her heart had teamed up with her brain.</p><p>“Well, everyone else in my heart better make room, because my best friend is moving in.”</p>"}