{"title": "The Maiden who loved a Fish", "author": "", "level": "6 to 8,9 to12,", "category": "American Indian,Classic,Folk Tale,", "tag": "Fish,Trout,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>THERE was once among the great tribe of the Marshpees, a small tribe who have their hunting-grounds on the shores of the Great Lake, near the Cape of Storms, a woman whose name was Awashanks. She was rather silly and very idle. For days together she would sit doing nothing. Then she was so ugly and ill-shaped that not one of the youths of the village would have anything to say to her by way of courtship or marriage. She squinted very much; her face was long and thin, her nose excessively large and humped, her teeth crooked and projecting, her chin almost as sharp as the bill of a loon bird, and her ears as large as those of a deer. Altogether she was a very odd and strangely formed woman, and wherever she went she never failed to excite much laughter and derision among those who thought that ugliness and deformity was something to made fun of.</p><p>Though so very ugly, there was one talent she possessed in a more remarkable degree than any woman of the tribe. It was that of singing. Nothing, unless such could be found in the land of spirits, could equal the sweetness of her voice or the beauty of her songs. Her favorite place to sing was a small hill, a little removed from the river of her people, and there, seated beneath the shady trees, she would while away the hours of summer with her charming songs. So beautiful and melodious were the things she uttered that, by the time she had sung a single sentence, the branches above her head would be filled with the birds that came thither to listen, the thickets around her would be crowded with beasts, and the waters rolling beside her would be alive with fishes, all attracted by the sweet sounds. From the minnow to the porpoise, from the wren to the eagle, from the snail to the lobster, from the mouse to the mole—all hastened to the spot to listen to the charming songs of the hideous Marshpee maiden.</p><p>Among the fishes which repaired every night to the vicinity of the Little Hillock, which was the chosen resting-place of the ugly songstress, was the great chief of the trouts, a tribe of fish inhabiting the river near by. The chief was of a far greater size than the people of his nation usually are, being as long as a man and quite as wide.</p><p>Of all the creatures which came to listen to the singing of Awashanks none appeared to enjoy it so highly as the chief of the trouts. As his bulk prevented him from approaching so near as he wished, he, from time to time, in his eagerness to enjoy the music to the best advantage, ran his nose into the ground, and thus worked his way a considerable distance into the land. Nightly he continued his work to approach the source of the delightful sounds he heard, till at length he had plowed out a wide and handsome channel, and so made his passage from the river to the hill, a distance extending an arrow’s-flight. To there he went every night at the commencement of darkness, sure to meet the maiden who had become so necessary to his happiness. Soon he began to speak of the pleasure he enjoyed, and to fill the ears of Awashanks with fond protestations of his love and affection.</p><p>Instead of singing to him, she now began to listen to his voice. It was something so new and strange to her to hear the tones of love and courtship, a thing so unusual to be told she was beautiful, that it is not wonderful her head was turned by the new incident, and that she began to think the voice of her lover the sweetest she had ever heard. One thing marred their happiness. This was that the trout could not live upon land, nor the maiden in the water. This state of things gave them much sorrow.</p><p>They had met one evening at the usual place, and were discoursing together, lamenting that two who loved each other so, should be doomed always to live apart, when a man appeared close to Awashanks. He asked the lovers why they seemed to be so sad.</p><p>The chief of the trouts told the stranger the cause of their sorrow.</p><p>“Be not grieved nor hopeless,” said the stranger, when the chief had finished. “The problems can be removed. I am the spirit who presides over fishes, and though I cannot make a man or woman of a fish, I can make them into fish. Under my power Awashanks shall become a beautiful trout.”</p><p>With that he bade the girl follow him into the river. When they had waded in some little depth he took up some water in his hand and poured it on her head, muttering some words, of which none but himself knew the meaning. Immediately a change took place in her. Her body took the form of a fish, and in a few moments she was a complete trout. Having accomplished this transformation the spirit gave her to the chief of the trouts, and the pair glided off into the deep and quiet waters. She did not, however, forget the land of her birth. Every season, on the same night as that upon which her disappearance from her tribe had been wrought, there were to be seen two trouts of enormous size playing in the water off the shore. They continued their visits till the palefaces came to the country, when, deeming themselves to be in danger from a people who paid no reverence to the spirits of the land, they bade it goodbye forever.</p>"}