{"title": "Marcelle and the Kitchen Monster", "author": "Walter Morales", "level": "6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>This is what happened the night when Marcelle conquered her fear. I was there and this is the story.</p><p>I noticed that Marcelle wasn’t sleeping yet.</p><p>“Having sleep problems Little Marcelle?” I asked.</p><p>“I’m mad!” she said.</p><p>“And why is that?”</p><p>“Because I’m hungry, I don’t want to sleep yet and I’m bored!”</p><p>“Ok, let’s go get something to eat,” I said, like if it was a simple matter and before her answer I noticed a couple of tiny little tears on her tiny little cheeks.</p><p>“I can’t!” She said, “Mommy is out somewhere, the Nanny is already snoring on the couch and that monster…”</p><p>“Did you say monster Marcelle?”</p><p>“Yes! A tall, cold, black giant monster that lives in the kitchen and makes the most horrible noises ever!”</p><p>“I see.”</p><p>She continued, “The monster only listens to Mommy because only she knows how to take food from him. Why does he have to keep our food? That’s unfair! I’m going to starve here!” She started crying.</p><p>I went to Marcelle’s toy box, made an improvised armor for myself and grabbed a lighting-magic-stick for her. “We are going to get some food miss,” I said.</p><p>“But if Nanny sees us…”</p><p>“We will be careful,” I said as I opened the door.</p><p>“But the monster always make those noises when I’m around, it’s like as if he were about to eat me…”</p><p>I had to interrupt her. “Marcelle, we are not just going for food, we are going to face your fear. After tonight, you won’t be afraid anymore because you will know how to tame the monster in order to get food. Let’s go!”</p><p>So we left Marcelle’s room, the pink walls, the pink carpet, the pink curtains and the white bed. We left everything behind and there we were at the edge of the stairs, ready for our adventure.</p><p>We had to be very careful going down the stair because they were old and loud. However, the real danger was waiting for us downstairs.</p><p>In order to get to the kitchen we had to cross the living room. We saw the Nanny’s leg hanging from one side of the couch, is sleeping I thought, so we decided to sneak behind the couch when suddenly…</p><p>“You know what girl? I can’t even…” She wasn’t sleeping, she was talking on her cellphone, and now we were stuck behind the couch.</p><p>“We are lost…,” I said but Marcelle interrupted me.</p><p>“I don’t think so.” Without hesitating she took off her right shoe and threw it to the stairs.</p><p>The Nanny put the cellphone down, stood up, stared at the stairs for a moment and then she got back to the couch and grabbed the cellphone again, “So, where were we? Oh yeah! Romantic Vampires!” she said. It wasn’t enough, we needed a louder sound, so Marcelle took off her left shoe, and threw it farther. This time the shoe hit the door. The Nanny dropped the cellphone and went to the door. “Hello?” she said. She was scared.</p><p>This was our opportunity. We ran as fast as we could to the kitchen, and we made it.</p><p>From the kitchen’s entrance we could see his enormous figure standing there in silence. The monster seemed to be sleeping, so we decided to approach him, walking carefully, trying not to wake him.</p><p>When we got near him we stood in silence for a while, we were amazed by our achievement.</p><p>“We did it,” I said, “and now what?”</p><p>Marcelle was walking around, studying the monster, “Mommy always gets the food from inside of him, so I say we should open him.”</p><p>“Ok, let’s do it together,” I said, “we made it so far so this will be easy.”</p><p>We put our hands on the edge of what it seemed to be a door on the front of the strange creature. “At the count of three we pull together, ready?” The monster’s skin was very cold. We said together, “one, two…”</p><p>Suddenly, our count was interrupted by the most horrifying sound that I’ve ever heard in my entire life. It was like the sound of one hundred buses starting up at the same time, like one thousand trucks honking together, it was a big and loud, “ROAR.”</p><p>Marcelle and I took cover behind a chair, the sound was getting louder and there was nowhere to go.</p><p>“Little Marcelle,” I said, “I’ll will distract him, please leave, save yourself.” I took Marcelle’s lighting-magic-stick and went to face the monster. I was hitting him with all my strength trying to distract him, but Marcelle wasn’t moving. “Go away Marcelle! Run!” I yelled.</p><p>After a while, my arms were getting tired and Marcelle wasn’t moving yet, she was just staring at me fighting the monster. She was crying.</p><p>Suddenly I heard her yelling, “is not fair! I am hungry!” She didn’t mind the roar, she ran directly to the monster’s door and started pulling. I dropped the stick and helped her with door.</p><p>The door opened and the monster threw a sort of orange fluid on us. I pushed Marcelle away and then everything turned orange for me. I just remember Marcelle crying over me, and then I heard Mommy’s voice.</p><p>“Marcelle sweetheart, what are you doing? Are you all right? All the grandma’s carrot soup is on the floor, what happened?”</p><p>Marcelle was sobbing, “I was hungry and you weren’t here, and I didn’t want to sleep, and now Mr. Bunny is all covered in soup.”</p><p>“Oh, Marcelle,” said Mommy grabbing her and closing the monster’s door, “Don’t worry, let’s get something to eat, then we are going to wash Mr. Bunny and he will be all right.”</p><p>The next day I was in the laundry room, happy because I wasn’t orange anymore, and happy because I knew that Marcelle wasn’t afraid of the refrigerator anymore. It doesn’t matter how small we are, we are always capable of conquer our fears. I was clean and ready for another adventure.</p>"}