{"title": "Matt the Swamp Rat", "author": "Trevor Wynn", "level": "3 to 5,6 to 8,", "category": "Modern,Original,Poem,", "tag": "Rat,", "length": "01 - 05 mins,", "body": "<p>Matt the swamp rat was a young boy who wanted to go outside and play. When he asked his mom this what she had to say: “Clean your room and make your bed. Or you will stay inside instead.”</p><p>Matt the swamp rat thought, I want to play outside, in his head. Then decided to clean his room and make his bed. Matt the swamp rat was allowed to go out and play. Which he wanted to make a new friend today.</p><p>He knew where he wasn’t allowed to be. SO I’d better stay within the area mom set for me. Which was no further than that big old oak tree. Or past the swamp in the woods mom told me.</p><p>Matt the swamp rat moved on down the path at an even pace. That’s when he saw a toad and what a face. Old with wrinkles and sad droopy eyes, whenever he moved he let out these cries:</p><p>“Owie, ouchie, these pains make me grouchy.” Matt the swamp rat said “Hey would you like to play? I know you’re old but I was told to respect my elders in this way.”</p><p>Well this surely took the grumpy old toad by surprise. And he didn’t even roll his wrinkled droopy eyes. “Thank you young kid for what you did, but I’m too old now to play. And thank you for brightening my day.”</p><p>I have to think ,think, think, How to make more milk for people to drink. So be on your way ok?” Well before Matt the swamp rat left he said “Thank you for the milk you make. For it taste great with the cookies mom’s bake.”</p><p>“That put’s a smile on my face,” said the cow. “I’m sure I’ll find away to make more milk now.”</p><p>Matt the swamp bunny wait he’s a rat that’s not funny. Went further to see what he could see And that’s when he noticed this monstrous tree.</p><p>It was big around and very tall. Surely had to be the largest tree of them all. It was that big old oak tree which had acorns all around A squirrel was trying to gather them from the ground.</p><p>Would you like to play on this beautiful sunny summer day. No, no, no, I cannot play. I’m storing nuts in this tree. To survive the winter for my family you see.</p><p>So be on your way ok. Matt the swamp rat said well I hope you get as much food as your family needs. Like berries, nuts and even seeds.</p><p>Why thank you young kid and have a good day. Oh and I hope you find the fun you’re looking for today</p><p>Matt the swamp rat, not bunny, He, He, that was kind of funny. Well he ran across this bear and asked would you like to play. On this beautiful summer day.</p><p>The bear growls “I’m hungry for honey you see. But it’s in this tree. I try and try to get this delicious golden treat. But now with all my struggles I have to accept defeat.</p><p>“Well sorry Mr. Bear,” Matt the swamp rat said “for your bad luck. Maybe you can reach in that hole in the tree or are you afraid you’ll get stuck?” “I’m not afraid of anything,” the bear growled, “you’ll see.” Then reached right into the tree</p><p>Yahoo!! He had howled and when he removed his paw. It was covered in honey they both saw. “Thank you thank you my little friend. You are welcome back again.”</p><p>“Please excuse me I have to chow down. To fatten up for my hibernation underground.” Matt the swamp rat made a lot of people happy today. But didn’t find a friend that wanted to play.</p><p>So he went home and called it a day.</p><p>He told his mom of all the things he had done. That’s when the door bell was rung. It was a new kid Billy Bob who moved next door and wanted to play. “My name is Matt I’m a swamp rat and I’ll see what my mom has to say.”</p><p>“Go ahead son and enjoy the rest of the day. But don’t be late for supper or you’ll be grounded I say.” “Thanks mom Matt said happy as could be. I’ll be home for supper you’ll see.”</p><p>Matt and Billy Bob became very good friends. That never came to an end.</p>"}