{"title": "The Miller, his Son and their Donkey", "author": "", "level": "3 to 5,6 to 8,9 to12,", "category": "Audio,Classic,Fable,Fairy Tale,Folk Tale,", "tag": "Ass,Donkey,", "length": "01 - 05 mins,", "body": "<p>ONCE upon a time there was a miller who lived in a little house beside his mill. All day long he worked hard, but at night he went home to his wife and his little boy.</p><p>One day this miller made up his mind that he would take his donkey to the fair and sell it. So he and his boy said farewell to their lady and started off. They had not gone far when they met a number of girls coming from the town.</p><p>“Look!” said one of them. “Did you ever see such stupid fellows? They are walking when one of them might be riding.”</p><p>When the miller heard this he told the boy get up on the donkey, while he tramped along merrily by its side. Soon they came to a number of old men standing by the side of the road talking together.</p><p>“Look at that,” said one of them, “Look at that young rascal riding, while his poor father has to walk. Get down, you idle fellow, and let your father ride.”</p><p>Upon this the son got down from the donkey, and the miller took his place. They had not gone very far when they met two women coming home from market.</p><p>“You lazy old man!” they cried at once. “How dare you ride when your poor little boy is walking and can hardly keep pace with you?”</p><p>Then the miller, who was a good-natured man, took his son up behind him, and in this way they went to the town.</p><p>“My good fellow,” said a townsman whom they met, “is that donkey your own?”</p><p>“Yes,” replied the miller.</p><p>“I should not have thought so, by the way you load him,” said the man. “Why, you two are better able to carry the beast than he is to carry you.”</p><p>“Well,” said the miller, “we can but try.”</p><p>So he and his son got down, and tied the legs of the donkey together. Then they slung him on a pole, and carried him on their shoulders. It was such a funny sight that the people laughed and jeered at them.</p><p>The poor donkey was very uncomfortable, and tried hard to get off the pole. At last, as they were passing over a bridge, he pulled his legs out of the rope and tumbled to the ground. He was so frightened that he jumped off the bridge into the river and was drowned.</p><p>Do you know what this story teaches you?</p><p>If you try to please everybody, you will please nobody.</p>"}