{"title": "Molly’s Little Red Wagon", "author": "Sharon Krager", "level": "6 to 8,9 to12,", "category": "Christmas,Modern,Original,", "tag": "", "length": "05 - 10 mins,10 - 15 mins,", "body": "<p>(A story from Grandma’s childhood)</p><p>Molly opened her eyes to see her sister, Michele, sitting up in bed.</p><p>It was Christmas morning, and the sun had not yet come up. The lamp on the bedside table was on and casting shadows all over the room.</p><p>“What’s wrong Michele?” asked Molly. “You had better lay back down for a while. It is too early to get up. There are no noises in the house, and that means Mama and Papa are not up yet.”</p><p>“I don’t know,” said Michele. “I just am so excited to see what Santa has brought for us this year. I want to sneak down stairs and take a peak. We can be very quiet.”</p><p>“Do you remember last year?” asked Molly. “We just wished for the new year to come so that it would be 1955. That meant we would be able to move into this house. After living with Grandma and Grandpa for so long, we were ready to have our own room. But, the house needed a lot of work, and it was worth the wait. Now it is almost 1956. The new year means a new beginning, like Papa always says.”</p><p>“Yes, I remember Molly,” said Michele.</p><p>“I sure hope he brought me that red wagon I asked for,” said Molly. “I have plans of doing lots of things with that wagon.”</p><p>Michele climbed in bed with Molly and they laid there until they couldn’t wait any longer. Slowly they climbed out of bed, opened their bedroom door, and quietly crept down the stairs to the living room.</p><p>Underneath the beautifully decorated Christmas tree, were several wrapped up gifts.  Silver tinsel hung from the top of the tree to the bottom. Bubble lights hung on many of the branches along with glass ornaments of all colors, and strings of colored paper garlands. They looked everywhere, but could not see a red wagon.</p><p>They walked on into the room to check behind the tree. It wasn’t there. Michelle picked up a small package with green wrapping and lightly shook it to see if she could hear something. She put it back under the tree.</p><p>“I guess Santa was too busy this year to bring me one,” Molly whispered.</p><p>Just then they heard a noise on the front porch. They hid behind the couch. They weren’t really scared, because everyone in town felt safe enough to leave their houses unlocked all of the time. Thinking it might be Santa, they waited until all was quiet. Then, they tiptoed to the front door. Daylight was beginning to show itself. Peeking through the curtain on the door, they could see the outline of something big.</p><p>Opening the door, they almost fell over the most beautiful new red wagon they had ever seen. Inside of the wagon was a folded piece of paper sitting on top of a black and white teddy bear.. Molly reached for it and opened it up. The note read:</p><p>Molly, I know that you wanted a new red wagon. Use it to help others in any way that you can, and it will be special to everyone that you meet. The teddy bear is for your sister Michele. She had been eying it in the big window at the Five and Dime for a long time. Merry Christmas</p><p>Too excited to go back to bed, they waited by the tree for their parents to come down. Molly and Michele were so happy, and they told their parents about finding the wagon and the teddy bear on the front porch. They had a wonderful Christmas Day.</p><p>The first part of winter was very cold and snowy. Molly decided that when the snow melted away, she was going to put the new wagon to good use. She made a list of things she could do in her neighborhood to help others. She could hardly wait.</p><p>The first day came in the middle of February, when Molly was able to go outside. The cold winter had taken a break, the sun was shining, and it was almost as warm as spring. Michele decided to go out and play on the swing hanging in the big oak tree in the back yard. Molly went next door to Mr. Hall’s house. Knocking on the door, she practiced what she was going to ask him when he answered.</p><p>“Hello Molly,” said Mr. Hall. “How are you today?”</p><p>“I am fine,” she answered. “Do you have any cut wood back behind your building that you would like brought up to your back porch? I have a wagon now. I can carry it up here for you.”</p><p>“Well, I think I do,” he said. “Let me grab my shoes, and we will go back there and see. Where did you get such a nice wagon?”</p><p>“Oh, I got it for Christmas, and I am going to use it to help others,” she said. Molly pulled on the straps of her blue jean coveralls and bent down to tie her shoes. Her curly red hair looked brighter than usual, and she pushed it back off of her forehead. Her freckled face shone with delight.</p><p>They went around to the back of the large building in his back yard. There, piled higher than Molly, was enough wood for the whole winter. Mr. Hall laid an old blanket down in the wagon and then they both filled it up as high as they could with the wood.</p><p>Molly and Mr. Hall emptied it right by the steps of the back porch.</p><p>“Thanks so much Molly,” said Mr. Hall.</p><p>She told him that he was welcome, and she went on her way.</p><p>After that, Molly went down the street to Mrs. Brian’s house. She knew that the elderly lady walked to town once a week to pick up what few groceries she could carry in her arms. She didn’t usually like help, because many times the grocer offered to bring them to her. She had always said that she liked walking to town, and that it was one thing she was still able to do. The only time she let someone bring things to her, was in the dead of winter when her Son came to check on her. Even though the answer was probably going to be “NO”, Molly decided to go anyway.</p><p>When she reached the front steps of Mrs. Brian’s house, Molly almost ran into her coming out of her door.</p><p>“Hello, Molly,” Mrs. Brian said.</p><p>“Hello, Mrs. Brian,” Molly answered back. “I was coming over to see if you would like for me to go and pick up some groceries for you in town.”</p><p>“Oh, I can get my own groceries dear,” said Mrs. Brian. “I don’t really need any help. But, if you would like to walk along with me, that would be just fine.”  Mrs. Brian pulled her head scarf  down over her ears. She never went outside without one on her head.</p><p>As they walked, Molly glanced over to the one room school house set back a little off of the main road just one block away from Mrs. Brian’s house. It was a busy place on school days. It held students from first grade to eighth grade. Each grade had a section to sit in, and everyone went out to recess at the same time. Molly liked going to school. She imagined in her mind taking her red wagon and packing other student’s books in it.</p><p>They passed the corner drug store where a lot of the older kids in town went to hang out after school. Molly had been there several times with her mother. The malts were the best in the world. Her favorite was chocolate.</p><p>Molly and Mrs. Brian walked together three blocks into town. Molly waited outside while the elderly lady went into the corner grocery store. When Mrs. Brian came out, Molly offered to put the heavy grocery sack into the wagon and Mrs. Brian agreed.</p><p>“Sometimes these groceries can be pretty heavy trying to get them back home,” said Mrs. Brian. “I really appreciate this Molly.” She reached into the brown paper sack and pulled out a slow poke caramel sucker and gave it to Molly.</p><p>Molly thanked her and stuck it in her side pocked to eat later when she got home.</p><p>“I would like to help you every week when you go into town,” Molly said.</p><p>“I think that would be a nice idea,” Mrs. Brian said with a smile. “I think that red wagon of yours is going to be very handy. Even though I don’t need help, I sure do like the company.”</p><p>Finally getting back to her house, Molly saw Mother standing on the front porch.</p><p>“Where have you been Molly?” she asked</p><p>“I was helping Mr. Hall get some wood from behind his building to his back porch, and Mrs. Brian bring her groceries home from town,” Molly piped in.</p><p>“I think those are very nice things to do,” Mother said. “But, I want you to tell me where you are going, so that I know where you are. I called for you, and didn’t see you anywhere.”</p><p>Molly understood. She promised to tell Mother where she was going with her new red wagon whenever she went out to help someone. She asked Mother if she could give Michele a ride in her wagon. She wanted to take her down to the park to play for a while. Mother said that she could. Before she took off again, she enjoyed a hot cup of cocoa with her sister on the front porch swing.</p><p>When they got to the park, lots of their friends were there to greet them. They all wanted to take turns riding in the new red wagon. Molly couldn’t wait to let them take turns being wheeled around the park. One after another, they got to ride in the new red wagon.</p><p>On the way back to the house, Molly and Michele picked up trash along the way. The little red wagon was helping to keep the neighborhood clean.</p><p>Jack Turner was sitting on the sidewalk about a block from his house.</p><p>“Hello, Jack,” Molly yelled.</p><p>Jack’s mew Schwinn bike was lying in the grass beside him. One of his tires was flat.  Newspapers were spread out all over the sidewalk beside him. The handlebars were bent, and Jack had a skinned up knee.</p><p>“What happened?” Molly asked</p><p>“I hit the curb and had a wreck,” Jack cried. “I can’t believe this happened, and with my new bike.”</p><p>Molly and Michele helped him pick up the newspapers. They helped Jack get his bike back home, and emptied the trash that they had gathered into the garbage can by his garage.</p><p>“You know,” Molly said. “This new red wagon of mine can help deliver all of the newspapers if you like.”</p><p>“Well, if you want to, that would be nice,” Jack said.</p><p>Together all three of them told their parents what had happened and that they were all going to make sure the newspapers got delivered.</p><p>Molly had decided that there were many good things that she and her wagon could help others do.</p><p>After a while, Molly knew a lot of people that needed help. Her new red wagon became a wood carrier, a grocery cart, a newspaper delivery truck, a ride for some of the puppies, a wagon in the main street parade, a taxi for her friends, a down the hill go cart for her and Michele, a teddy bear bed, a vegetable wagon and so much more.</p><p>Molly used her wagon to help others like the note from Santa asked her to do. And, it did become special to everyone.</p>"}