{"title": "Molly the Waller", "author": "Jeffrey Duchene", "level": "3 to 5,6 to 8,", "category": "Modern,Original,Poem,", "tag": "Rabbit,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Molly-the-Waller-final-opt-1.jpg'></img><p>From sunrise to sunset, most every day, One could find Molly, in her usual way. She worked at a pace, that suited her best. Building a wall, in her cap and pink vest.</p><p>From the time she was young, just a wee lass, she would gather up stones from the trail and the pass. She studied, then placed them, with a long line of string. One stone at a time, as she’d whistle and sing.</p><p>No matter the day, from spring until fall, she found herself happy just building a wall.</p><p>She had tried other things that other folk do. Like woodwork, and painting, and fixing a roof. Was a cabby, a plumber, and once… was a cop! But she found it too busy, and told herself… “Stop!</p><p>Go back to the thing that you love to do best. Just building a wall, in your cap and pink vest.”</p><p>And then one day…</p><p>Along came the beaver, and he asked for her help. “I am building a wall, not just for myself. But for all the good creatures, like trout and the frog. For the birds in the sky. I can start with a log. And if you can put stones, well then soon enough stands, not just any wall, but a strong mighty dam!”</p><p>Together they worked by the stream all alone, With the downing of tree, and the stacking of stone. “Many thanks!” Said the Beaver. “Till the end it will be. For the good of all critters. Just wait till they see!”</p><p>“Not a problem,” said Molly. “It is what I do best.” “I love building a wall, in my cap and pink vest.”</p><p>And then one day…</p><p>Along came the preacher, the teacher, and then, the farmer, the fireman, the gravedigger and… They needed a Waller, with skill and with haste. They all wanted Molly, to border their space.</p><p>“Not a problem,” she said. “But a holiday first.” Then a wedding with Desmond, and when they returned. They worked close together at what they did best, but with six little helpers, in a cap and pink vest.</p>"}