{"title": "The Musicians of Bremen", "author": "Brothers Grimm", "level": "3 to 5,6 to 8,9 to12,", "category": "German,", "tag": "Ass,Cat,Dog,Rooster,", "length": "05 - 10 mins,", "body": "<p>A CERTAIN man had a donkey that had served him faithfully for many long years, but whose strength was so far gone that at last he was quite unfit for work. So his master began to consider how much he could make of the donkey’s skin, but the beast, perceiving that no good wind was blowing, ran away along the road to Bremen. “There,” thought he, “I can be town musician.” When he had run some way, he found a hound lying by the roadside, yawning like one who was very tired. “What are you yawning for now, you big fellow?” asked the ass.</p><p>“Ah,” replied the hound, “because every day I grow older and weaker; I cannot go any more to the hunt, and my master has well-nigh beaten me to death, so that I took to flight; and now I do not know how to earn my bread.”</p><p>“Well, do you know,” said the ass, “I am going to Bremen, to be town musician there; suppose you go with me and take a share in the music. I will play on the lute, and you shall beat the kettledrums.” The dog was satisfied, and off they set.</p><p>Presently they came to a cat, sitting in the middle of the path, with a face like three rainy days! “Now, then, old shaver, what has crossed you?” asked the ass.</p><p>“How can one be merry when one’s neck has been pinched like mine?” answered the cat. “Because I am growing old, and my teeth are all worn to stumps, and because I would rather sit by the fire and spin, than run after mice, my mistress wanted to drown me; and so I ran away. But now good advice is dear, and I do not know what to do.”</p><p>“Go with us to Bremen. You understand nocturnal music, so you can be town musician.” The cat consented, and went with them. The three vagabonds soon came near a farmyard, where, upon the barn door, the cock was sitting crowing with all his might. “You crow through marrow and bone,” said the ass; “what do you do that for?”</p><p>“That is the way I prophesy fine weather,” said the cock; “but because grand guests are coming for the Sunday, the housewife has no pity, and has told the cook-maid to make me into soup for the morrow; and this evening my head will be cut off. Now I am crowing with a full throat as long as I can.”</p><p>“Ah, but you, Red-comb,” replied the ass, “rather come away with us. We are going to Bremen, to find there something better than death; you have a good voice, and if we make music together it will have full play.”</p><p>The cock consented to this plan, and so all four traveled on together. They could not, however, reach Bremen in one day, and at evening they came into a forest, where they meant to pass the night. The ass and the dog laid themselves down under a large tree, the cat and the cock climbed up into the branches, but the latter flew right to the top, where he was most safe. Before he went to sleep he looked all round the four quarters, and soon thought he saw a little spark in the distance; so, calling his companions, he said they were not far from a house, for he saw a light. The ass said: “If it is so, we had better get up and go farther, for the pasturage here is very bad”; and the dog continued: “Yes, indeed! a couple of bones with some meat on would be very acceptable!” So they made haste toward the spot where the light was, and which shone now brighter and brighter, until they came to a well-lighted robber’s cottage. The ass, as the biggest, went to the window and peeped in. “What do you see, Gray-horse?” asked the cock. “What do I see?” replied the ass; “a table laid out with savory meats and drinks, with robbers sitting around enjoying themselves.”</p><p>“That would be the right sort of thing for us,” said the cock.</p><p>“Yes, yes, I wish we were there,” replied the ass. Then these animals took counsel together how they should contrive to drive away the robbers, and at last they thought of a way. The ass placed his forefeet upon the window ledge, the hound got on his back, the cat climbed up upon the dog, and, lastly, the cock flew up and perched upon the head of the cat. When this was accomplished, at a given signal they commenced together to perform their music: the ass brayed, the dog barked, the cat mewed, and the cock crew; and they made such a tremendous noise, and so loud, that the panes of the window were shivered! Terrified at these unearthly sounds, the robbers got up with great precipitation, thinking nothing less than that some spirits had come, and fled off into the forest, so the four companions immediately sat down at the table, and quickly ate up all that was left, as if they had been fasting for six weeks.</p><p>As soon as they had finished, they extinguished the light, and each sought for himself a sleeping-place, according to his nature and custom. The ass laid himself down upon some straw, the hound behind the door, the cat upon the hearth, near the warm ashes, and the cock flew up on a beam which ran across the room. Weary with their long walk, they soon went to sleep.</p><p>At midnight the robbers perceived from their retreat that no light was burning in their house, and all appeared quiet; so the captain said: “We need not have been frightened into fits”; and, calling one of the band, he sent him forward to investigate. The messenger, finding all still, went into the kitchen to strike a light, and, taking the glistening, fiery eyes of the cat for live coals, he held a lucifer match to them, expecting it to take fire. But the cat, not understanding the joke, flew in his face, spitting and scratching, which dreadfully frightened him, so that he made for the back door; but the dog, who laid there, sprang up and bit his leg; and as he limped upon the straw where the ass was stretched out, it gave him a powerful kick with its hind foot. This was not all, for the cock, awaking at the noise, clapped his wings, and cried from the beam: “Cock-a-doodle-doo, cock-a-doodle-do!”</p><p>Then the robber ran back as well as he could to his captain, and said: “Ah, my master, there dwells a horrible witch in the house, who spat on me and scratched my face with her long nails; and then before the door stands a man with a knife, who chopped at my leg; and in the yard there lies a black monster, who beat me with a great wooden club; and besides all, upon the roof sits a judge, who called out, ‘Bring the knave up, do!’ so I ran away as fast as I could.”</p><p>After this the robbers dared not again go near their house; but everything prospered so well with the four town musicians of Bremen, that they did not forsake their situation! And there they are to this day, for anything I know.</p>"}