{"title": "The Nervous Spider", "author": "Brian Martin", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Spider,", "length": "Over 20 mins,", "body": "<p>Adrian felt his web shake and immediately felt nervous. He always hated this moment, when an insect trapped itself in his web.</p><p>He knew he was expected to rush over and finish them off. A quick bite to paralyse them and then wrap them in silk. It’s what he was brought up to do. And of course he was hungry.</p><p>Adrian sat in the centre of his web and hesitated. What if it’s frightened, or angry? He didn’t want to have to deal with that. Meanwhile, the web shook more and more violently. He started to worry. He began to worry that if he didn’t do something, it might bring the whole web down.</p><p>“Go on you wimp, get in there for kill, scaredy pants!” heard Adrian from behind. He looked back and across to his neighbour, Biffer, the nasty spider that lived next to him in his web on a nearby branch. He was about three times the size of Adrian. He was always teasing him and calling him names. Biffer had a mean smile on his face as he raced closer to the edge of his web, only inches from Adrian’s. It was as if he was delighted that Adrian was uncomfortable. He stopped, puffed up his chest and looked around to make sure the other spiders all around were listening.</p><p>“Or are you too chicken?” mocked Biffer. “Bock bock, bock bock BAWCK!” Adrian heard the laughter of all the spiders in the webs close by.</p><p>“I’ll hop over and finish him off for you if you’re too scared!” continued Biffer, to more laughs all round. That was of course the last thing Adrian wanted.</p><p>“No need, Biffer, I’ve got the situation under control,” replied Adrian, more firmly than he felt. He decided to go over and just do what nature intended. It’s what he always did. To get it over with. The sooner he did it, the sooner he could get some peace again. From the insect and from Biffer. But he didn’t like it. He dashed off, his legs expertly dancing over the non-sticky parts of the web towards his prey. He heard Biffer shout something else he couldn’t quite make out, causing another peal of laughter from the others.</p><p>When he arrived at the far side of the web, he found there was a large fly thrashing around, trying to escape. It was only getting itself more stuck in the silk of the web. Adrian couldn’t help noticing its huge head, much larger than usual. When it saw Adrian, its huge eyes bulged in panic.</p><p>“No!” it cried. “Don’t bite me, please!”</p><p>Adrian stopped short. He was quite shocked, as none of his victims had ever spoken to him before. He thought he might be hearing things.</p><p>“Eh, excuse me?” he asked. “Did you actually say something there?”</p><p>“Yes,” replied the fly. “I said, please, please don’t bite me. Please!” It immediately started thrashing again, trying to free itself.</p><p>“Stop bouncing around, you’re shaking my web, you might break it,” replied Adrian.</p><p>“I couldn’t care less about your horrible web,” it responded. “You are so nasty, trapping people like this. You should be ashamed. You deserve to be…”</p><p>The fly stopped itself and thought again.</p><p>“Sorry, I don’t mean to take it out on you,” it said.  “I know this is just what you do. But when you’re the one that’s caught, well it’s not very pleasant, is it?”</p><p>“That’s amazing,” replied Adrian. “I have never heard a fly speak before. You do have a funny accent, but perfectly understandable.”</p><p>The fly had stopped thrashing around at this stage, but it was still gulping air. It stared its big eyes at Adrian, awaiting his next move. Adrian stared back at the fly.</p><p>“Well, it’s been lovely chatting, but I suppose I better get on with the bite now,” said Adrian. “I’ll try to do it quickly so it won’t hurt too much, I promise.”</p><p>The fly started to weep floods of tears.</p><p>“Ah now, don’t be like that,” said Adrian. “It’s not that bad, this sort of thing happens all the time in nature. It will be over very quickly, I promise. I’ll be eating you in no time.” Adrian tried a bit of a smile to show the fly his softer side and that he wasn’t all bad.</p><p>“Actually technically, it’s drinking, not eating,” replied the fly.</p><p>“Excuse me? Drinking? How do you mean?” asked Adrian.</p><p>“Well, after you bite me, your poison, it’s called venom, it turns my insides into mush. Then you suck it all out, like drinking from a straw. Drinking, not eating. Surely you know that? I mean, you must do it all the time.”</p><p>“I never thought of it like that before,” said Adrian. “I do believe you are right. OK then, I’ll be drinking you in no time!”</p><p>The fly’s face fell. “It doesn’t make me feel better that you realise that now,” it replied and immediately started to cry again.</p><p>“Ah no, don’t start with the water-works,” replied Adrian. “I hate it when you guys start blubbering, I really do. This sort of thing happens all the time, it’s nothing to be upset about.”</p><p>The fly looked up at Adrian. “You guys? That’s not very nice you know, to speak to me like that. You guys, you say, as if we’re all the same, not individuals with hopes and dreams of our own for the future. You are not being very sensitive.”</p><p>Adrian felt a bit guilty as the fly continued on speaking, almost as if to himself.</p><p>“I never got to say goodbye to Margie and Damian. They’ll be upset and they’ll wonder what happened to me and be worried.”</p><p>“Who are Margie and Damian?” Adrian found himself asking.</p><p>The fly smiled a dreamy smile through the tears. “Margie is the love of my life,” it said. “We met some time ago at the edge of a jam sandwich. She got trapped by the stickiness and I managed to get her out. We fell in love. We’ve been so happy together. Then we had Damian, he’s my little boy. He is such fun. When tries to fly he keeps bumping off the ground before he takes off. He makes us so proud.”</p><p>At this stage Adrian felt something. He didn’t know what it was, but he felt something inside.</p><p>“What’s keeping you?” heard Adrian from a distance. It was Biffer. He was still watching from the edge of his web. “No need for a heart-to-heart, wimp, just go in and bite!” continued Biffer. “You don’t have to listen to his life-story!” Again, Adrian heard more laughter.</p><p>“What’s your name?” asked Adrian, softly.</p><p>“Why?” replied the fly. “Why do you need a name on your meal? Doesn’t that make it harder, to eat something with a name?”</p><p>“What is it?” insisted Adrian. “Tell me or I’ll finish you off right now.”</p><p>The fly looked back at Adrian. “It’s Brainfly,” he replied. “My parents always said I was really smart, so they called me Brainfly. Maybe it’s my big head. Silly name I know.”</p><p>Adrian looked at Brainfly and looked away. Then he looked back again.</p><p>“How come you can speak?” asked Adrian. “That’s never happened. I can honest say I have never, ever held a conversation with my lunch before.”</p><p>“I grew up on a tree not far from here,” replied the Brainfly. “There were spiders all around and I used to listen to them at night talking. After a while I started to understand what they were saying to one another. I used to keep well away, but one night I started to try to speak to them. They were laughing at me and kept inviting me over to their webs so that I could speak some more to them, but of course I never did. I didn’t trust them.”</p><p>“Why not?” asked Adrian.</p><p>“Well, I could understand what they were saying,” replied Brainfly. “They were always talking about food and what a great lunch they had on this insect or that. I knew that if I went over I’d never get away. But I kept listening and speaking from a distance.”</p><p>Adrian was getting tired from all the chatting. “Listen, Brainfly. I like you, you are nice. You have a wife, a little kid. I feel guilty eating you. No, sorry, drinking you. But on the other hand, I am a spider. Spiders have to eat. I get hungry and in spite of how I like you personally, you look delicious. Use that big brain of yours. What should I do? What would you do in my situation?”</p><p>Brainfly thought a moment.</p><p>He looked back.</p><p>He looked away.</p><p>Thinking, thinking.</p><p>“It’s breaking the rules if I tell you,” he replied. “We’re not supposed to tell anyone about it.”</p><p>“Not supposed to tell anyone about what?” asked Adrian.</p><p>“If I tell you about what, then I will have told you what I’m not supposed to tell you, stupid.”</p><p>“If you don’t, you’ll be mush in minutes,” replied Adrian, not happy at being called stupid, especially by a fly.</p><p>Brainfly looked away, torn. He looked back at Adrian. “Promise you won’t tell a soul?” he whispered.</p><p>“We’ll see,” said Adrian. “You’re not exactly in a strong position to ask for anything.”</p><p>Brainfly looked around to see if anyone was close enough to hear.</p><p>“OK then. I’ll trust you. Become a vegetarian,” he whispered. “Move to Splyderville and become a vegetarian.”</p><p>“Whoa there!” laughed Adrian. “What’s a vegetarian? And what and where is this Splyderville?”</p><p>“A vegetarian is someone who only eats plants,” replied Brainfly. “You could just eat plants.”</p><p>“I’m not sure I like the idea of that,” replied Adrian. “It doesn’t sound very tasty, or nutritious. That’s not natural for a spider, I’m sure.”</p><p>“No, no,” replied Brainfly. “I studied this at Splyderville University. Not all spiders in the world eat flies or insects, in fact. I learned that there are forty thousand species of spider and there is one called Bagheera kiplingi that eats plant buds.”</p><p>“Flies go to university?” asked Adrian. “That’s ridiculous.”</p><p>“Not a lot of people outside of Splyderville know about the university,” replied Brainfly. “It’s only for the gifted flies that are discovered early. The clever young spiders of Splyderville also go. We go together.”</p><p>“Hang on just a minute,” demanded Adrian. “You really expect me to believe there’s a place called Splyderville where spiders and flies go to university together? You really think I must be an idiot if you think I’m going to swallow that one. I know I’m the spider, but you’re the one spinning a web of lies to save your skin! That’s it, I’ve had enough of this. I’m going to finish you off!”</p><p>“No, no!” cried Brainfly. “It’s really true! It’s a wonderful place. I think you’d love it there. You wouldn’t have to kill insects any more. Instead you would be eating the most delicious plant-buds all day long as you live in harmony and fun with us flies.”</p><p>“And how did this so-called Splyderville get set up in the first place?” asked Adrian. “How come the spiders don’t just take over and eat all the flies?”</p><p>“Our founding father, he’s called Papa Juan Carlos, he set it up,” replied Brainfly. “He’s a Baheera kiplingi himself. After leaving his home in Mexico, he travelled the world as a performing acrobat in a circus, met Lucy, his wife, had forty seven children and ended up staying here. When the other spiders around noticed that none of his family ever ate flies or insects, they were curious. He taught them how to survive without needing to trap and eat insects. The flies moved in a short time later, as they felt so safe there. Before long a whole community was established. I only moved in with Margie and Damian last month when I heard about it. I’m sure he’d love to meet you if you decide to abdicate.”</p><p>“Abdicate? What’s that?” asked Adrian.</p><p>“Abdicate is the name we use for what a spider does who decides to give up normal spiderhood move across from their normal insect-eating world into Splyderville. There’s even an abdication team to help.”</p><p>“This is just too far-fetched,” replied Adrian, shaking his head. “You really expect me to believe all that? It’s just a cock-and-bull story you have made up to trick me into releasing you.” Then Adrian hesitated. “How do I know if these plant buds taste OK?” he continued. “They sound disgusting.”</p><p>“I can get some for you,” replied Brainfly quickly. “If you release me, I’ll bring it back for you straight away. You can try it before you abdicate.”</p><p>“Nice try, Brainfly. Once I release you, I’ll never see you again, that’s for sure. And I never said I would do this so-called abdicate thingy.”</p><p>“No, I swear, eh, your name, what’s your name?” asked Brainfly. “We’ve been talking all this time and I don’t even know your name!”</p><p>“Adrian.”</p><p>“I swear Adrian, on my fly-honour, I will return with the most delicious plant buds you have ever tasted. All the spiders are allowed try out the food before they move in. To find out if they will like it or not in advance. I can go there and bring back some food for you. I can even call out the abdication team and we can take you out of here forever. Please, you’ll love it in Splyderville Adrian. Mate. Buddy. My friend?” Brainfly finished this with a brave smile.</p><p>Adrian sat and thought to himself. Splyderville? Abdication team? Plant buds? This was getting more ridiculous by the minute. A place where spiders and flies live in harmony together? It really must be a made-up place just so this devious fly can escape his web. Here was a brainy fly, the brainiest he had ever met, that was for sure. He could talk, he was friendly. He had a wife. A little kid. He was claiming that there existed a place where spiders and flies could live together? Without the spiders eating them? Crazy!</p><p>Adrian was torn. But what if such a place really did exist? A tiny spark of hope lit up inside him. He realised he wanted to believe it could be true. What to do? He could eat (or drink) Brainfly for a quick snack and that would be that. Or, he could give him a chance. If he came back, then it might be a solution to his problem. If not, then what had he lost? There’ll be more insects along in time and at least he could say he tried to find a different way.</p><p>Finally Adrian turned back to Brainfly, who was waiting with a strained look of patience on his face. “OK, I’ll let you go,” said Adrian. “But you have to promise to come back with the plant buds. No trickery. Cross your wings and hope to die.”</p><p>“Oh thank you, thank you,” replied Brainfly. “I cross my wings and hope to die.” He beamed a huge smile back at Adrian, who couldn’t help himself smiling back.</p><p>Adrian got busy untangling Brainfly from the silk. It was hard work, as he was more used to wrapping up his victims in silk rather than releasing them. It was all he could do to stop himself biting his venom into the now calm insect in his web.</p><p>“Please release me, let me go,” sang Brainfly cheerily, laughing as did so.</p><p>“What’s going on over there?” called Biffer from the far side. “Don’t tell me you are releasing him? That’s breaking spider laws! Insects may NEVER be released from a web once they are trapped, you traitor! We have our reputation to think of. The punishment is very hard!”</p><p>Adrian ignored him and after much work, Brainfly was free. He buzzed his wings and hovered in the air above Adrian.</p><p>“Thanks,” said Brainfly and he was gone.</p><p>“You’ll regret this!” shouted Biffer from his web. “I’ve reported you to the Spolice. They’re going to wrap you up and throw away the key.”</p><p>Adrian groaned inwardly. The Spolice were the dreaded police force of the spider community. They were known for how cruelly they like to treat their prisoners. Wrapping them up tightly so they couldn’t even move. Giving them hardly any food. Teasing them, making fun of them, poking them. Making their lives miserable. He had forgotten that releasing a fly was breaking the law in the world of spiders. He gulped and started to feel sick.</p><p>Adrian returned to the centre of his web. One hour passed. No Brainfly. Two hours. Three hours. Still no Brainfly. No plant buds. No nothing. Just the angry words of Biffer as he continuously filled him in on how soon the Spolice would be arriving.</p><p>What a fool I have been, thought Adrian. I should never have listened to that crafty little fly. Vegetarian spider my foot.  Splyderville, living in harmony with flies. Bah! What a joke. I’ll be the laughing stock of the spider community as I’m hauled off by the Spolice. He felt his tummy rumble. He drifted off to fitful, restless sleep, dreaming of being wrapped up like a trussed-up turkey at the centre of the Spolice prison web, unable to move.</p><p>Some time later, Adrian awoke to the feel of his web shaking violently. He looked across to see Biffer moving towards him, surrounded by three Spolice officers looking very serious and angry.</p><p>“That’s him, arrest him!” called Biffer. “He released a perfectly good and juicy fly earlier. I heard them talking and then he let him go. He didn’t perform his spiderly duties!”</p><p>Adrian raced away to the far end of his web. I’m done for now, he thought. He closed his eyes and waited for what would happen. I hope they won’t hurt me too much, he prayed.</p><p>Then, as Biffer and the Spolice moved ever closer towards him, he heard the sound of buzzing above his head. He opened the pair of eyes on the roof of his head and looked up. There were three flies hovering above. The smallest one seemed a bit unstable, it kept bashing off the other two uncontrollably.</p><p>“Hello!” cried Brainfly. “Say hello to Margie and Damian. They wanted to come to say thanks!”</p><p>Adrian knew it was too late, but he was happy to see them anyway. “’Hi Margie, Hi Damian. Brainfly, I’m in trouble,” Adrian said. “The Spolice are going to take me away. I broke the spider laws by releasing you. I thought you weren’t coming,” he said. “I thought you had tricked me.”</p><p>“Oh no,” said Brainfly, “I couldn’t do that. You are my friend now, unlikely as that is outside Splyderville! We brought you some tasty buds to eat.”</p><p>With that, the flies dropped a few pieces of food down onto the web beside Adrian. This just infuriated Biffer and the Spolice even more and they started charging towards him, shouting and screaming as they did.</p><p>“I might as well try it now,” said Adrian. “I think it’s going to be my last supper.”</p><p>Adrian took a nibble of the food. And another. And another.</p><p>“It’s really good,” he called up to Brainfly, “really delicious. He looked up and met Brainfly’s eye.</p><p>“I’m glad I let you go. Splyderville sounds nice. I think I would have liked it there. It’s a pity I’ll never get to see it now.”</p><p>Biffer and the Spolice agents were now only inches away from Adrian. He could see the whites of their eyes, their faces etched with a snarling anger. The Spolice had eight silk-cuffs ready to tie up each of Adrian’s legs in a moment. Their mouths were frozen into a cruel, hateful sneer.</p><p>Again, Adrian closed his eyes and waited for the worst to happen. It’s all over, he thought. Goodbye freedom.</p><p>But then, Adrian heard another loud noise above. He looked up, confused. He could not believe what he was seeing.</p><p>“It’s the abdication team, Adrian. Quick, Papa Juan Carlos will help you!”</p><p>Adrian took in the scene above his head. It must have been several hundred flies that had arrived in formation. There seemed to be a giant floating web weaved between all of their legs. And hanging down on a single swinging thread, from the centre of that web, was a colourful, jolly looking spider with a big grin on his face.</p><p>“Jump on my friend,” he called. “My name ees Juan Carlos. I teenk we are just een time to leeft you out of dees place.”</p><p>As he spoke, Adrian noticed he was spinning and lowering another thread of silk down towards him.</p><p>At this stage he could feel Biffer’s breath upon him. The Spolice were at his legs about to lock him in the silk cuffs. There was no time for thinking. He grabbed onto the dangling silk thread and wove a thread of his own around it.</p><p>“Leeft! Leeft,” cried Papa Juan Carlos to the flies above.</p><p>Adrian felt himself rise up. He could feel weights hanging off two of his legs as he gained height. He looked down. Already the ground was far below. He felt dizzy, but then a shock when he saw what was underneath him. Biffer and one of the Spolice officers were still attached to his legs by threads of silk and were climbing up towards him as they all rose higher into the air together, lifted by the fly formation.</p><p>Adrian kicked as hard as he could. This only made the spiders below more angry and climb even faster towards him. Adrian was exhausted, he felt hardly any strength left to fight. With one huge final effort, he gave one leg an almighty kick. The Spolice officer fell away with a cry and Adrian felt the weight off his leg.</p><p>He had not time to celebrate though, as Biffer still remained swaying in the wind below him and was redoubling his efforts to get up. Adrian had no energy left to fight any more. One more time, he closed his eyes as he waited for Biffer’s blows rain upon him.</p><p>By this time, Papa Juan Carlos had connected Adrian directly to the web above being carried by the flies and was now coming down himself. As he passed by, Adrian opened his eyes just in time to see Papa Juan Carlos wink at him, and then continue on down to Biffer.</p><p>Biffer wasn’t used to spiders not being afraid of him. Papa Juan Carlos wasn’t a big spider, but he was very strong and fearless. You could tell he was not to be messed with. Biffer gulped when Juan Carlos calmly climbed down to him and looked him straight in the eye. They eyeballed each other for a minute until Biffer thought better of any fight with him and let go of the thread. Adrian watched as Biffer drifted down, down, down and out of sight.</p><p>It was an amazing flight all the way to Splyderville! Adrian had never been so high before. He could see over the countryside, all the way to the mountains in the east and to the sea in the west. It looked magnificent, unlike anything he had ever seen.</p><p>“I’ve never seen the sea before,” he yelled out to Papa Juan Carlos, who at this stage had returned to the web above.</p><p>“Just hang on,” laughed Papa Juan Carlos. “We won’t be long.”</p><p>When they landed in Splyderville, the whole village was out to greet him. Everyone applauded and took him on a tour. It was amazing! Adrian was astounded by everything he saw. The spiders had made non-sticky webs for use as trampolines for the baby-flies. They seemed to really love it and bounced on it all day long. Adrian could see the spiders giving them spider-back rides too. It looked such fun to see dozens of fly-babies giggling and bouncing up and down on the back of a giant spider.</p><p>Later, Adrian was brought to the abdication arrivals centre, which was a unit inside of Splyderville University. It was run by none other than Lucy, Papa Juan Carlos’s beautiful wife who was in charge there. Adrian went a bit red, as he wasn’t used to being in the company of beautiful lady spiders.</p><p>“You are very welcome to Splyderville,” said Lucy. “We hope you will love your new home.”</p><p>“What about the food?” asked Adrian. “Who collects all the food?” Adrian’s tummy had started to rumble again.</p><p>Lucy laughed. “You abdicators, all you think about is your stomachs. So sweet. Let me tell you how it works. The flies are really good at collecting the plant buds for the spiders to eat. In fact your friend Brainfly is one of the best, so you are in luck. There are many different varieties of pant-buds, and we try new ones all the time. There’s also a cooking school you can join if you’d like to learn how to make delicious new dishes.”</p><p>Adrian was delighted to hear about all of this and spend a fascinating few hours learning all about the workings of Splyderville.</p><p>That evening, Adrian had been shown to his new home, a small tree with lovely views over countryside. He had spun up a new, non-sticky web in no time. Brainfly popped around for a visit.</p><p>“Well, how to you like your new home?” asked Brainfly.</p><p>Adrian looked out at the sun setting over the beautiful countryside below him.</p><p>“I think I’m going to like it here, Brainfly, I really am. Now, where are those plant-buds you promised me, servant?”</p><p>Brainfly responded by throwing a plant-bud at Adrian’s head. It was late into the night before they stopped playing, eating, chatting and laughing. Finally they said goodnight and Brainfly went home. As Adrian closed his eyes to sleep later, he hoped that he wouldn’t wake up to find it had all been just a dream.</p><p>And he didn’t.</p><p>And it wasn’t.</p>"}