{"title": "Nightlights", "author": "Larry A. Kayser", "level": "9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>It’s happening again. As night settles in, creatures lurk in the dark shadows. I can’t see them, but I know they’re there. I can hear them snarling, panting. They’re watching me, waiting to hurt me once I’m asleep. I cry out to scare them away.</p><p>There’s something by my side, brushing against my arm. Ow! It bit me! Now a dazzling bright light. I’m blind! I can’t see anything! Calm, familiar voices. My eyes are better, and the pain is easing. I sense my parents by my bedside. “I know, Mom. There really are no monsters. I’m sorry I disturbed you again.” “That’s okay,” she says. “We’ll always be right here when you need us.” Soothing embraces and murmured words of love. I settle back onto the comfortable pillow. I try to sleep. To forget about the monsters.</p><p>In the dimness, there is a big white house. White and pink, like peppermint candy canes. The trees are white and pink. And the street and lampposts. Wait a minute. This can’t be. I know, I must be dreaming. Dad says dreams are the mind’s way of sorting out memories. New memories and old, pleasant and sorrowful. Sounds and visions of the past that blur into one another, without any apparent logic. But why candy canes? I don’t even like them. There was a peppermint candy with my dinner. Did I eat it? I enjoy chocolate much better. Let’s see, maybe I can change that house to… Yes! It’s made of chocolate, as is the road. And the trees are now milk chocolate with M&M’s for leaves. This reminds me of that story about a man who owned a chocolate factory. Some kids won a contest and they were welcomed inside. Chocolate everywhere! Candy flowers in fields of bright green grass, like the field next to my brother’s high school. Bruce doesn’t live at home any more. He recently went far away to college, but he’s already on his way back to visit. When he was here, he was the best soccer player in town. He could kick the ball so hard it went up to the sky, as high as the airplane we took when we went to say farewell to my grandmother. Grandma looked so peaceful in her favorite dress. Dad told me I’d see Grandma again someday, but not for a very, very long time. I hope so. I miss her.</p><p>The airplane again, or maybe another one, slicing through the night. The meal was rather awful, but it did have candy for dessert. Was it peppermint? Mom and Dad are watching the in-flight movie. They won’t let me wear headphones, but I can hear some of it as I peek at the screen. It has a lot of hitting, shooting, cursing, blood. The people in the film are brutal. They are like the monsters in my room. I hate them. I’m relieved when it is finally over and the lights come on. Everything is bright again. The wicked people have disappeared. Did they ever truly exist? I doze on Mom’s shoulder. All I hear is the rumbling of the engines. And Mom’s heartbeat. Lub-dub. Lub-dub.</p><p>The people in the movie. The monsters in my room. The airplane engines. The snarling. The fighting. The pain. Mom’s heartbeat. What is reality? What is illusion?</p><p>The light. The light makes everything better. It chases the fictional evils back into my imagination, leaving behind only the truth. When there is light, the darkness, the pain, and my fears, are gone.</p><p>Grandma. Bruce. Lub-dub. The light. Dad. Mom. Lub-dub, Lub-dub, Lub-</p>"}