{"title": "The Night After Christmas", "author": "Clement Clarke Moore", "level": "3 to 5,6 to 8,9 to12,", "category": "Christmas,Classic,Funny,Illustrated,Poem,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/020.jpg'></img><p>‘Twas the night after Christmas, and all through the house</p><p>Not a creature was stirring\u0017 excepting a mouse.</p><p>The stockings were flung in haste over the chair,</p><p>For hopes of St. Nicholas were no longer there.</p><p>The children were restlessly tossing in bed,</p><p>For the pie and the candy were heavy as lead;</p><p>While mamma in her kerchief, and I in my gown,</p><p>Had just made up our minds that we would not lie down,</p><p>When out on the lawn there arose such a clatter,</p><p>I sprang from my chair to see what was the matter.</p><p>Away to the window I went with a dash,</p><p>Flung open the shutter, and threw up the sash.</p><p>The moon on the breast of the new-fallen snow,</p><p>Gave the lustre of noon-day to objects below.</p><p><span><a id=\"page17\" name=\"page17\"></a>[pg 17]</span></p><img src='https://xcx.mdavid.cn/img/022-1.jpg'></img><p>When what to my long anxious eyes should appear</p><p>But a horse and a sleigh, both old-fashioned and queer;</p><p>With a little old driver, so solemn and slow,</p><p>I knew at a glance it must be Dr Brough.</p><p>I drew in my head, and was turning around,</p><p>When upstairs came the Doctor, with scarcely a sound,</p><p>He wore a thick overcoat, made long ago,</p><p>And the beard on his chin was white with the snow.</p><p>He spoke a few words, and went straight to his work;</p><p>He felt all the pulses,\u0017then turned with a jerk,</p><img src='https://xcx.mdavid.cn/img/022-2.jpg'></img><p> </p><img src='https://xcx.mdavid.cn/img/023.jpg'></img><p>And laying his finger aside of his nose,</p><p>With a nod of his head to the chimney he goes:\u0017</p><p>“A spoonful of oil, ma’am, if you have it handy;</p><p>No nuts and no raisins, no pies and no candy.</p><p>These tender young stomachs cannot well digest</p><p>All the sweets that they get; toys and books are the best.</p><p>But I know my advice will not find many friends,</p><p>For the custom of Christmas the other way tends.</p><p>The fathers and mothers, and Santa Claus, too,</p><p>Are exceedingly blind. Well, a good-night to you!”</p><p>And I heard him exclaim, as he drove out of sight:</p><p>These feastings and candies make Doctors’ bills right!”</p><p> </p><img src='https://xcx.mdavid.cn/img/021.jpg'></img>"}