{"title": "The Old Troll and the Last Wheel of Cheese", "author": "Igor Reznitsky", "level": "6 to 8,9 to12,", "category": "Fairy Tale,Fantasy,Folk Tale,Original,Scandinavian,", "tag": "", "length": "10 - 15 mins,15 - 20 mins,", "body": "<p>In the Dark Forest, far away in the Northern Lands, where summer is short and winter is ruthless, lived an Old Troll, so old, that Time itself did not remember when he had been born.</p><p>Only the creatures of the Dark Forest knew what went on under those dense tree canopies, in those bottomless swamps, among tussocks and boulders, covered with green moss and bustling with large crimson cowberries.</p><p>From time to time, a reckless hunter went chasing after his game and suddenly found himself lost in those grim forest lands. Treasure seekers, blinded by their greed, ventured in to look for hidden troves of gold and plunder. And every so often, a naughty little child would run away from home and get lost in those dark, scary woods. But not one of them ever returned to tell the tale. And so year after year, the Dark Forest kept its secrets.</p><p>The boys and girls who lived in Skogville, a small village at the edge of the Dark Forest, knew better than to wander into the woods. But as children always do, they loved to hear scary stories and imagined what would happen if they ventured beyond the village fence on some moonless night.</p><p>As they were putting their children to bed, their parents would tell them about sneaky little gnomes who had lived in the mountains for ages, stashing away giant piles of gold and gems. They would tell them about the Bog Witch in her Drifting Hut that floated to and fro over the murky Leech Swamp, spreading a foul stench and clouds of mosquitoes along the way. And of course, they would never forget to warn their children about the Old Troll that snatched away little boys and girls who didn’t listen to their parents.</p><p style=\"text-align: center;\"> ***</p><p> Truth be told, snatching away small children was not a habit of the Old Troll. However, he did pay occasional visits to the village, sneaking in unseen and unknown. And true – he did come to steal something very precious. But children? Stinky, noisy, useless, whiny little children? Bah! The Old Troll wanted something much tastier than that. He wanted the villagers’ delicious cheese!</p><p>It had been a passion of his for many years and there was not a living creature in the Dark Forest who didn’t smile and snicker as he whispered amusing rumors about that Old Troll and his cheese. For the cranky Old Troll loved a mouthful of rich, smelly cheese more than a pig loves a puddle of dark brown mud. But alas, there was not a goat to be found in his Dark Forest, nor a single milk-cow to be seen, much less milked. So what could a poor old troll do, but pay the occasional visit to the villagers’ butteries and cellars to get himself a nice juicy bite of cheese?</p><p>There was a little cramped chamber in a small nook at the back of his Stone Cabin where he stored it. The cheese was sorted carefully by type, size and flavor – from large yellow heads of springy Jarlsberg to small caramel-brown patties of sweet baked cheese, just begging to be served up with fresh cowberry jam and blueberry tarts. Upon arriving safely home after a daring raid into the village, he would spend hours and hours in that delightfully dank chamber, making a careful account of his latest plunder and getting a proper taste of each item.</p><p>Oh, but he was well aware of how quick the peasants were to turn their pitchforks and torches on the likes of him – a thief and a troll. So much did he fear being caught that a cold shiver would run down his spine just at the thought of it. But he couldn’t help it – when the cheese called, his mouth watered and his stomach rumbled, and nothing else seemed to matter!</p><p>He did everything he could to keep his visits a secret. He wiped away his footprints with a little whisk made of dry grass from the bog. He rubbed doorsteps and floors with dry sagebrush, so its strong bitter scent would keep the dogs from sniffing him out. And he left tiny pieces of cheese behind, so everyone would think it was the mice who had eaten it. It all worked perfectly well for him. Until one day…</p><p style=\"text-align: center;\"> ***</p><p> It was a bright sunny morning in the first days of summer and all the villagers had gone to work in the fields. The Old Troll snuck into the village, just as he had done many times before. He walked out of the forest, quickly hobbling on his old crooked legs, leaning on a staff carved out of a weeping willow. On his left side he carried a worn out over-the-shoulder bag, dirt-brown, all covered with stitches and patches. It was his very special Cheese Bag – he could fit three big wheels of cheese in it. This time he needed even more – it was his turn to host the Midsummer Night party for his friends and family this year and he was hoping to get his supplies replenished today, so he wouldn’t have to come again before the holiday. There would be so many other chores and preparations to deal with then!</p><p>Cheese was always a special delicacy at the Troll’s house. His giant cousins would descend from the mountains and his little nephews, the bridge trolls, would all gather from distant parts of the Northern Lands to get a taste of their uncle’s special treat. And the Bog Witch… Oh, that Bog Witch! The last thing he wanted on that day was to have her at his table. Scrawny and grouchy, she had nagged him and picked on him for hundreds of years, but she also made the best leech soup in the whole Forest, so he really needed to make sure he was on her guest list every Thursday, even if it meant suffering her unbearable chatter on an otherwise lovely holiday. He thought about it over and over again and finally he clenched his teeth and sent her a formal invitation, strapped to the tail of a bog rat, as forest etiquette required.</p><p>“I’ll get a big chunk of Gouda just for her,” the Troll thought to himself. “That ought to keep her mouth busy!”</p><p>He climbed over the village fence and headed toward one of the houses that he knew had the best cheese in the village. Drooling and slurping in anticipation, the Old Troll crossed an empty yard and approached a small door at the back of the house. It was the door to the cellar, where the owners kept their wine, cheese and sausages during the summertime. The Old Troll let himself in and looked around.</p><p>He sniffed at the stale air. Some old spices. Last year’s potatoes. Dried mushrooms and long braids of garlic hanging from the ceiling. But… No cheese! The shelves were all empty! He couldn’t believe his eyes.</p><p>Confused, he moved on to the next house. To his deep dismay, there was no cheese in the next house either. He went on to another house. The same!</p><p>The Old Troll was growing desperate. Casting aside caution, he ran from one house to the next, breaking into butteries and storerooms… just to find empty pantries and dusty shelves. He felt as if he were going mad!</p><p>Finally, he found himself in a small cellar he had never visited before. It belonged to a small house on the far side of the village, amongst a row of humble cottages where he usually didn’t bother to plunder.</p><p>It was cold and gloomy inside. The cellar was filled with empty barrels and some old rags were hanging here and there on the walls. With very little hope, the Troll sniffed around and… yes, there was definitely some cheese in this room! He darted straight to a tall cabinet in the corner – his big crooked nose led him right to it with great confidence. The smell was so fresh and strong, he could almost taste it, but when he opened the cabinet doors, he stopped and sighed in disappointment. There was only one small wheel of cheese, humbly nestled deep inside. He reached out for it, upset and angry, when a sudden squeak came from the hinge of the door behind him.</p><p>The Old Troll’s heart skipped a beat and his bony fingers froze in the air. He turned his head, squinting over his shoulder. A little boy, no more than five years old, was standing in the lit doorway, looking at him, eyes wide open. The Troll tried to swallow but his throat suddenly went dry – if the boy screamed for help, it would be the end of the Old Troll.</p><p>The little boy, however, did not look like he was going to scream. His big blue eyes studied the Old Troll with surprise and curiosity.</p><p>The Old Troll realized that the boy must have never seen a troll before. He would had heard the villagers’ stories which all described trolls as ugly monstrous creatures. And while some other trolls did actually have a terrifying appearance, the Old Troll knew that he looked rather like a tall, slouchy man, dressed in a shapeless tunic over a shabby old shirt. He had other features that might have given away his true nature – grayish lizard skin, droopy yellow eyes, sharp black finger nails – but fortunately for him, the lighting in the room was too poor to see all that clearly.</p><p>“Who are you?” asked the little boy, holding the door ajar to let some sunlight into the room.</p><p>The Old Troll looked around in panic, but there was no way out. As so often happens in desperate moments, a brilliant idea suddenly came to him – he grabbed a worn-out bonnet from the wall and put it on his head.</p><p>“Don’t you recognize me, my dear?” he said in a thin voice, pulling the bonnet strings down to hide his straggly gray hair and his big ears that stuck out like a pair of tree mushrooms. “Oh, you were very little when I last saw you.” He squeaked and shrilled, trying to sound like an old woman. ”I’m your Aunt Malin!”</p><p>The boy looked puzzled. “Aunt Malin?”</p><p>“A grandaunt, my dear.”</p><p>“I’m sorry I didn’t recognize you,” the little boy said with hesitation, “but what are you doing here in the cellar? Why didn’t you come into the house?”</p><p>The Troll could hardly hold back a smirk when he saw his little ploy working.</p><p>“Your parents asked me to fetch this cheese and bring it out to the field. They want it for lunch.”</p><p>“Really?” replied the little boy. “Are you sure? Mom said it was the last one, so we were going to save it.”</p><p>“The last one? How so?” squeaked the Old Troll, screwing up his eyes suspiciously.</p><p>“We had to give Lara to the Landlord. Our cow. And the same with Anton and Annie’s parents too. Peter’s dad could only keep one sheep from a whole dozen they had.”</p><p>“Why?” asked the Old Troll, putting the cheese in his bag.</p><p>“So we can keep our fields for the rest of the summer. Father says we’ll get her back as soon as we sell the crops in the fall.” The boy grimaced. “Stupid fat Landlord! I’d just finished painting a plaque for her stall, right before they took her away!”</p><p>He kicked at the doorstep and sniffed. “Dad says just one silver coin would do.” He paused and then looked back at the Troll with his big eyes glistening.</p><p>Suddenly, the Old Troll noticed an unusual feeling in his stiffened old heart. He had no idea what it was, but it made him uncomfortable and he didn’t like it one bit.</p><p>“If I had a silver, my dear, I would certainly help you out,” he mumbled. “But I don’t!”</p><p>He was telling the truth. He didn’t have any silver – trolls preferred pure gold. Unlike hard silver, the soft golden coins could sponge up a troll’s magic spells. They had used gold in all sorts of deceit and trickery for thousands of years and even now, the Old Troll had a heavy dark-yellow Krona in a little purse that hung from his belt. Just in case.</p><p>The Troll closed up his bag and started to head out, but the boy was still standing in his way. Now that he got a better look at his unexpected guest, his tears dried and a hint of suspicion flashed in his eyes. “Are you sure about this… Aunt Malin? Mom told me we were saving that cheese for a special occasion.”</p><p>A chill went down the Old Troll’s spine, but he gathered up the nerve to answer in his impudent trollish manner: “Well, wouldn’t you call this a special occasion? It’s not every day you have a guest like me!” He smiled, baring his crooked teeth.</p><p>His grin was so hideous, the poor boy flinched and the Old Troll used this moment to slip past him through the doorway.</p><p>He hobbled across the yard as fast as his old legs would carry him, anxious to get out of the open space, when he suddenly heard the boy shout, “No! Down boy, down!” Before he knew what was happening, he heard a short snarl and something heavy grabbed onto his bag.</p><p>His eyes went wide with terror! He jumped two feet into the air, trying to swing his staff at the dog and save his bag at the same time, but the vicious animal wouldn’t let go. The Old Troll fought for his precious plunder like a mountain lion, kicking and jumping and cursing, and he finally made it to the tall palisade that surrounded the backyard of the house. He couldn’t remember how he managed to climb over it and land safely on the other side, but he did, leaving the dog behind him, barking and growling.</p><p>The boy’s concerned face appeared in a crack between the stakes.</p><p>“Aunt Malin, are you all right?”</p><p>Without saying a word, the troll pushed himself to his feet and rushed toward the safety of the forest before anyone else could see him.</p><p>Long, long after the village was out of sight, the Old Troll finally stopped to examine the damage. The Cheese Bag was ripped and torn on one side, but luckily, its contents were unharmed. “A couple new patches, and it will be good as new.” He stroked the bag fondly, as if it were his favorite pet. Save for some dirt marks, all his clothes were undamaged. The Old Troll chuckled in relief, but when he put his hand on his belt, the crooked grin vanished from his face. His purse was gone!</p><p>As the sun went down and the villagers came in from the fields, the Old Troll watched anxiously, hiding in the bushes outside the village fence. It had taken him too long to return for the coin and now it was too late.</p><p>He saw the little boy run out to meet his parents and older brothers who were just returning from the field. As the boy told his story, the Old Troll saw his mother drop her basket and raise her hands to her face. He saw the men clutch their hoes and spades, looking around nervously. Then the boy held up his hand and showed them something small lying in his palm. The Old Troll knew right away that it was his gold. He ground his teeth in helpless rage and just at that moment he noticed that the bonnet was still on his head. He yanked it off with a growl and stomped on it, waving his arms and cursing fiercely in ancient Trollish.</p><p>“A full-weight golden Krona for a little cheese!” the Old Troll said, once he had finally calmed down, “What a lousy deal! But you should know, my dear villagers, that in the end, the trolls’ gold always serves the trolls.”</p><p>He pointed his staff toward the golden coin and whispered:</p><p style=\"text-align: center;\"> Dimly-dumly-bumly-toots,</p><p style=\"text-align: center;\">Winds and shadows, moss and roots!</p><p style=\"text-align: center;\">Golden coin spin and roll,</p><p style=\"text-align: center;\">Bring the cattle back to stall!</p><p> The staff quivered as the magic ran through it and he knew that his spell was soaking into the coin like hot milk into a fresh piece of bread.</p><p style=\"text-align: center;\"> Bumbly-fumbly-numbly-doons,</p><p style=\"text-align: center;\">Pots and ladles, jars and spoons!</p><p style=\"text-align: center;\">Salt and sugar, milk and brine,</p><p style=\"text-align: center;\">I will come to take what’s mine!</p><p> The Old Troll lowered his staff. The sun was setting now, and lights were beginning to appear in dark windows all around the village. It was time to leave.</p><p>“Just make sure those shelves are full by the Midsummer Night,” he murmured, heading back home, “I’ll be needing my cheese then!” He looked at the lights one last time and stepped into the thicket.</p><p style=\"text-align: center;\"> ***</p><p> When the time had come, the Midsummer celebrations were unfolding far and wide across the Northern Lands. The people in their villages and the magic creatures in their forests ate and drank and danced to the sound of pipes and violins all night long.</p><p>The small village of Skogville saw an unusual turn of events this year, as the celebrations were hosted in the poorest part of the village, which had never happened before. Long tables sported dozens of types of cheese and the cows mooed happily in their stalls.</p><p>And not too far from the village, there was another holiday table, a much smaller one, hidden in the midst of the most secret, most mysterious part of the Dark Forest. Among the jars of bog grog and trays filled with hot-smoked leeches, five giant wheels of cheese towered on their plates. That is to say that they were giant only at first, but thanks to the enthusiasm of honored guests, they got smaller and smaller by the second, until there was nothing left but tiny crumbles.</p><p>Despite the Old Troll’s best efforts, the Bog Witch still kept complaining throughout the entire feast, but the cheese was so good, that no one would listen to her mumbling.</p>"}