{"title": "The Pea Blossom", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/p021i.png'></img><p>There were once five peas in one pod. They were green, and the pod was green, and so they believed that the whole world must be green also, which is understandable.</p><p>The pod and the peas grew and as they grew they arranged themselves all in a row. The sun shone and the rain fell and the peas, as they sat there, grew bigger and bigger and started to think about what they were going to do with themselves.</p><p>“Are we to sit here forever?” asked one. “Will we not turn hard, sitting here this long? It seems to me there must be something outside, I am sure of it.”</p><p>Weeks passed by, the peas became yellow and the pod became yellow.</p><p>“All the world is turning yellow, I suppose,” they said.</p><p>Suddenly they felt a pull at the pod. It was torn off and held in human hands; then it was slipped into the pocket of a jacket, together with other full pods.</p><p>“Now we shall soon be let out,” said one, and that was just what they all wanted.</p><p>“I’d like to know which of us will travel the farthest,” said the smallest of the five, “and we shall soon see.”</p><p>“What happens, happen,” said the largest pea.</p><p>“Crack!” went the shell, and the five peas rolled out into the bright sunshine. There they lay in a child’s hand. A little boy was holding them tightly. He said they were fine peas for his pea-shooter, and immediately he put one in and shot it out.</p><p>“Now I am flying out into the wide world,” said the pea. “Catch me if you can.” And he was gone in a moment.</p><p>“I intend to fly straight to the sun,” said the second. And away he went.</p><p>“We will go to sleep wherever we find ourselves,” said the next two. And they fell to the floor and rolled about, but they still ended up in the pea-shooter. “We will go farthest of any,” they said. “Then we can take it easy and live the easy life.”</p><p>“What happens, happens,” exclaimed the last one, as he was shot out of the pea-shooter. Up he flew against an old board under an attic window and fell into a little crack which was almost filled with moss and soft earth. The moss closed itself about him, and there he lay, trapped.</p><p>“What happens, happens,” he said to himself.</p><p>Within the little attic lived a poor woman, who went out to clean stoves, chop wood into small pieces, and do other hard work, for she was both strong and hard-working. Yet she remained always poor, and at home in the attic lay her only daughter, not quite grown up and very delicate and weak. For a whole year she had been ill in bed, and it wasn’t clear if she would ever get better.</p><p>All day long the sick girl lay quietly and patiently, while her mother went out to earn money.</p><p>Spring came, and early one morning the sun shone through the little window and threw his rays over the floor of the room. Just as the mother was going to her work, the sick girl fixed her gaze at the bottom of the window. “Mother,” she asked, “what can that little green thing be that peeps in at the window? It is moving in the wind.”</p><p>The mother stepped to the window and half opened it. “Oh!” she said, “there is actually a little pea that has taken root and is putting out its green leaves. How could it have got into this crack? Well, now, here is a little garden for you to amuse yourself with.” So the bed of the sick girl was drawn nearer to the window, that she might see the budding plant and the mother went out to her work.</p><p>“Mother, I believe I will get well,” said the sick child in the evening. “The sun has shone in here so bright and warm to-day, and the little pea is growing so fast, that I feel better, too, and think I shall get up and go out into the warm sunshine again.”</p><p>“I really hope that!” said the mother, but she did not believe it yet. She took a little stick and propped up the green plant which had given her daughter such pleasure, so that it might not be broken by the winds. She tied the piece of string to the window-sill and to the window frame, so that the pea plant might have something to curl around. And the plant shot up so fast that you could almost see it growing every day.</p><p>“A flower is really coming,” said the mother one morning. At last she was beginning to let herself hope that her little sick daughter might indeed recover. She remembered that for some time the child had spoken more cheerfully, and that during the last few days she had raised herself in bed in the morning to look with sparkling eyes at her little garden which contained only a single pea plant.</p><p>A week later the sick girl sat up by the open window a whole hour, feeling quite happy in the warm sunshine, while outside the little plant grew, and on it a pink pea blossom in full bloom. The little lady bent down and gently kissed the delicate leaves.</p><p>“I think that pea has come down from heaven itself to bring joy to you and hope to me, my darling child,” said the happy mother, and she smiled at the flower.</p><img src='https://xcx.mdavid.cn/img/p027i.png'></img><p>But what became of the other peas? Why, the one who flew out into the wide world and said, “Catch me if you can,” fell into a gutter on the roof of a house and ended his travels eaten by a pigeon. The two lazy ones were carried quite as far and were of some use, for they also were eaten by pigeons, but the fourth, who wanted to reach the sun, fell into a sink and lay there in the water for days and weeks, till he had swelled to a great size.</p><p>“I am getting beautifully fat,” said the pea; “I expect I shall burst at last; no pea could do more than that, I think. I am the most remarkable of all the five that were in the shell.” And the sink agreed with the pea.</p><p>But the young girl, with sparkling eyes and the rosy colour of health upon her cheeks, stood at the open attic window and, folding her thin hands over the pea blossom, was divinely thankful for that little pea and what it had done for her.</p>"}