{"title": "Penguin and the Fig Tree", "author": "Dulce Rodrigues", "level": "6 to 8,9 to12,", "category": "Funny,Modern,Original,True,", "tag": "Dog,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Penguin-and-the-fig-tree-749x1024.jpg'></img><p>When I was still young, I would spend my summer holidays at my Uncle Ernesto’s home. He lived, at that time, by the well-known and touristy beach of Figueira da Foz, in the North of Portugal, in a lovely house at the end of a cul-de-sac that ended at the entrance to a pine forest.</p><p>My uncle had a dog, Penguin, and this is a story about him.</p><p>He was a magnificent dog, an Irish setter, very friendly and well behaved, although he had a weakness! A sweet tooth! He loved… Well, you’ll learn about it when reading further!</p><p>But, right after my uncle discovered this quirk in his dog, it was necessary to solve another mystery! Let’s learn about the first mystery, though – the mystery of the disappearing figs…</p><p>Uncle Ernesto liked fruit very much, and figs most of all. He had therefore planted a fig tree right in front of his bedroom window.</p><p>The fig tree had grown enormous and, by looking out of his window, he could tell when the figs were ripe and ready to eat.</p><p>So, one day, he was very happy when he saw the first ripe figs. He told himself, “tomorrow I will pick them”.</p><p>To his great surprise, the figs he had seen in the tree the day before were no longer there the following day. He thought that perhaps my aunt had picked and eaten them, and he thought about it no more.</p><p>A few days later, he noticed that there were lovely, ripe figs on the tree again, and promised himself he would pick them the very next day.</p><p>Sure enough when the next day came the figs had disappeared!</p><p>Frustrated but determined, Uncle Ernesto said nothing about it to my aunt – who he though responsible for the fact – but vowed to not let any more be taken!</p><p>And when one lovely morning he saw some newly ripened figs hanging from the tree, he rushed straight to the garden to pick them.</p><p>It was then that Uncle Ernesto found out who had been helping himself to his figs all this time!</p><p>Upright, with his front paws scratching and pushing at the fig tree – the way bears do when they want fruit to fall from the trees – was his precious Penguin!</p><p>The rascal had already eaten two or three figs! Ripe fruit falls easily from trees, especially when they are shaken, as you know.</p><p>From that day onward, Uncle Ernesto decided that Penguin should remain tied up during fig season. This solution would also have the advantage of putting an end to the mysterious and repeated disappearances of his dear, four-footed friend.</p><p>In fact, since the beginning of the gorgeous days of summer, Penguin had disappeared every morning and wouldn’t return until it was almost lunchtime. His escapades very much intrigued my uncle but he was already resigned to them. And he made his best too not to worry about them any more.</p><p>He then took advantage of the incident with the figs to put Penguin on a leash, unfortunately a very weak one, and he went to work.</p><p>When he returned for lunch that day, he saw that the leash had been broken and of Penguin… no sign!</p><p>Uncle Ernesto decided a stronger leash was needed. But since he really didn’t want to give his dog a very bad feeling about being somehow “imprisoned”, the second leash he bought was still not strong enough…</p><p>And the next morning, that rascal Penguin had run away once again!</p><p>The mystery of these escapades was only resolved when my grandmother and I arrived to spend some well deserved holidays at Uncle Ernesto’s house, after a long ride from Lisbon.</p><p>As I’ve said before, I would spend the long holidays at my uncle’s house because he lived, at that time, in Figueira da Foz, in a lovely house near the seashore.</p><p>The morning after our arrival, grandmother and I went to the beach, which as know, was not far from the house. Suddenly, I saw an Irish setter surrounded by a multitude of children. It was pulling some sort of cart with two or three kids aboard!</p><p>I couldn’t believe my eyes! I asked grandmother to take a look also. It was true! The dog was Penguin!</p><p>I went up to the children and asked them how they knew Penguin. They told me about how the dog had appeared one day, they did not know where from, and how he would return every morning. The kids did not know his name, but they adored him.</p><p>When my uncle was told of the maternal aspect of his dear, four-legged friend, he showed himself to be very happy with, and very proud of his dog, and quickly forgot about the small thefts of the figs. Penguin had his forgiveness and his understanding.</p><p>He also had his permission to go and play with the children on the beach. Penguin would never be put on a leash again!</p><p>Anyway, as soon as the summer had ended and the children had gone away, Penguin no longer ran away, staying instead in the garden and being very sensible… until the next summer!</p><p>And so, there it is! No sooner did holidays arrive, and with them the return of the children to the beach, then the escapades of dear Penguin would start again!</p><p>And since Penguin could not talk, he was unable to tell us how this adventure had started. This secret he kept to himself!</p>"}