{"title": "Peter’s Pyjamas", "author": "Karl Doyle", "level": "6 to 8,", "category": "Modern,Original,", "tag": "", "length": "15 - 20 mins,", "body": "<p>Peter woke up earlier than usual. The sun was shining into his room through a gap in the curtains. This was was what woke him up, plus the fact that today was his birthday so he was really  excited.  Last night when he went to bed he was only 7 but today when he woke up he was fully 8 years old. Peter lived with his Mum and Dad, his big brother Brian who was 11, and his baby sister Pamela. His Granny also lived with them in the same house. She was a young Granny, old, but not too old. She could still walk and run, make her own breakfast and go the shops. Her name was Mella. They also had a white cat called Binky. Binky was really their Granny’s cat but they all just thought of Binky as the family cat. She swished the end of her tail all the time. Peter always wondered why and used to try to grab it. Binky didn’t like it when he did this and usually ran off and hid under Granny’s armchair when he did.</p><p>Peter jumped out of bed and ran downstairs in in his pyjamas. Nobody else was up yet. No school today, great. It was Saturday but tomorrow would be even better as his mum had arranged a birthday party for him at their house. He had invited all his friends from school and some from his road as well. It was going to be a great party. His Granny had a friend who was a magician who was coming along to perform at the party and Peter was looking forward to all the cool presents he was going to get too.</p><p>The next day came and Peter could hardly wait for 3 o’clock to come when his party was going to start. Eventually it did come and the doorbell started to ring. One by one his friends arrived with either their mum or their dad and each holding a present in their hand for Peter as they came in. His mum had bought lots of treats, crisps, pizza and fizzy drinks for the party. They played games which their Dad had organised, played pass the parcel and then the magician came. He was really good. Peter had seen magicians before and their tricks weren’t that good but this one did some tricks that looked like real magic. Everyone filled up on pizza and treats and he got lots of great presents from his friends which he loved but he was given a strange pair of pyjamas as a present by his Granny. When he opened the present first he didn’t really like them. They were kind of old fashioned pyjamas which were light green and had small pictures of racing cars, motorbikes and aeroplanes all over them. Not like all the other pyjamas that Peter had.</p><p>That evening after the party was over Peter was really tired. Before going to bed he asked his mum for a glass of milk. He drank half of it and then fell asleep on the couch before he could manage to get up the stairs to his room. After a few minutes his mum woke him up and had to carry him up stairs to bed. He took out the new pyjamas that his Granny had given him and looked at them again. When he tried them on, he changed his mind immediately about the new pyjamas because they were really cosy and fluffy inside. Even more so than other new pyjamas. Almost tingly. Peter got into bed. It was a cold night so when his Mum kissed him good night, he snuggled up tight and quickly went fast asleep.</p><p>Peter had a lots of dreams about his birthday party that night but then in the middle of the night a very strange thing happened. Peter sat up in bed and put his feet out of bed onto the floor, then stood up. Peter did not know anything about what he was doing because even though he had got up and got out of bed, he was still sound asleep. He slowly started to walk around the room but still didn’t wake up. It was like he was sleepwalking, but he wasn’t moving his legs himself. It was as if the pyjamas were making his legs do the walking. He walked over to the door and his arm lifted up, his hand grabbed the door handle and opened the door. The pyjamas were doing the movement of his arms and hands as well and he walked out the door and down the hallway to Brian’s room.</p><p>He walked into the room and over to Brian’s bed. Brian was lying there fast asleep. He went to the end of the bed and put his hand under the duvet and tickled Brian’s foot. Brian jumped a bit in the bed but did not wake up. There was a chest of drawers underneath the window where their Mum put all of Brian’s clothes. Peter went over and pulled out one of the drawers. He began to pull things out of the drawer and throw them all over the room, but he still did not wake up. He did the same to the next drawer and then the third drawer until all of the drawers were empty and Brian’s clothes were scattered all over the room. Peter then went back to his own room and went back to bed.</p><p>The next morning Peter woke up to the sound of his Mother’s voice. She had gone to wake Brian up for school but let out a loud shriek when she opened his door and saw the state of his room.</p><p>“Brian, what have you been doing?” she shouted.</p><p>Brian woke up startled and looked around the room. He saw all the clothes thrown around everywhere and their Mother was standing in the doorway scolding him for having his room in such a mess.</p><p>“But Mum,” said Brian “I didn’t make this mess, I don’t know how it happened. They certainly weren’t there last night when I went to bed.” There was even a pair of underpants hanging off the lampshade.</p><p>“Maybe it was Peter who did it,” said Brian.</p><p>“Nonsense” said their mother, “Peter went to bed long before you last night, how could he have done it?”</p><p>Peter didn’t know that it was actually him who made the mess in Brian’s room so he thought this was all rather funny and that Brian must have done it when he was having one of his tantrums.</p><p>“Please start putting your clothes back into the drawers Brian” said their Mum, “and hurry up or you will be late for school.”</p><p>Brian was not happy about having to put all of his clothes back himself because he knew he wasn’t the one who had taken them out and scattered them around in the first place. He knew the only other person who could have done it was Peter, but he also knew Peter would never get up in the middle of the night to do it, he couldn’t figure it out at all.</p><p>It took ages to put all the clothes back again, then he had to get dressed and wolf down his breakfast really quickly to catch the school bus.</p><p>“Come on, hurry up” said the driver.</p><p>Peter was already on the bus as it waited outside their house. He watched Brian come running out the front door and jump onto the bus as it was just about to drive off. He almost got squeezed between the doors as they were closing. That was close one, thought Peter.</p><p>That afternoon when Peter got home from school, he had his dinner and quickly finished off his homework, Later  that evening when he was going to bed he couldn’t wait to put on the new pyjamas again so at bedtime he ran upstairs, pulled off his clothes and put the pyjamas on as quick as a flash. He got into bed, snuggled up in his duvet and kissed his Mum good night. Pretty soon he fell fast asleep just as he usually did.</p><p>That night much later on, when it was deep in the middle of the night, the same thing happened again. Peter sat up in bed and put his feet out onto the floor. He stood up and got out of bed, but again he did not wake up. The pyjamas were moving all of his body parts just like before and he walked out the door. This time he walked across the hall to his parents room. The door was slightly open, He pushed the door, slowly walked in and went to the end of the bed on his Dad’s side. He put his hand under the covers and tickled Dad’s foot. His Dad grunted and mumbled something but fell back asleep again. Of course Peter did not realise that he was doing any of this because he stayed fast asleep the whole time. It was the pyjamas again that were making him do all of this. He went over to the chair where his Dad had left all his clothes the night before. He put his hand inside one of the trouser pockets and had a feel about. These pyjamas were making him do very strange and mischievous things indeed.</p><p>Inside the pocket were a bunch of keys and some money. Peter took the keys which were the keys of his Dad’s car. He went downstairs and out the front door into the driveway where their car was parked. He pressed the button on the key ring which opened the car doors and got into the drivers seat. Peter was only 8 years old and had never driven a car before. He didn’t even know how to drive but strangely the pyjamas were making him do all the things which you need to do to drive a car.</p><p>He put the key into the ignition and started the engine. He backed the car out of the driveway and drove off down the road towards town. The noise of the car engine starting woke his Dad up. His Dad leapt out of bed just in time to see the car going out the gate and speeding away. He had no idea that it was Peter who was in the car or that it was the pyjamas that were making him drive the car. He shouted at Peter’s Mum to wake her and tell her what was going on.</p><p>Both his parents ran downstairs in their dressing gowns and out onto the road but the car had driven off around the bend.</p><p>“I’m calling the Police,” said his Dad as they raced back in to the house, and were met by Brian and Pamela running down the stairs. Their dad’s shouts had woken them up.</p><p>“Where’s Peter?” asked their dad, but when they went back upstairs to look for him, he was nowhere to be found.</p><p>Peter’s Dad picked up the phone and immediately called the police to tell them that their car had been stolen and that their little boy Peter was also missing from the house. The policeman on the phone said that they would send somebody around to the house immediately to investigate, and that they would send out a police car to look for Peter and the stolen car.</p><p>A little while later there was a loud knock on the door. It was a tall policeman with a peaked cap and red hair. Their Granny Mella and Binky were now up out of bed, also woken up by all the commotion in the house. The policeman asked some questions like what type of car it was and what Peter looked like and what age he was so that they could try to find Peter and the stolen car. The policeman radioed the station back to give them the information about Peter and the car.</p><p>“So be on the lookout for an 8 year old boy with dark brown hair, wearing green pyjamas, and the car is a Blue Ford Focus, ’07 reg. , over,” said the policeman.</p><p>“What a nice man,” said their Granny, listening to the policeman as he spoke into his radio.</p><p>Soon afterwards when the policeman had finished asking all the questions he left and said goodnight to them. He told Peter’s parents that he would phone them back when he had found out anything about the missing boy or the stolen car. Peter’s Mum put on some soup and made some toast for everybody, as it was a cold night out. She lit the fire and they all stayed up and sat in the living room eating their soup and toast and waiting for the police to phone back.</p><p>A few hours passed by. Their Granny Mella had nodded off to sleep in her armchair after finishing her soup. Binky still sat on her lap swishing her tail as usual. Pamela and Brian eventually nodded off as well but their parents stayed awake waiting for any news of Peter or their car. A few minutes after the clock struck 4am, the phone rang. Pamela and Brian woke up suddenly and their Dad picked up the phone. It was the nice policeman with the red hair phoning back with some news about Peter and the stolen car. Everyone was quiet in the room. The only one who spoke was their Dad who was saying “yes” over and over again while listening carefully to the policeman on the other end of the phone. After what seemed like ages he said “thank you” and put the phone down.</p><p>“Right” said their Dad. “Peter and our car have been found, the police are on their way  over here again to bring me down to the station. Peter and the car are there.”</p><p>“Is he alright?” asked everybody all together at once.</p><p>“Yes he fine but he was very lucky,” replied their Dad. “The policeman said he was a bit cold in only his pyjamas and he has had a bit of an accident and doesn’t remember much.”</p><p>“What happened?” asked their mother who was shaking when she heard the news.</p><p>“The police found our car with Peter in it on the bypass just outside of town. They said the car had been driven off the road and into the ditch just before the roundabout. The strangest thing is that when they found the car they discovered Peter in the driving seat.”</p><p>“What?” everyone gasped, and at the same time the doorbell rang once more. It was the police again but a different policeman this time, one who wasn’t in uniform.</p><p>“Bring some clothes in a bag for him to change into,” said their Mum, “it’s freezing out, and bring his coat too.”</p><p>“OK, I’ll phone back with any news,” said their dad as he left with the Policeman.</p><p>“That’s the strangest thing I have ever heard,” said their Granny as she stood up. “Thank goodness Peter is safe anyway, I’m going back to bed” she said. “Come on Binky”.</p><p>Peter’s Dad ran inside as soon as the police car pulled up outside the the station.</p><p>“Where is he?” he asked as he nearly tripped over a large Alsatian dog who was lying near the doorway.</p><p>“WOOF!”</p><p>“Careful,” said the policeman on duty. It was the one with the red hair this time standing behind the desk.</p><p>“Dad,” shouted Peter when he saw his Dad bursting in through the door still in his dressing gown and slippers.</p><p>Peter jumped up from where he was sitting and threw his arms around his Dad.</p><p>“I’m really sorry, I don’t know what happened.  All I remember is waking up in our car and it was moving, and I was driving it, and next thing it turned off the road and into the ditch and stopped with a bump beside a tree, and… and… “</p><p>“That’s OK Peter,” said his Dad. “The main thing is that you are safe and you’re not hurt. I was so worried about you , we were all worried sick”.</p><p>“I don’t know how I got into the car, or how I started it or how it was moving,” said Peter.”</p><p>“Hmmm…,” said his Dad in a puzzled tone.” “Then when it stopped, I just sat there for ages it seemed until the Police car came along and found me,”  said Peter. “Dad was I driving the car? I don’t know how to drive… do I?”</p><p>“I’m not sure,” said his Dad.</p><p>“Its funny,” said Peter. “It was weird but I wasn’t really scared at all, and I wasn’t cold either. Just when I woke up for a second, but then when the car stopped I was OK again. Then I just sat and waited, then the police  arrived.”</p><p>“I know,” said his Dad. “Come on, I’ve brought some clothes over for you, and your coat. Let’s get you dressed.”</p><p>They went into the waiting room, a room with some brown armchairs and a coffee table. There was a TV on the wall with the News on but the sound was turned down. Peter changed out of his pyjamas and gave them to his Dad.</p><p>“Wait a second,” said his dad, “those pyjamas look familiar.”</p><p>Peter said nothing. He carried on getting dressed, just thinking his Dad meant that he’d seen the same pyjamas on Peter earlier on.</p><p>“Oh never mind,” he said, and he put the pyjamas into the bag that the clothes had been in and handed it back to Peter.</p><p>“You finish getting dressed, I’m going to have a look at the car.”</p><p>“It’s fine Dad.“</p><p>“What”?</p><p>The car, its fine” said Peter. “The police drove it back over here and I heard the red haired guy saying it seems fine.”</p><p>Peter’s Dad went out to speak to the Policeman on duty at the desk.</p><p>“The car seems fine,” said the policeman, “I gave it a quick check over before I drove it back here. Your boy was very lucky. Does he have a driving license then?” – half joking, half serious.</p><p>“No,” said Peter’s Dad, “obviously not, he’s only 8. He says he doesn’t remember anything until the car went off the road, then he woke up he says.”</p><p>“Must have been sleep walking,” said the policeman.</p><p>“Yes, and sleep driving obviously,” said Peter’s Dad. The policeman gave a little snigger.</p><p>“Well if he’s OK, and the car is OK then there’s no harm done,” he said, “we’ll say no more about it.”</p><p>“Thank you very much,” said Peter’s Dad to the policeman. “Thank you for all your help and for looking after Peter”.</p><p>“Oh don’t mention,” it replied the policeman.</p><p>“Pee – terrr”… shouted his Dad from the hallway, “let’s go.”</p><p>Peter picked up the bag with the pyjamas in it and ran out to the hallway.</p><p>“Here are your keys,” said the policeman. “Thanks again,” replied Peter’s dad.</p><p>“Thank you,” said Peter to the red haired policeman as they were leaving.</p><p>“You mind yourself young man,” he said back. “I will,” said Peter</p><p>“And no more sleepwalking or driving cars in your sleep either.”</p><p>Peter smiled. “I didn’t even know that I knew how to drive,” Peter replied in a confused sort of way. The policeman smiled then went back to working on his computer. His Dad phoned their house to let everyone know that Peter was safe and well and that they were on their way home.</p><p>”Everything is OK,” Peter heard him say,  “don’t wait up for us, Bye.”</p><p>As Peter and his Dad drove home it was starting to get bright.  It was just daybreak and the brightest stars were still out.  It was a while before either one said anything. Dad was the first one to speak.</p><p>“That was all very strange,” he said. “I’m very puzzled by everything that happened, and how you managed to do all those things without really knowing how.”</p><p>“I know,” said Peter, “I’m pretty puzzled myself. Honest Dad, I didn’t know what I was doing and I can’t remember anything about it up until the car stopped with a bump, like I’ve told you.”</p><p>After a while his Dad said “well we’re nearly home now,  I think you should go back to bed for a while to see if you can get some sleep. You’ve had a very busy night for an 8 year old.”</p><p>The car came to a stop outside their house. Peter reached into the back seat to get the bag with the pyjamas. They went inside, the house was quiet, everyone had gone back to bed. A very tired Peter climbed the stairs up to his room and let himself fall back on his bed. Within what must have been only a few seconds he had fallen fast asleep – but with all of his clothes on this time.</p><p>The next morning at breakfast Peter had quite a story to tell the rest of his family. He told them everything about how he woke up in the car not knowing how to drive and how his Dad was so worried about him. When he had finished telling his story, his Granny asked him how he liked the new pyjamas that she had given him.</p><p>“They’re really nice Granny, really nice and cosy.”</p><p>“Oh good” she said. “However, I know someone who didn’t like them very much at all,” she said, while giving a glaring look towards their father, who took no notice at the time.</p><p>She then told the surprising story of how that magician friend had given the pyjamas to Peter’s father as an 8 year old boy but he didn’t like them. In fact he hated them so much that he never wore them.</p><p>“Because they were still new I kept them,” she said, “and waited till they fitted you Peter”.</p><p>There was silence in the room for a few moments. Lots of things were going through Peter’s head just then. He had this feeling that there was some sort of connection between him doing all the strange things last night and the even stranger pyjamas.</p><p>Peter paused for a minute and then he said “I think I’ll wear different pyjamas tonight mum, if that,s OK?”</p><p>“I think that’s a very good idea,” his Dad said loudly, before his mum could reply…</p>"}