{"title": "Pig Trouble for Little China", "author": "Daniel Henshaw", "level": "6 to 8,9 to12,", "category": "Funny,Modern,Original,", "tag": "Pig,", "length": "01 - 05 mins,", "body": "<p>On the Eastern side of Frearson’s farm, close to the huge oak tree, there lived an adorable young piglet named China.  As a tiny piglet, China was a joyful little animal, who spent many hours happily playing with a broken acorn that she’d found in her sty.  After a while though, China realised that she was very different to the other pigs in her pen.</p><p> </p><img src='https://xcx.mdavid.cn/img/China.jpg-1024x786.jpg'></img><p>Firstly, the other pigs would eat absolutely anything that Farmer Frearson gave them.  Not China.  China was very fussy about what she ate, which meant that she wasn’t as fat as the other pigs.  This encouraged the other pigs to call China cruel names.  “Look at that skinny swine!” they would snort.  When China heard this, she cuddled up with her broken acorn and found somewhere to cry where the others couldn’t see her.</p><p> </p><p>As well as this, the other pigs loved to roll around in the squelching mud for most of the day.  Not China.  China preferred to keep her trotters out of the mud, which meant that she wasn’t as filthy as the other pigs.  This encouraged the other pigs to call her even more cruel names.  “Look at that hygienic hog!” they would grunt.  When China heard this, she cuddled up with her broken acorn and found somewhere to cry where the others couldn’t see her.</p><p>As the name calling continued, China became very miserable.  She felt awfully lonely on the Eastern side of Frearson’s farm, close to the huge oak tree.</p><p> </p><p>On the Western side of Frearson’s farm, close to the enormous horse-chestnut tree, there lived an odd-looking piglet named Burton.  As a tiny piglet, Burton was a joyful little animal, who spent many hours frolicking among the fallen leaves of the horse-chestnut tree.  After a while though, Burton realised that he was very different to the other pigs in his pen.</p><p> </p><p>Firstly, the other pigs could grunt with deep, booming “oinks” from their snouts.  Not Burton.  No matter how hard he tried, Burton could only manage a tiny “squeak”, which meant that he wasn’t as loud as the other pigs.  This encouraged the other pigs to call him cruel names.  “Listen to his wimpy whine!” they would snort.  When Burton heard this, he would hide under a big pile of leaves so that the others couldn’t see him cry.</p><p> </p><p>As well as this, the other pigs liked to bathe in the mud all day.  Not Burton.  Burton found this very boring.  He preferred to run around all day, chasing as many leaves as possible, which meant that Burton wasn’t as lazy as the other pigs.  This encouraged the other pigs to call him even more cruel names.  “Look at that healthy hog!” they would grunt.  When Burton heard this, he would hide under a big pile of leaves so that the others couldn’t see him cry.</p><p>As the name calling continued, Burton became very sad.  He felt terribly lonesome on the Western side of Frearson’s farm, close to the enormous horse-chestnut tree.</p><p> </p><p>Then, one day, a huge van arrived on the farm.  On the side of the van were the words Chris P. Bacon.  Farmer Frearson began taking pigs over to the van.</p><p>“You’re not going to get chosen for the van,” some of the pigs sniggered to China, “you’re too skinny and clean!”</p><p>China cried a lonely tear and then continued to play with her acorn.</p><p>“You’re not going to get chosen for the van,” some of the pigs sneered to Burton, “you’re too high-pitched and healthy!”</p><p>Burton cried a lonely tear and then continued to play with his leaves.</p><p>Slowly, the other pigs disappeared into the back of the van until there were just two left.</p><p>“I don’t think anyone would want to eat you pair!” laughed Farmer Frearson.  So he put China and Burton in a pen together.</p><p>China watched Burton chasing a leaf.</p><p>“He’s not like the other pigs,” China thought to herself, “he looks odd.”</p><p>Burton watched China playing with her acorn.</p><p>“She’s not like the other pigs,” Burton thought to himself, “she looks strange.”</p><p>“Aren’t you going in the mud?” asked Burton.</p><p>“Oh no,” replied China, “I don’t like to get dirty.”</p><p>Burton laughed.  He thought this was one of the funniest things he’d ever heard.</p><p>He decided that he liked China so he showed her how to chase after the leaves.</p><p>China laughed.  She thought this was funny so she chased the leaves too.</p><p>China decided that she liked Burton so she showed him how to choose his food carefully instead of just eating anything.  Burton laughed with a squeak and his squeak made China laugh too.</p><p>Farmer Frearson watched the two pigs in amazement.  “Such strange little creatures!” he laughed.  He decided to keep the two odd pigs in their own little pen together where… they have been squeaking, laughing, chasing leaves, avoiding mud and eating very carefully ever since.</p>"}