{"title": "Piper was afraid", "author": "Rebekah Phillips", "level": "3 to 5,6 to 8,", "category": "Illustrated,Modern,Original,Poem,", "tag": "Dog,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/PiperWasAfraid-WEB_version-12-opt.jpg'></img><p>It was a beautiful day in Orange, Virginia and all the dogs were let out to play… except a dog named Piper. Piper was afraid.</p><p>He was the largest dog in the whole bunch! He could have eaten all those dogs for lunch! In his mind that didn’t matter much. Piper was afraid.</p><p>The floor creaked when he left his chair, so all day long he just stayed there. Piper was afraid.</p><p>The other dogs all ran and played, the sun was high and the horses neighed. But all this he missed each day because Piper was afraid.</p><img src='https://xcx.mdavid.cn/img/PiperWasAfraid-WEB_version-20-opt.jpg'></img><p>One evening there was quite a storm. It was a summer night and the house got warm, and Piper, he was all alone! Piper was afraid!</p><p>His family owned a lovely Inn, and although they had invited him to come that day and meet the guests… he stayed at home and didn’t join the rest, because Piper was afraid.</p><img src='https://xcx.mdavid.cn/img/PiperWasAfraid-WEB_version-22-opt.jpg'></img><p>Well now as the thunder grew louder and LOUDER and the big old house had lost its power… The rain slammed heavily on the roof and Piper was afraid!!</p><p>Terrified, he crept off his chair and wedged himself underneath the stairs. he was SO big that he got stuck there! PIPER WAS AFRAID!!</p><p>When his family came home later that night, they pulled him out and hugged him tight; then all six dogs did reunite! Piper was no longer afraid.</p><img src='https://xcx.mdavid.cn/img/PiperWasAfraid-WEB_version-28-opt.jpg'></img><p>I’ll never stay home alone again! I’ll join in the fun and be as BRAVE as I can!” whimpered Piper.</p><p>He meant what he said because he was never afraid again!</p>"}