{"title": "Princess Polly", "author": "Sharon Krager", "level": "3 to 5,6 to 8,", "category": "Fairy Tale,Original,True,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Princess-Polly-140x300.jpg'></img><p>To be a real princess, you have to believe in your heart that you are a princess. There are princess all over the world and some of them don’t even know that they are one.  Princesses come in all shapes and sizes. They do not always live in a castle, wear fancy clothes and wear crowns. It is hard to recognize princesses sometimes.</p><p>I remember back when I was about five years old. My Grandpa said that I was the most beautiful little princess that he had ever seen. Ever since that day, I knew he was right. I knew that I had a big heart. I loved people and animals of all kinds. I knew that to be a good one, I needed to act like a little lady. So when I dressed up in my pretty dresses and wore my fancy shoes, I knew that was what a princess was supposed to do. When I wore normal clothes and shoes, I felt the same way too. It all comes from the inside.</p><p>I tried not to play in sand or get dirt in my hair. I didn’t ride my bike too fast and tried to always be polite when talking to other people. I always sat with my hands folded on my lap while waiting to go somewhere.  I smiled and was kind to all animals. That was the way princesses were supposed to be.</p><p>When I got a little older, I became a bigger princess. I hoped that I could rule a kingdom where everyone was nice. I imagined that my palace would be filled with flowers on the inside and on the outside. Everyone that came to see me would be welcome and tea should always be served. The pets that came to live with me would all have special little houses to live in. All of my friends could be princesses too. Parties on Saturday nights, lots of good food and happy times would happen in my kingdom.</p><p>Well it didn’t happen exactly that way, but I tried to keep the same feeling inside as I did when I was growing up. Now that I am older, I look back at all of the times I had the chance to just act like a little princess. Not to say that there were other times that I had to be reminded of it. Mom and Dad were always around to keep me on track.</p><p>I think it is so wonderful to be a princess or at least to try to act like one. Not only for yourself but for every one that is around you. The world would be a better place if there were more princesses in it.</p><p>When I was very young and playing princess outside I remember hearing my Mother calling me in. I would say to myself,  “I will be a princess again tomorrow. Then I will live in a faraway land. Maybe one that no one has discovered yet.”</p><p>As I walked back to my house I sang this cute little song:</p><p>Princess Polly I will always be</p><p>Come and be a princess with me</p><p>Good things will happen as you can see</p><p>Being a princess makes your heart full of glee.</p>"}