{"title": "Punya Koti", "author": "Srijaya Char", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Folk Tale,Indian,", "tag": "Cow,Tiger,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>Kalinga was a cowherd. He owned a herd of cows. He had a name for each of his cows and he called them by their names. They lived in a pound; a big happy family. The calves played happily in a safe place in the jungle until their mothers came home after their graze. At day break, Kalinga would take his cows for grazing. He would sit under a tender mango tree with a huge brass pot and a few small mud pots. He would call his cows one by one by their names:</p><p>“Ganga you come first, Gauri you come next, Kamadhenu you come next, Bhumidevi now it is your turn, Ramagili you can come next.”</p><p>He was so affectionate that they came one by one with love.</p><p>In a forest nearby there lived Arbhuta, a wild tiger eager waiting to eat one of these cows. Kalinga was very careful about that. One day when sprang into to the valley roaring wildly, all the cows got scattered and ran away. Poor Punya Koti got caught in the tangled thorn bush and could not run fast.</p><p>Arbhuta was waiting for this opportunity and sprang in front of Punya Koti.</p><p>Punya Koti was taken aback. She knew her end was near.</p><p>“Please listen to my humble request,” she asked. “I have a calf back at the pound expecting my milk. Give me little time, I shall feed him and come back to you soon. Kindly be merciful to my little one. She is hungry.”</p><p>“I have found you when I am hungry,” he replied. “Do you think I am a so stupid as to let you go now? I am sure you will never come back. Don’t try to hoodwink me.”</p><p>“Truth is motto of my life it is my parents,” replied Punya Koti. “Honesty is my kith and kin. If I do not follow my policy of honesty, God will never forgive me.</p><p>Arbhuta could not say no as she was pleading for her little one. He gave her permission with the promise that she would be back.</p><p>Punya Koti gave a solid promise to the tiger; and came back to feed her calf. When the calf heard her story, he had tears in his eyes.</p><p>“Mother, why should you die?” he cried. “Why should you make me an orphan? Why don’t you stay back? The tiger will never find you. From whose udder shall I suck milk?” she continued. “Mamma, with whom will I sleep, Mamma? Who will be as kind and loving as you are?”</p><p>“I cannot break the promise I have given to Arbhuta,” replied Punya Koti. “I can never think of cheating anyone. I shall go to him with devotion. This is my final decision.”</p><p>Punya Koti looked at the herd around her and spoke.</p><p>“Dear mothers, sisters and daughters, kindly look after my calf as your own. He has now become an orphan. Do not kick him when he is at your back. Do not butt when he is in front of you. Kindly think of this orphan as your own.” She continued with tears in her eyes; “Now, you have become an orphan, my son, I shall become food for the Tiger. Our obligation to each other is no more.” – She hugged her calf tightly, cried and left.</p><p>She had a nice holy bath in the river and went to the forest in search of Arbhuta. She went and stood near his cave. She stood there feeling bad that she had kept him hungry for so long.</p><p>“Dear Arbhuta, here I am, sorry for keeping you hungry for so long. Come, and have me. Here is my flesh and meat; pounce on me you tiger, come and satisfy your hunger. Drink the hot blood that oozes out of my heart. Let it make you happy and satisfied.”</p><p>Arbhuta listened carefully to each word Punya Koti uttered. He just could not believe her words! He stared at her in disbelief and tears started pouring from his eyes. “My God, if I eat this honest soul, God will never forgive me.” – He shuddered to think of the consequences of his act, if he really did eat her! Oh God, No.”</p><p>He stood and stared at her for a while, and then looked up at the sky.</p><p>“O, Punya Koti, you are like my own sister. What will I get by killing and eating you? I will be a sinner.”</p><p>He bowed down to all the three Gods (Vishnu, Shiva and Bramha), he looked around in all the eight directions; suddenly he jumped up high to the skies and fell flat on the ground and died.</p><p>All the gods were pleased and there was a rain of flowers on from the heavens.</p><p>Punya Koti returned home to her kith and kin, her little calf cried aloud, jumped and danced with joy. Punya Koti narrated the story of how Arbhuta let her go.</p><p>This is the day that the cowherds celebrate with ‘Bhajans’ to Lord Krishna.</p><p>This is the story of Punaya Koti, who believed in truth, honesty and keeping promises.</p><p>________________________________________________________________________</p><p>Note: This is a celebrated folk tale of Karnataka written in poetry form by an anonymous author. This has been in children’s school textbooks and also a story for children since many years. Here the story has been retold by the author in a simple form.</p><p>Kalinga – name of the cowherd</p>"}