{"title": "Raggedy Ann and the Mouse", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Cat,Mouse,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s12a.jpg'></img><h2><a id=\"RAGGEDY_ANN_AND_THE_MOUSE\" name=\"RAGGEDY_ANN_AND_THE_MOUSE\"></a>RAGGEDY ANN AND THE MOUSE</h2><p>Jeanette was a new wax doll, and like Henny, the Dutch doll, she could say “Mamma” when anyone tipped her backward or forward. She had lovely golden brown curls of real hair. It could be combed and braided, or curled or fluffed without tangling, and Raggedy Ann was very proud when Jeanette came to live with the dolls.</p><p>But now Raggedy Ann was very angry—in fact, Raggedy Ann had just ripped two stitches out of the top of her head when she took her rag hands and pulled her rag face down into a frown (but when she let go of the frown her face stretched right back into her usual cheery smile).</p><p>And you would have been angry, too, for something had happened to Jeanette.</p><p>Something or someone had stolen into the nursery that night when the dolls were asleep and nibbled all the wax from Jeanette’s beautiful face—and now all her beauty was gone!</p><img src='https://xcx.mdavid.cn/img/s12b.jpg'></img><p>“It really is a shame!” said Raggedy Ann as she put her arms about Jeanette.</p><p>“Something must be done about it!” said the French doll as she stamped her little foot.</p><p>“If I catch the culprit, I will—well, I don’t know what I will do with him!” said the tin soldier, who could be very fierce at times, although he was seldom cross.</p><p>“Here is the hole he came from!” cried Uncle Clem from the other end of the nursery. “Come, see!”</p><p>All the dolls ran to where Uncle Clem was, down on his hands and knees.</p><p>“This must be the place!” said Raggedy Ann. “We will plug up the hole with something, so he will not come out again!”</p><p>The dolls hunted around and brought rags and pieces of paper and pushed them into the mouse’s doorway.</p><p>“I thought I heard nibbling last night,” one of the penny dolls said. “You know I begged for an extra piece of pie last evening, when Mistress had me at the table and it kept me awake!”</p><p>While the dolls were talking, Marcella ran down-stairs with Jeanette and told Daddy and Mamma, who came up-stairs with Marcella and hunted around until they discovered the mouse’s doorway.</p><p>“Oh, why couldn’t it have chewed on me?” Raggedy Ann asked herself when she saw Marcella’s sorrowful face, for Raggedy Ann was never selfish.</p><p>“Daddy will take Jeanette down-town with him and have her fixed up as good as new,” said Mamma, so Jeanette was wrapped in soft tissue paper and taken away.</p><p>Later in the day Marcella came bouncing into the nursery with a surprise for the dolls. It was a dear fuzzy little kitten.</p><p>Marcella introduced the kitten to all the dolls.</p><p>“Her name is Boots, because she has four little white feet!” said Marcella. So Boots, the happy little creature, played with the penny dolls, scraping them over the floor and peeping out from behind chairs and pouncing upon them as if they were mice and the penny dolls enjoyed it hugely.</p><p>When Marcella was not in the nursery, Raggedy Ann wrestled with Boots and they would roll over and over upon the floor, Boots with her front feet around Raggedy Ann’s neck and kicking with her hind feet.</p><p>Then Boots would arch her back and pretend she was very angry and walk sideways until she was close to Raggedy. Then she would jump at her and over and over they would roll, their heads hitting the floor bumpity-bump.</p><p>Boots slept in the nursery that night and was lonely for her Mamma, for it was the first time she had been away from home.</p><p>Even though her bed was right on top of Raggedy Ann, she could not sleep. But Raggedy Ann was very glad to have Boots sleep with her, even if she was heavy, and when Boots began crying for her Mamma, Raggedy Ann comforted her and soon Boots went to sleep.</p><p>One day Jeanette came home. She had a new coating of wax on her face and she was as beautiful as ever.</p><p>Now, by this time Boots was one of the family and did not cry at night. Besides Boots was told of the mouse in the corner and how he had eaten Jeanette’s wax, so she promised to sleep with one eye open.</p><p>Late that night when Boots was the only one awake, out popped a tiny mouse from the hole. Boots jumped after the mouse, and hit against the toy piano and made the keys tinkle so loudly it awakened the dolls.</p><p>They ran over to where Boots sat growling with the tiny mouse in her mouth.</p><p>My! how the mouse was squeaking!</p><p>Raggedy Ann did not like to hear it squeak, but she did not wish Jeanette to have her wax face chewed again, either.</p><p>So, Raggedy Ann said to the tiny little mouse, “You should have known better than to come here when Boots is with us. Why don’t you go out in the barn and live where you will not destroy anything of value?”</p><p>“I did not know!” squeaked the little mouse, “This is the first time I have ever been here!”</p><p>“Aren’t you the little mouse who nibbled Jeanette’s wax face?” Raggedy Ann asked.</p><p>“No!” the little mouse answered. “I was visiting the mice inside the walls and wandered out here to pick up cake crumbs! I have three little baby mice at home down in the barn. I have never nibbled at anyone’s wax face!”</p><p>“Are you a Mamma mouse?” Uncle Clem asked.</p><p>“Yes!” the little mouse squeaked, “and if the kitten will let me go I will run right home to my children and never return again!”</p><p>“Let her go, Boots!” the dolls all cried, “She has three little baby mice at home! Please let her go!”</p><p>“No, sir!” Boots growled, “This is the first mouse I have ever caught and I will eat her!” At this the little Mamma mouse began squeaking louder than ever.</p><p>“If you do not let the Mamma mouse go, Boots, I shall not play with you again!” said Raggedy Ann.</p><p>“Raggedy will not play with Boots again!” said all of the dolls in an awed tone. Not to have Raggedy play with them would have been sad, indeed.</p><p>But Boots only growled.</p><p>The dolls drew to one side, where Raggedy Ann and Uncle Clem whispered together.</p><p>And while they whispered Boots would let the little Mamma mouse run a piece, then she would catch it again and box it about between her paws.</p><p>This she did until the poor little Mamma mouse grew so tired it could scarcely run away from Boots.</p><p>Boots would let it get almost to the hole in the wall before she would catch it, for she knew it would not escape her.</p><p>As she watched the little mouse crawling towards the hole scarcely able to move, Raggedy Ann could not keep the tears from her shoe-button eyes.</p><p>Finally as Boots started to spring after the little mouse again, Raggedy Ann threw her rag arms around the kitten’s neck. “Run, Mamma mouse!” Raggedy Ann cried, as Boots whirled her over and over.</p><p>Uncle Clem ran and pushed the Mamma mouse into the hole and then she was gone.</p><p>When Raggedy Ann took her arms from around Boots, the kitten was very angry. She laid her ears back and scratched Raggedy Ann with her claws.</p><p>But Raggedy Ann only smiled—it did not hurt her a bit for Raggedy was sewed together with a needle and thread and if that did not hurt, how could the scratch of a kitten? Finally Boots felt ashamed of herself and went over and lay down by the hole in the wall in hopes the mouse would return, but the mouse never returned. Even then Mamma mouse was out in the barn with her children, warning them to beware of kittens and cats.</p><p>Raggedy Ann and all the dolls then went to bed and Raggedy had just dozed off to sleep when she felt something jump upon her bed. It was Boots. She felt a warm little pink tongue caress her rag cheek. Raggedy Ann smiled happily to herself, for Boots had curled up on top of Raggedy Ann and was purring herself to sleep.</p><p>Then Raggedy Ann knew she had been forgiven for rescuing the Mamma mouse and she smiled herself to sleep and dreamed happily of tomorrow.</p><img src='https://xcx.mdavid.cn/img/s12c.jpg'></img>"}