{"title": "Raggedy Ann’s New Sisters", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s13a.jpg'></img><h2><a id=\"RAGGEDY_ANNS_NEW_SISTERS\" name=\"RAGGEDY_ANNS_NEW_SISTERS\"></a>RAGGEDY ANN’S NEW SISTERS</h2><p>Marcella was having a tea party up in the nursery when Daddy called to her, so she left the dollies sitting around the tiny table and ran down stairs carrying Raggedy Ann with her.</p><p>Mama, Daddy and a strange man were talking in the living room and Daddy introduced Marcella to the stranger.</p><p>The stranger was a large man with kindly eyes and a cheery smile, as pleasant as Raggedy Ann’s.</p><img src='https://xcx.mdavid.cn/img/s13b.jpg'></img><p>He took Marcella upon his knee and ran his fingers through her curls as he talked to Daddy and Mamma, so, of course, Raggedy Ann liked him from the beginning. “I have two little girls,” he told Marcella. “Their names are Virginia and Doris, and one time when we were at the sea-shore they were playing in the sand and they covered up Freddy, Doris’ boy-doll in the sand. They were playing that Freddy was in bathing and that he wanted to be covered with the clean white sand, just as the other bathers did. And when they had covered Freddy they took their little pails and shovels and went farther down the beach to play and forgot all about Freddy.</p><p>“Now when it came time for us to go home, Virginia and Doris remembered Freddy and ran down to get him, but the tide had come in and Freddy was ‘way out under the water and they could not find him. Virginia and Doris were very sad and they talked of Freddy all the way home.”</p><p>“It was too bad they forgot Freddy,” said Marcella.</p><p>“Yes, indeed it was!” the new friend replied as he took Raggedy Ann up and made her dance on Marcella’s knee. “But it turned out all right after all, for do you know what happened to Freddy?”</p><p>“No, what did happen to him?” Marcella asked.</p><p>“Well, first of all, when Freddy was covered with the sand, he enjoyed it immensely. And he did not mind it so much when the tide came up over him, for he felt Virginia and Doris would return and get him.</p><p>“But presently Freddy felt the sand above him move as if someone was digging him out. Soon his head was uncovered and he could look right up through the pretty green water, and what do you think was happening? The Tide Fairies were uncovering Freddy!</p><p>“When he was completely uncovered, the Tide Fairies swam with Freddy ‘way out to the Undertow Fairies. The Undertow Fairies took Freddy and swam with him ‘way out to the Roller Fairies. The Roller Fairies carried Freddy up to the surface and tossed him up to the Spray Fairies who carried him to the Wind Fairies.”</p><p>“And the Wind Fairies?” Marcella asked breathlessly.</p><p>“The Wind Fairies carried Freddy right to our garden and there Virginia and Doris found him, none the worse for his wonderful adventure!”</p><p>“Freddy must have enjoyed it and your little girls must have been very glad to get Freddy back again!” said Marcella. “Raggedy Ann went up in the air on the tail of a kite one day and fell and was lost, so now I am very careful with her!”</p><p>“Would you let me take Raggedy Ann for a few days?” asked the new friend.</p><p>Marcella was silent. She liked the stranger friend, but she did not wish to lose Raggedy Ann.</p><p>“I will promise to take very good care of her and return her to you in a week. Will you let her go with me, Marcella?”</p><p>Marcella finally agreed and when the stranger friend left, he placed Raggedy Ann in his grip.</p><p>“It is lonely without Raggedy Ann!” said the dollies each night.</p><p>“We miss her happy painted smile and her cheery ways!” they said.</p><p>And so the week dragged by….</p><p>But, my! What a chatter there was in the nursery the first night after Raggedy Ann returned. All the dolls were so anxious to hug Raggedy Ann they could scarcely wait until Marcella had left them alone.</p><p>When they had squeezed Raggedy Ann almost out of shape and she had smoothed out her yarn hair, patted her apron out and felt her shoe-button eyes to see if they were still there, she said, “Well, what have you been doing? Tell me all the news!”</p><p>“Oh we have just had the usual tea parties and games!” said the tin soldier. “Tell us about yourself, Raggedy dear, we have missed you so much!”</p><p>“Yes! Tell us where you have been and what you have done, Raggedy!” all the dolls cried.</p><p>But Raggedy Ann just then noticed that one of the penny dolls had a hand missing.</p><p>“How did this happen?” she asked as she picked up the doll.</p><p>“I fell off the table and lit upon the tin soldier last night when we were playing. But don’t mind a little thing like that, Raggedy Ann,” replied the penny doll. “Tell us of yourself! Have you had a nice time?”</p><p>“I shall not tell a thing until your hand is mended!” Raggedy Ann said.</p><p>So the Indian ran and brought a bottle of glue. “Where’s the hand?” Raggedy asked.</p><p>“In my pocket,” the penny doll answered.</p><img src='https://xcx.mdavid.cn/img/s13c.jpg'></img><p>When Raggedy Ann had glued the penny doll’s hand in place and wrapped a rag around it to hold it until the glue dried, she said, “When I tell you of this wonderful adventure, I know you will all feel very happy. It has made me almost burst my stitches with joy.”</p><p>The dolls all sat upon the floor around Raggedy Ann, the tin soldier with his arm over her shoulder.</p><p>“Well, first when I left,” said Raggedy Ann, “I was placed in the Stranger Friend’s grip. It was rather stuffy in there, but I did not mind it; in fact I believe I must have fallen asleep, for when I awakened I saw the Stranger Friend’s hand reaching into the grip. Then he lifted me from the grip and danced me upon his knee. ‘What do you think of her?’ he asked to three other men sitting nearby.</p><p>“I was so interested in looking out of the window I did not pay any attention to what they said, for we were on a train and the scenery was just flying by! Then I was put back in the grip.</p><p>“When next I was taken from the grip I was in a large, clean, light room and there were many, many girls all dressed in white aprons.</p><p>“The stranger friend showed me to another man and to the girls who took off my clothes, cut my seams and took out my cotton. And what do you think! They found my lovely candy heart had not melted at all as I thought. Then they laid me on a table and marked all around my outside edges with a pencil on clean white cloth, and then the girls re-stuffed me and dressed me.</p><p>“I stayed in the clean big light room for two or three days and nights and watched my Sisters grow from pieces of cloth into rag dolls just like myself!”</p><p>“Your SISTERS!” the dolls all exclaimed in astonishment, “What do you mean, Raggedy?”</p><p>“I mean,” said Raggedy Ann, “that the Stranger Friend had borrowed me from Marcella so that he could have patterns made from me. And before I left the big clean white room there where hundreds of rag dolls so like me you would not have been able to tell us apart.”</p><p>“We could have told you by your happy smile!” cried the French dolly.</p><p>“But all of my sister dolls have smiles just like mine!” replied Raggedy Ann.</p><p>“And shoe-button eyes?” the dolls all asked.</p><p>“Yes, shoe-button eyes!” Raggedy Ann replied.</p><p>“I would tell you from the others by your dress, Raggedy Ann,” said the French doll, “Your dress is fifty years old! I could tell you by that!”</p><p>“But my new sister rag dolls have dresses just like mine, for the Stranger Friend had cloth made especially for them exactly like mine.”</p><p>“I know how we could tell you from the other rag dolls, even if you all look exactly alike!” said the Indian doll, who had been thinking for a long time.</p><p>“How?” asked Raggedy Ann with a laugh.</p><p>“By feeling your candy heart! If the doll has a candy heart then it is you, Raggedy Ann!”</p><p>Raggedy Ann laughed, “I am so glad you all love me as you do, but I am sure you would not be able to tell me from my new sisters, except that I am more worn, for each new rag doll has a candy heart, and on it is written, ‘I love you‘ just as is written on my own candy heart.”</p><p>“And there are hundreds and hundreds of the new rag dolls?” asked the little penny dolls.</p><p>“Hundreds and hundreds of them, all named Raggedy Ann,” replied Raggedy.</p><p>“Then,” said the penny dolls, “we are indeed happy and proud for you! For wherever one of the new Raggedy Ann dolls goes there will go with it the love and happiness that you give to others.”</p><img src='https://xcx.mdavid.cn/img/s13d.jpg'></img>"}