{"title": "Raggedy Ann and the Kite", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s4a.jpg'></img><h2><a id=\"Raggedy_Ann_and_the_Kite\" name=\"Raggedy_Ann_and_the_Kite\"></a>RAGGEDY ANN AND THE KITE</h2><p>Raggedy Ann watched with interest the preparations.</p><p>A number of sticks were being fastened together with strings and covered with light cloth.</p><p>Raggedy Ann heard some of the boys talk of “The Kite,” so Raggedy Ann knew this must be a kite.</p><p>When a tail had been fastened to the kite and a large ball of heavy twine tied to the front, one of the boys held the kite up in the air and another boy walked off, unwinding the ball of twine.</p><p>There was a nice breeze blowing, so the boy with the twine called, “Let ‘er go” and started running.</p><p>Marcella held Raggedy up so that she could watch the kite sail through the air.</p><p>How nicely it climbed! But suddenly the kite acted strangely, and as all the children shouted advice to the boy with the ball of twine, the kite began darting this way and that, and finally making four or five loop-the-loops, it crashed to the ground.</p><p>“It needs more tail on it!” one boy shouted.</p><p>Then the children asked each other where they might get more rags to fasten to the tail of the kite.</p><img src='https://xcx.mdavid.cn/img/s4b.jpg'></img><p>“Let’s tie Raggedy Ann to the tail!” suggested Marcella. “I know she would enjoy a trip ‘way up in the sky!”</p><p>The boys all shouted with delight at this new suggestion. So Raggedy Ann was tied to the tail of the kite.</p><p>This time the kite rose straight in the air and remained steady. The boy with the ball of twine unwound it until the kite and Raggedy Ann were ‘way, ‘way up and far away. How Raggedy Ann enjoyed being up there! She could see for miles and miles! And how tiny the children looked!</p><p>Suddenly a great puff of wind came and carried Raggedy Ann streaming ‘way out behind the kite! She could hear the wind singing on the twine as the strain increased.</p><p>Suddenly Raggedy Ann felt something rip. It was the rag to which she was tied. As each puff of wind caught her the rip widened.</p><p>When Marcella watched Raggedy Ann rise high above the field, she wondered how much Raggedy Ann enjoyed it, and wished that she, too, might have gone along. But after the kite had been up in the air for five or ten minutes, Marcella grew restless. Kites were rather tiresome. There was more fun in tea parties out under the apple tree.</p><p>“Will you please pull down the kite now?” she asked the boy with the twine. “I want Raggedy Ann.”</p><p>“Let her ride up there!” the boy replied. “We’ll bring her home when we pull down the kite! We’re going to get another ball of twine and let her go higher!”</p><p>Marcella did not like to leave Raggedy Ann with the boys, so she sat down upon the ground to wait until they pulled down the kite.</p><p>But while Marcella watched Raggedy Ann, a dot in the sky, she could not see the wind ripping the rag to which Raggedy was tied.</p><p>Suddenly the rag parted and Raggedy Ann went sailing away as the wind caught in her skirts.</p><p>Marcella jumped from the ground, too surprised to say anything. The kite, released from the weight of Raggedy Ann began darting and swooping to the ground.</p><img src='https://xcx.mdavid.cn/img/s4c.jpg'></img><p>“We’ll get her for you!” some of the boys said when they saw Marcella’s troubled face, and they started running in the direction Raggedy Ann had fallen. Marcella and the other girls ran with them. They ran, and they ran, and they ran, and at last they found the kite upon the ground with one of the sticks broken, but they could not find Raggedy Ann anywhere.</p><p>“She must have fallen almost in your yard!” a boy said to Marcella, “for the kite was directly over here when the doll fell!”</p><p>Marcella was heartbroken. She went in the house and lay on the bed. Mamma went out with the children and tried to find Raggedy Ann, but Raggedy Ann was nowhere to be seen.</p><p>When Daddy came home in the evening he tried to find Raggedy, but met with no success. Marcella had eaten hardly any dinner, nor could she be comforted by Mamma or Daddy. The other dolls in the nursery lay forgotten and were not put to bed that night, for Marcella lay and sobbed and tossed about her bed.</p><p>Finally she said a little prayer for Raggedy Ann, and went to sleep. And as she slept Marcella dreamed that the fairies came and took Raggedy Ann with them to fairyland for a visit, and then sent Raggedy Ann home to her. She awakened with a cry. Of course Mamma came to her bed right away and said that Daddy would offer a reward in the morning for the return of Raggedy.</p><p>“It was all my fault, Mamma!” Marcella said. “I should not have offered the boys dear old Raggedy Ann to tie on the tail of the kite! But I just know the fairies will send her back.”</p><p>Mamma took her in her arms and soothed her with cheering words, although she felt indeed that Raggedy Ann was truly lost and would never be found again.</p><p>Now, where do you suppose Raggedy Ann was all this time?</p><img src='https://xcx.mdavid.cn/img/s4d.jpg'></img><p>When Raggedy Ann dropped from the kite, the wind caught in her skirts and carried her along until she fell in the fork of the large elm tree directly over Marcella’s house. When Raggedy Ann fell with a thud, face up in the fork of the tree, two robins who had a nest near by flew chattering away.</p><img src='https://xcx.mdavid.cn/img/s4e.jpg'></img><p>Presently the robins returned and quarreled at Raggedy Ann for laying so close to their nest, but Raggedy Ann only smiled at them and did not move.</p><p>When the robins quieted down and quit their quarreling, one of them hopped up closer to Raggedy Ann in order to investigate.</p><p>It was Mamma Robin. She called to Daddy Robin and told him to come. “See the nice yarn! We could use it to line the nest with,” she said.</p><p>So the robins hopped closer to Raggedy Ann and asked if they might have some of her yarn hair to line their nest. Raggedy Ann smiled at them. So the two robins pulled and tugged at Raggedy Ann’s yarn hair until they had enough to line their nest nice and soft.</p><p>Evening came and the robins sang their good night songs, and Raggedy Ann watched the stars come out, twinkle all night and disappear in the morning light. In the morning the robins again pulled yarn from Raggedy Ann’s head, and loosened her so she could peep over the side of the limb, and when the sun came up Raggedy Ann saw she was in the trees in her own yard.</p><p>Now before she could eat any breakfast, Marcella started out to find Raggedy Ann. And, it was Marcella herself who found her. And this is how she did it.</p><p>Mamma Robin had seen Marcella with Raggedy Ann out in the yard many times, so she began calling “Cheery! Cheery!” and Daddy Robin started calling “Cheery! Cheery! Cheer up! Cheer up! Cheerily Cheerily! Cheery! Cheery!” And Marcella looking up into the tree above the house to see the robins, discovered Raggedy Ann peeping over the limb at her.</p><p>Oh, how her heart beat with happiness. “Here is Raggedy Ann,” she shouted.</p><p>And Mamma and Daddy came out and saw Raggedy smiling at them, and Daddy got the clothes prop and climbed out of the attic window and poked Raggedy Ann out of the tree and she fell right into Marcella’s arms where she was hugged in a tight embrace.</p><p>“You’ll never go up on a kite again, Raggedy Ann!” said Marcella, “for I felt so lost without you. I will never let you leave me again.”</p><p>So Raggedy Ann went into the house and had breakfast with her little mistress and Mamma and Daddy smiled at each other when they peeped through the door into the breakfast room, for Raggedy Ann’s smile was wide and very yellow. Marcella, her heart full of happiness, was feeding Raggedy Ann part of her egg.</p><img src='https://xcx.mdavid.cn/img/s4f.jpg'></img>"}