{"title": "Raggedy Ann and the Chickens", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Chicken,Hen,Rooster,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s11a.jpg'></img><h2><a id=\"RAGGEDY_ANN_AND_THE_CHICKENS\" name=\"RAGGEDY_ANN_AND_THE_CHICKENS\"></a>RAGGEDY ANN AND THE CHICKENS</h2><p>When Marcella was called into the house she left Raggedy sitting on the chicken yard fence. “Now you sit quietly and do not stir,” Marcella told Raggedy Ann, “If you move you may fall and hurt yourself!”</p><p>So, Raggedy Ann sat quietly, just as Marcella told her, but she smiled at the chickens for she had fallen time and again and it had never hurt her in the least. She was stuffed with nice soft cotton, you see.</p><p>So, there she sat until a tiny little humming-bird, in search of flower honey hummed close to Raggedy Ann’s head and hovered near the tall Hollyhocks.</p><p>Raggedy Ann turned her rag head to see the humming-bird and lost her balance—plump! she went, down amongst the chickens.</p><img src='https://xcx.mdavid.cn/img/s11b.jpg'></img><p>The chickens scattered in all directions, all except Old Ironsides, the rooster.</p><p>He ruffled his neck feathers and put his head down close to the ground, making a queer whistling noise as he looked fiercely at Raggedy Ann.</p><p>But Raggedy Ann only smiled at Old Ironsides, the rooster, and ran her rag hand through her yarn hair for she did not fear him.</p><p>And then something strange happened, for when she made this motion the old rooster jumped up in the air and kicked his feet out in front, knocking Raggedy Ann over and over.</p><p>When Raggedy Ann stopped rolling she waved her apron at the rooster and cried, “Shoo!” but instead of “shooing,” Old Ironsides upset her again.</p><p>Now, two old hens who had been watching the rooster jump at Raggedy ran up and as one old hen placed herself before the rooster, the other old hen caught hold of Raggedy’s apron and dragged her into the chicken-coop.</p><p>It was dark inside and Raggedy could not tell what was going on as she felt herself being pulled up over the nests.</p><p>But, finally Raggedy could sit up, for the old hen had quit pulling her, and as her shoe-button eyes were very good, she soon made out the shape of the old hen in front of her.</p><p>“My! that’s the hardest work I have done in a long time!” said the old hen, when she could catch her breath. “I was afraid Mr. Rooster would tear your dress and apron!”</p><p>“That was a queer game he was playing, Mrs. Hen,” said Raggedy Ann.</p><p>The old hen chuckled ‘way down in her throat, “Gracious me! He wasn’t playing a game, he was fighting you!”</p><p>“Fighting!” cried Raggedy Ann in surprise.</p><p>“Oh yes, indeed!” the old hen answered, “Old Ironsides, the rooster, thought you intended to harm some of the children chickens and he was fighting you!”</p><p>“I am sorry that I fell inside the pen, I wouldn’t harm anything,” Raggedy Ann said.</p><p>“If we tell you a secret you must promise not to tell your mistress!” said the old hens.</p><p>“I promise! Cross my candy heart!” said Raggedy Ann.</p><p>Then the two old hens took Raggedy Ann ‘way back in the farthest corner of the chicken coop. There, in back of a box, they had built two nests and each old hen had ten eggs in her nest.</p><p>“If your folks hear of it they will take the eggs!” said the hens, “and then we could not raise our families!”</p><img src='https://xcx.mdavid.cn/img/s11c.jpg'></img><p>Raggedy Ann felt the eggs and they were nice and warm.</p><p>“We just left the nests when you fell into the pen!” explained the old hens.</p><p>“But how can the eggs grow if you sit upon them?” said Raggedy. “If Fido sits on any of the garden, the plants will not grow, Mistress says!”</p><p>“Eggs are different!” one old hen explained. “In order to make the eggs hatch properly, we must sit on them three weeks and not let them get cold at any time!”</p><p>“And at the end of the three weeks do the eggs sprout?” asked Raggedy Ann.</p><p>“You must be thinking of eggplant!” cried one old hen. “These eggs hatch at the end of three weeks—they don’t sprout—and then we have a lovely family of soft downy chickies; little puff balls that we can cuddle under our wings and love dearly!”</p><p>“Have you been sitting upon the eggs very long?” Raggedy asked.</p><p>“Neither one of us has kept track of the time,” said one hen. “So we do not know! You see, we never leave the nests only just once in a while to get a drink and to eat a little. So we can hardly tell when it is day and when it is night.”</p><p>“We were going out to get a drink when you fell in the pen!” said one old hen. “Now we will have to sit upon the eggs and warm them up again!”</p><p>The two old hens spread their feathers and nestled down upon the nests.</p><p>“When you get them good and warm, I would be glad to sit upon the eggs to keep them warm until you get something to eat and drink!” said Raggedy. So the two old hens walked out of the coop to finish their meal which had been interrupted by Raggedy’s fall and while they were gone, Raggedy Ann sat quietly upon the warm eggs. Suddenly down beneath her she heard something go, “Pick, pick!” “I hope it isn’t a mouse!” Raggedy Ann said to herself, when she felt something move. “I wish the old hens would come back.” But when they came back and saw the puzzled expression on her face, they cried, “What is it?”</p><img src='https://xcx.mdavid.cn/img/s11e.jpg'></img><p>Raggedy Ann got to her feet and looked down and there were several little fluffy, cuddly baby chickies, round as little puff-balls.</p><p>“Cheep! Cheep! Cheep!” they cried when Raggedy stepped out of the nest.</p><p>“Baby Chicks!” Raggedy cried, as she stooped and picked up one of the little puff-balls. “They want to be cuddled!”</p><p>The two old hens, their eyes shining with happiness, got upon the nests and spread out their soft warm feathers, “The other eggs will hatch soon!” said they.</p><p>So, for several days Raggedy helped the two hens hatch out the rest of the chickies and just as they finished, Marcella came inside looking around.</p><p>“How in the world did you get in here, Raggedy Ann?” she cried. “I have been looking all about for you! Did the chickens drag you in here?”</p><p>Both old hens down behind the box clucked softly to the chickies beneath them and Marcella overheard them.</p><p>She lifted the box away and gave a little squeal of surprise and happiness.</p><p>“Oh you dear old Hennypennies!” she cried, lifting both old hens from their nests. “You have hidden your nests away back here and now you have one, two, three, four—twenty chickies!” and as she counted them, Marcella placed them in her apron; then catching up Raggedy Ann, she placed her over the new little chickies.</p><p>“Come on, old Hennypennies!” she said, and went out of the coop with the two old hens clucking at her heels.</p><p>Marcella called Daddy and Daddy rolled two barrels out under one of the trees and made a nice bed in each. Then he nailed slats across the front, leaving a place for a door. Each Hennypennie was then given ten little chickies and shut up in the barrel. And all the dolls were happy when they heard of Raggedy’s adventure and they did not have to wait long before they were all taken out to see the new chickies.</p>"}