{"title": "Raggedy Ann Learns a Lesson", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s1.jpg'></img><h2><a id=\"RAGGEDY_ANN_LEARNS_A_LESSON\" name=\"RAGGEDY_ANN_LEARNS_A_LESSON\"></a>RAGGEDY ANN LEARNS A LESSON</h2><p>One day the dolls were left all to themselves.</p><p>Their little mistress had placed them all around the room and told them to be nice children while she was away.</p><p>And there they sat and never even so much as wiggled a finger, until their mistress had left the room.</p><p>Then the soldier dolly turned his head and solemnly winked at Raggedy Ann.</p><p>And when the front gate clicked and the dollies knew they were alone in the house, they all scrambled to their feet.</p><p>“Now let’s have a good time!” cried the tin soldier. “Let’s all go in search of something to eat!”</p><p>“Yes! Let’s all go in search of something to eat!” cried all the other dollies.</p><p>“When Mistress had me out playing with her this morning,” said Raggedy Ann, “she carried me by a door near the back of the house and I smelled something which smelled as if it would taste delicious!”</p><p>“Then you lead the way, Raggedy Ann!” cried the French dolly.</p><p>“I think it would be a good plan to elect Raggedy Ann as our leader on this expedition!” said the Indian doll.</p><p>At this all the other dolls clapped their hands together and shouted, “Hurrah! Raggedy Ann will be our leader.”</p><p>So Raggedy Ann, very proud indeed to have the confidence and love of all the other dollies, said that she would be very glad to be their leader.</p><p>“Follow me!” she cried as her wobbly legs carried her across the floor at a lively pace.</p><p>The other dollies followed, racing about the house until they came to the pantry door. “This is the place!” cried Raggedy Ann, and sure enough, all the dollies smelled something which they knew must be very good to eat.</p><p>But none of the dollies was tall enough to open the door and, although they pushed and pulled with all their might, the door remained tightly closed.</p><img src='https://xcx.mdavid.cn/img/s1a-tb.jpg'></img><p>The dollies were talking and pulling and pushing and every once in a while one would fall over and the others would step on her in their efforts to open the door. Finally Raggedy Ann drew away from the others and sat down on the floor.</p><p>When the other dollies discovered Raggedy Ann sitting there, running her rag hands through her yarn hair, they knew she was thinking.</p><p>“Sh! Sh!” they said to each other and quietly went over near Raggedy Ann and sat down in front of her.</p><p>“There must be a way to get inside,” said Raggedy Ann.</p><p>“Raggedy says there must be a way to get inside!” cried all the dolls.</p><p>“I can’t seem to think clearly to-day,” said Raggedy Ann. “It feels as if my head were ripped.”</p><p>At this the French doll ran to Raggedy Ann and took off her bonnet. “Yes, there is a rip in your head, Raggedy!” she said and pulled a pin from her skirt and pinned up Raggedy’s head. “It’s not a very neat job, for I got some puckers in it!” she said.</p><p>“Oh that is ever so much better!” cried Raggedy Ann. “Now I can think quite clearly.”</p><p>“Now Raggedy can think quite clearly!” cried all the dolls.</p><p>“My thoughts must have leaked out the rip before!” said Raggedy Ann.</p><p>“They must have leaked out before, dear Raggedy!” cried all the other dolls.</p><p>“Now that I can think so clearly,” said Raggedy Ann, “I think the door must be locked and to get in we must unlock it!”</p><p>“That will be easy!” said the Dutch doll who says “Mamma” when he is tipped backward and forward, “For we will have the brave tin soldier shoot the key out of the lock!”</p><img src='https://xcx.mdavid.cn/img/s1b-tb.jpg'></img><p>“I can easily do that!” cried the tin soldier, as he raised his gun.</p><p>“Oh, Raggedy Ann!” cried the French dolly. “Please do not let him shoot!”</p><p>“No!” said Raggedy Ann. “We must think of a quieter way!”</p><p>After thinking quite hard for a moment, Raggedy Ann jumped up and said: “I have it!” And she caught up the Jumping Jack and held him up to the door; then Jack slid up his stick and unlocked the door.</p><p>Then the dollies all pushed and the door swung open.</p><p>My! Such a scramble! The dolls piled over one another in their desire to be the first at the goodies.</p><p>They swarmed upon the pantry shelves and in their eagerness spilled a pitcher of cream which ran all over the French dolly’s dress.</p><img src='https://xcx.mdavid.cn/img/s1c-tb.jpg'></img><p>The Indian doll found some corn bread and dipping it in the molasses he sat down for a good feast.</p><p>A jar of raspberry jam was overturned and the dollies ate of this until their faces were all purple.</p><p>The tin soldier fell from the shelf three times and bent one of his tin legs, but he scrambled right back up again.</p><img src='https://xcx.mdavid.cn/img/s1d-tb.jpg'></img><p>Never had the dolls had so much fun and excitement, and they had all eaten their fill when they heard the click of the front gate.</p><p>They did not take time to climb from the shelves, but all rolled or jumped off to the floor and scrambled back to their room as fast as they could run, leaving a trail of bread crumbs and jam along the way.</p><p>Just as their mistress came into the room the dolls dropped in whatever positions they happened to be in.</p><p>“This is funny!” cried Mistress. “They were all left sitting in their places around the room! I wonder if Fido has been shaking them up!” Then she saw Raggedy Ann’s face and picked her up. “Why Raggedy Ann, you are all sticky! I do believe you are covered with jam!” and Mistress tasted Raggedy Ann’s hand. “Yes! It’s JAM! Shame on you, Raggedy Ann! You’ve been in the pantry and all the others, too!” and with this the dolls’ mistress dropped Raggedy Ann on the floor and left the room.</p><p>When she came back she had on an apron and her sleeves were rolled up.</p><p>She picked up all the sticky dolls and putting them in a basket she carried them out under the apple tree in the garden.</p><p>There she had placed her little tub and wringer and she took the dolls one at a time, and scrubbed them with a scrubbing brush and soused them up and down and this way and that in the soap suds until they were clean.</p><p>Then she hung them all out on the clothes-line in the sunshine to dry.</p><img src='https://xcx.mdavid.cn/img/s1c2.jpg'></img><p>There the dolls hung all day, swinging and twisting about as the breeze swayed the clothes-line.</p><p>“I do believe she scrubbed my face so hard she wore off my smile!” said Raggedy Ann, after an hour of silence.</p><p>“No, it is still there!” said the tin solder, as the wind twisted him around so he could see Raggedy. “But I do believe my arms will never work without squeaking, they feel so rusted,” he added.</p><img src='https://xcx.mdavid.cn/img/s1e-tb.jpg'></img><p>Just then the wind twisted the little Dutch doll and loosened his clothes-pin, so that he fell to the grass below with a sawdusty bump and as he rolled over he said, “Mamma!” in a squeaky voice.</p><p>Late in the afternoon the back door opened and the little mistress came out with a table and chairs. After setting the table she took all the dolls from the line and placed them about the table.</p><p>They had lemonade with grape jelly in it, which made it a beautiful lavender color, and little “Baby-teeny-weeny-cookies” with powdered sugar on them.</p><p>After this lovely dinner, the dollies were taken in the house, where they had their hair brushed and nice clean nighties put on.</p><p>Then they were placed in their beds and Mistress kissed each one good night and tiptoed from the room.</p><p>All the dolls lay as still as mice for a few minutes, then Raggedy Ann raised up on her cotton-stuffed elbows and said: “I have been thinking!”</p><p>“Sh!” said all the other dollies, “Raggedy has been thinking!”</p><p>“Yes,” said Raggedy Ann, “I have been thinking; our mistress gave us the nice dinner out under the trees to teach us a lesson. She wished us to know that we could have had all the goodies we wished, whenever we wished, if we had behaved ourselves. And our lesson was that we must never take without asking what we could always have for the asking! So let us all remember and try never again to do anything which might cause those who love us any unhappiness!”</p><p>“Let us all remember,” chimed all the other dollies.</p><p>And Raggedy Ann, with a merry twinkle in her shoe-button eyes, lay back in her little bed, her cotton head filled with thoughts of love and happiness.</p><img src='https://xcx.mdavid.cn/img/s1f-tb.jpg'></img>"}