{"title": "Raggedy Ann and the Washing", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s3a.jpg'></img><h2><a id=\"RAGGEDY_ANN_AND_THE_WASHING\" name=\"RAGGEDY_ANN_AND_THE_WASHING\"></a>RAGGEDY ANN AND THE WASHING</h2><p>“Why, Dinah! How could you!”</p><p>Mamma looked out of the window and saw Marcella run up to Dinah and take something out of her hand and then put her head in her arm and commence crying.</p><p>“What is the trouble, Dear?” Mamma asked, as she came out the door and knelt beside the little figure shaking with sobs.</p><p>Marcella held out Raggedy Ann. But such a comical looking Raggedy Ann!</p><p>Mamma had to smile in spite of her sympathy, for Raggedy Ann looked ridiculous!</p><p>Dinah’s big eyes rolled out in a troubled manner, for Marcella had snatched Raggedy Ann from Dinah’s hand as she cried, “Why, Dinah! How could you?”</p><p>Dinah could not quite understand and, as she dearly loved Marcella, she was troubled.</p><p>Raggedy Ann was not in the least downhearted and while she felt she must look very funny she continued to smile, but with a more expansive smile than ever before.</p><img src='https://xcx.mdavid.cn/img/s3b.jpg'></img><p>Raggedy Ann knew just how it all happened and her remaining shoe-button eye twinkled.</p><p>She remembered that morning when Marcella came to the nursery to take the nighties from the dolls and dress them she had been cross.</p><p>Raggedy Ann thought at the time “Perhaps she had climbed out of bed backwards!” For Marcella complained to each doll as she dressed them.</p><p>And when it came Raggedy’s time to be dressed, Marcella was very cross for she had scratched her finger on a pin when dressing the French doll.</p><p>So, when Marcella heard the little girl next door calling to her, she ran out of the nursery and gave Raggedy Ann a toss from her as she ran.</p><p>Now it happened Raggedy lit in the clothes hamper and there she lay all doubled up in a knot.</p><p>A few minutes afterwards Dinah came through the hall with an armful of clothes and piled them in the hamper on top of Raggedy Ann.</p><p>Then Dinah carried the hamper out in back of the house where she did the washing.</p><p>Dinah dumped all the clothes into the boiler and poured water on them.</p><p>The boiler was then placed upon the stove.</p><p>When the water began to get warm, Raggedy Ann wiggled around and climbed up amongst the clothes to the top of the boiler to peek out. There was too much steam and she could see nothing. For that matter, Dinah could not see Raggedy Ann, either, on account of the steam.</p><p>So Dinah, using an old broom handle, stirred the clothes in the boiler and the clothes and Raggedy Ann were stirred and whirled around until all were thoroughly boiled.</p><p>When Dinah took the clothes a piece at a time from the boiler and scrubbed them, she finally came upon Raggedy Ann.</p><p>Now Dinah did not know but that Marcella had placed Raggedy in the clothes hamper to be washed, so she soaped Raggedy well and scrubbed her up and down over the rough wash-board.</p><p>Two buttons from the back of Raggedy’s dress came off and one of Raggedy Ann’s shoe-button eyes was loosened as Dinah gave her face a final scrub.</p><p>Then Dinah put Raggedy Ann’s feet in the wringer and turned the crank. It was hard work getting Raggedy through the wringer, but Dinah was very strong. And of course it happened! Raggedy Ann came through as flat as a pancake.</p><img src='https://xcx.mdavid.cn/img/s3c.jpg'></img><p>It was just then, that Marcella returned and saw Raggedy.</p><p>“Why, Dinah! How could you!” Marcella had sobbed as she snatched the flattened Raggedy Ann from the bewildered Dinah’s hand.</p><p>Mamma patted Marcella’s hand and soon coaxed her to quit sobbing.</p><p>When Dinah explained that the first she knew of Raggedy being in the wash was when she took her from the boiler, Marcella began crying again.</p><p>“It was all my fault, Mamma!” she cried. “I remember now that I threw dear old Raggedy Ann from me as I ran out the door and she must have fallen in the clothes hamper! Oh dear! Oh dear!” and she hugged Raggedy Ann tight.</p><p>Mamma did not tell Marcella that she had been cross and naughty for she knew Marcella felt very sorry. Instead Mamma put her arms around her and said,</p><p>“Just see how Raggedy Ann takes it! She doesn’t seem to be unhappy!”</p><p>And when Marcella brushed her tears away and looked at Raggedy Ann, flat as a pancake and with a cheery smile upon her painted face, she had to laugh. And Mamma and Dinah had to laugh, too, for Raggedy Ann’s smile was almost twice as broad as it had been before.</p><img src='https://xcx.mdavid.cn/img/s3d.jpg'></img><p>“Just let me hang Miss Raggedy on the line in the bright sunshine for half an hour,” said Dinah, “and you won’t know her when she comes off!”</p><p>So Raggedy Ann was pinned to the clothes-line, out in the bright sunshine, where she swayed and twisted in the breeze and listened to the chatter of the robins in a nearby tree.</p><p>Every once in a while Dinah went out and rolled and patted Raggedy until her cotton stuffing was soft and dry and fluffy and her head and arms and legs were nice and round again.</p><p>Then she took Raggedy Ann into the house and showed Marcella and Mamma how clean and sweet she was.</p><p>Marcella took Raggedy Ann right up to the nursery and told all the dolls just what had happened and how sorry she was that she had been so cross and peevish when she dressed them. And while the dolls said never a word they looked at their little mistress with love in their eyes as she sat in the little red rocking chair and held Raggedy Ann tightly in her arms.</p><p>And Raggedy Ann’s remaining shoe-button eye looked up at her little mistress in rather a saucy manner, but upon her face was the same old smile of happiness, good humor and love.</p><img src='https://xcx.mdavid.cn/img/s3e.jpg'></img>"}