{"title": "Raggedy Ann Rescues Fido", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Dog,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s5a.jpg'></img><h2><a id=\"RAGGEDY_ANN_RESCUES_FIDO\" name=\"RAGGEDY_ANN_RESCUES_FIDO\"></a>RAGGEDY ANN RESCUES FIDO</h2><p>It was almost midnight and the dolls were asleep in their beds; all except Raggedy Ann.</p><p>Raggedy lay there, her shoe-button eyes staring straight up at the ceiling. Every once in a while Raggedy Ann ran her rag hand up through her yarn hair. She was thinking.</p><p>When she had thought for a long, long time, Raggedy Ann raised herself on her wabbly elbows and said, “I’ve thought it all out.”</p><p>At this the other dolls shook each other and raised up saying, “Listen! Raggedy has thought it all out!”</p><p>“Tell us what you have been thinking, dear Raggedy,” said the tin soldier. “We hope they were pleasant thoughts.”</p><p>“Not very pleasant thoughts!” said Raggedy, as she brushed a tear from her shoe-button eyes. “You haven’t seen Fido all day, have you?”</p><p>“Not since early this morning,” the French dolly said.</p><p>“It has troubled me,” said Raggedy, “and if my head was not stuffed with lovely new white cotton, I am sure it would have ached with the worry! When Mistress took me into the living-room this afternoon she was crying, and I heard her mamma say, ‘We will find him! He is sure to come home soon!’ and I knew they were talking of Fido! He must be lost!”</p><p>The tin soldier jumped out of bed and ran over to Fido’s basket, his tin feet clicking on the floor as he went. “He is not here,” he said.</p><p>“When I was sitting in the window about noon-time,” said the Indian doll, “I saw Fido and a yellow scraggly dog playing out on the lawn and they ran out through a hole in the fence!”</p><img src='https://xcx.mdavid.cn/img/s5b.jpg'></img><p>“That was Priscilla’s dog, Peterkins!” said the French doll.</p><p>“I know poor Mistress is very sad on account of Fido,” said the Dutch doll, “because I was in the dining-room at supper-time and I heard her daddy tell her to eat her supper and he would go out and find Fido; but I had forgotten all about it until now.”</p><p>“That is the trouble with all of us except Raggedy Ann!” cried the little penny doll, in a squeaky voice, “She has to think for all of us!”</p><p>“I think it would be a good plan for us to show our love for Mistress and try and find Fido!” exclaimed Raggedy.</p><p>“It is a good plan, Raggedy Ann!” cried all the dolls. “Tell us how to start about it.”</p><p>“Well, first let us go out upon the lawn and see if we can track the dogs!” said Raggedy.</p><p>“I can track them easily!” the Indian doll said, “for Indians are good at trailing things!”</p><p>“Then let us waste no more time in talking!” said Raggedy Ann, as she jumped from bed, followed by the rest.</p><p>The nursery window was open, so the dolls helped each other up on the sill and then jumped to the soft grass below. They fell in all sorts of queer attitudes, but of course the fall did not hurt them.</p><p>At the hole in the fence the Indian doll picked up the trail of the two dogs, and the dolls, stringing out behind, followed him until they came to Peterkins’ house. Peterkins was surprised to see the strange little figures in white nighties come stringing up the path to the dog house.</p><img src='https://xcx.mdavid.cn/img/s5c.jpg'></img><p>Peterkins was too large to sleep in the nursery, so he had a nice cozy dog-house under the grape arbor.</p><p>“Come in,” Peterkins said when he saw and recognized the dolls, so all the dollies went into Peterkins’ house and sat about while Raggedy told him why they had come.</p><p>“It has worried me, too!” said Peterkins, “but I had no way of telling your mistress where Fido was, for she cannot understand dog language! For you see,” Peterkins continued, “Fido and I were having the grandest romp over in the park when a great big man with a funny thing on the end of a stick came running towards us. We barked at him and Fido thought he was trying to play with us and went up too close and do you know, that wicked man caught Fido in the thing at the end of the stick and carried him to a wagon and dumped him in with a lot of other dogs!”</p><p>“The Dog Catcher!” cried Raggedy Ann.</p><p>“Yes!” said Peterkins, as he wiped his eyes with his paws. “It was the dog catcher! For I followed the wagon at a distance and I saw him put all the dogs into a big wire pen, so that none could get out!”</p><p>“Then you know the way there, Peterkins?” asked Raggedy Ann.</p><p>“Yes, I can find it easily,” Peterkins said.</p><p>“Then show us the way!” Raggedy Ann cried, “for we must try to rescue Fido.”</p><p>So Peterkins led the way up alleys and across streets, the dolls all pattering along behind him. It was a strange procession. Once a strange dog ran out at them, but Peterkins told him to mind his own business and the strange dog returned to his own yard.</p><p>At last they came to the dog catcher’s place. Some of the dogs in the pen were barking at the moon and others were whining and crying.</p><p>There was Fido, all covered with mud, and his pretty red ribbon dragging on the ground. My, but he was glad to see the dolls and Peterkins! All the dogs came to the side of the pen and twisted their heads from side to side, gazing in wonder at the queer figures of the dolls.</p><p>“We will try and let you out,” said Raggedy Ann.</p><p>At this all the dogs barked joyfully.</p><p>Then Raggedy Ann, the other dolls and Peterkins went to the gate.</p><img src='https://xcx.mdavid.cn/img/s5d.jpg'></img><p>The catch was too high for Raggedy Ann to reach, but Peterkins held Raggedy Ann in his mouth and stood up on his hind legs so that she could raise the catch.</p><p>When the catch was raised, the dogs were so anxious to get out they pushed and jumped against the gate so hard it flew open, knocking Peterkins and Raggedy Ann into the mud. Such a yapping and barking was never heard in the neighborhood as when the dogs swarmed out of the enclosure, jumping over one another and scrambling about in the mad rush out the gate.</p><img src='https://xcx.mdavid.cn/img/s5e.jpg'></img><p>Fido picked himself up from where he had been rolled by the large dogs and helped Raggedy Ann to her feet. He, Peterkins, and all the dolls ran after the pack of dogs, turning the corner just as the dog catcher came running out of the house in his nightgown to see what was causing the trouble.</p><p>He stopped in astonishment when he saw the string of dolls in white nighties pattering down the alley, for he could not imagine what they were.</p><p>Well, you may be sure the dolls thanked Peterkins for his kind assistance and they and Fido ran on home, for a faint light was beginning to show in the east where the sun was getting ready to come up.</p><p>When they got to their own home they found an old chair out in the yard and after a great deal of work they finally dragged it to the window and thus managed to get into the nursery again.</p><p>Fido was very grateful to Raggedy Ann and the other dolls and before he went to his basket he gave them each a lick on the cheek.</p><p>The dolls lost no time in scrambling into bed and pulling up the covers, for they were very sleepy, but just as they were dozing off, Raggedy Ann raised herself and said, “If my legs and arms were not stuffed with nice clean cotton I feel sure they would ache, but being stuffed with nice clean white cotton, they do not ache and I could not feel happier if my body were stuffed with sunshine, for I know how pleased and happy Mistress will be in the morning when she discovers Fido asleep in his own little basket, safe and sound at home.”</p><p>And as the dollies by this time were all asleep, Raggedy Ann pulled the sheet up to her chin and smiled so hard she ripped two stitches out of the back of her rag head.</p><img src='https://xcx.mdavid.cn/img/s5f.jpg'></img>"}