{"title": "Raggedy Ann and the Strange Dolls", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s8a.jpg'></img><h2><a id=\"RAGGEDY_ANN_AND_THE_STRANGE_DOLLS\" name=\"RAGGEDY_ANN_AND_THE_STRANGE_DOLLS\"></a>RAGGEDY ANN AND THE STRANGE DOLLS</h2><p>Raggedy Ann lay just as Marcella had dropped her—all sprawled out with her rag arms and legs twisted in ungraceful attitudes.</p><p>Her yarn hair was twisted and lay partly over her face, hiding one of her shoe-button eyes.</p><p>Raggedy gave no sign that she had heard, but lay there smiling at the ceiling.</p><p>Perhaps Raggedy Ann knew that what the new dolls said was true.</p><p>But sometimes the truth may hurt and this may have been the reason Raggedy Ann lay there so still.</p><p>“Did you ever see such an ungainly creature!”</p><p>“I do believe it has shoe buttons for eyes!”</p><p>“And yarn hair!”</p><p>“Mercy, did you ever see such feet!”</p><p>The Dutch doll rolled off the doll sofa and said “Mamma” in his quavery voice, he was so surprised at hearing anyone speak so of beloved Raggedy Ann—dear Raggedy Ann, she of the candy heart, whom all the dolls loved.</p><p>Uncle Clem was also very much surprised and offended. He walked up in front of the two new dolls and looked them sternly in the eyes, but he could think of nothing to say so he pulled at his yarn mustache.</p><img src='https://xcx.mdavid.cn/img/s8b.jpg'></img><p>Marcella had only received the two new dolls that morning. They had come in the morning mail and were presents from an aunt.</p><p>Marcella had named the two new dolls Annabel-Lee and Thomas, after her aunt and uncle.</p><p>Annabel-Lee and Thomas were beautiful dolls and must have cost heaps and heaps of shiny pennies, for both were handsomely dressed and had real hair!</p><p>Annabel’s hair was of a lovely shade of auburn and Thomas’ was golden yellow.</p><p>Annabel was dressed in soft, lace-covered silk and upon her head she wore a beautiful hat with long silk ribbons tied in a neat bow-knot beneath her dimpled chin.</p><p>Thomas was dressed in an Oliver Twist suit of dark velvet with a lace collar. Both he and Annabel wore lovely black slippers and short stockings.</p><p>They were sitting upon two of the little red doll chairs where Marcella had placed them and where they could see the other dolls.</p><p>When Uncle Clem walked in front of them and pulled his mustache they laughed outright. “Tee-Hee-Hee!” they snickered, “He has holes in his knees!”</p><p>Quite true. Uncle Clem was made of worsted and the moths had eaten his knees and part of his kiltie. He had a kiltie, you see, for Uncle Clem was a Scotch doll.</p><p>Uncle Clem shook, but he felt so hurt he could think of nothing to say.</p><p>He walked over and sat down beside Raggedy Ann and brushed her yarn hair away from her shoe-button eye.</p><img src='https://xcx.mdavid.cn/img/s8c.jpg'></img><p>The tin soldier went over and sat beside them.</p><p>“Don’t you mind what they say, Raggedy!” he said, “They do not know you as we do!”</p><p>“We don’t care to know her!” said Annabel-Lee as she primped her dress, “She looks like a scarecrow!”</p><p>“And the Soldier must have been made with a can opener!” laughed Thomas.</p><p>“You should be ashamed of yourselves!” said the French dolly, as she stood before Annabel and Thomas, “You will make all of us sorry that you have joined our family if you continue to poke fun at us and look down upon us. We are all happy here together and share in each others’ adventures and happiness.”</p><p>Now, that night Marcella did not undress the two new dolls, for she had no nighties for them, so she let them sit up in the two little red doll chairs so they would not muss their clothes. “I will make nighties for you tomorrow!” she said as she kissed them good night. Then she went over and gave Raggedy Ann a good night hug. “Take good care of all my children, Raggedy!” she said as she went out.</p><p>Annabel and Thomas whispered together, “Perhaps we have been too hasty in our judgment!” said Annabel-Lee. “This Raggedy Ann seems to be a favorite with the mistress and with all the dolls!”</p><p>“There must be a reason!” replied Thomas, “I am beginning to feel sorry that we spoke of her looks. One really cannot help one’s looks after all.”</p><p>Now, Annabel-Lee and Thomas were very tired after their long journey and soon they fell asleep and forgot all about the other dolls.</p><p>When they were sound asleep, Raggedy Ann slipped quietly from her bed and awakened the tin soldier and Uncle Clem and the three tiptoed to the two beautiful new dolls.</p><p>They lifted them gently so as not to awaken them and carried them to Raggedy Ann’s bed.</p><p>Raggedy Ann tucked them in snugly and lay down upon the hard floor.</p><p>The tin soldier and Uncle Clem both tried to coax Raggedy Ann into accepting their bed (they slept together), but Raggedy Ann would not hear of it.</p><p>“I am stuffed with nice soft cotton and the hard floor does not bother me at all!” said Raggedy.</p><img src='https://xcx.mdavid.cn/img/s8d.jpg'></img><p>At daybreak the next morning Annabel and Thomas awakened to find themselves in Raggedy Ann’s bed and as they raised up and looked at each other each knew how ashamed the other felt, for they knew Raggedy Ann had generously given them her bed.</p><p>There Raggedy Ann lay; all sprawled out upon the hard floor, her rag arms and legs twisted in ungraceful attitudes.</p><p>“How good and honest she looks!” said Annabel. “It must be her shoe-button eyes!”</p><img src='https://xcx.mdavid.cn/img/s8e.jpg'></img><p>“How nicely her yarn hair falls in loops over her face!” exclaimed Thomas, “I did not notice how pleasant her face looked last night!”</p><p>“The others seem to love her ever and ever so much!” mused Annabel. “It must be because she is so kind.”</p><p>Both new dolls were silent for a while, thinking deeply.</p><p>“How do you feel?” Thomas finally asked.</p><p>“Very much ashamed of myself!” answered Annabel, “And you, Thomas?”</p><p>“As soon as Raggedy Ann awakens, I shall tell her just how much ashamed I am of myself and if she can, I want her to forgive me!” Thomas said.</p><p>“The more I look at her, the better I like her!” said Annabel.</p><p>“I am going to kiss her!” said Thomas.</p><p>“You’ll awaken her if you do!” said Annabel.</p><p>But Thomas climbed out of bed and kissed Raggedy Ann on her painted cheek and smoothed her yarn hair from her rag forehead.</p><p>And Annabel-Lee climbed out of bed, too, and kissed Raggedy Ann.</p><p>Then Thomas and Annabel-Lee gently carried Raggedy Ann and put her in her own bed and tenderly tucked her in, and then took their seats in the two little red chairs.</p><p>After a while Annabel said softly to Thomas, “I feel ever and ever so much better and happier!”</p><p>“So do I!” Thomas replied. “It’s like a whole lot of sunshine coming into a dark room, and I shall always try to keep it there!”</p><p>Fido had one fuzzy white ear sticking up over the edge of his basket and he gave his tail a few thumps against his pillow.</p><p>Raggedy Ann lay quietly in bed where Thomas and Annabel had tucked her. And as she smiled at the ceiling, her candy heart (with “I LOVE YOU” written on it) thrilled with contentment, for, as you have probably guessed, Raggedy Ann had not been asleep at all!</p><img src='https://xcx.mdavid.cn/img/s8f.jpg'></img>"}