{"title": "Raggedy Ann and the Faries’ Gift", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Dog,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/s10a.jpg'></img><h2><a id=\"RAGGEDY_ANN_AND_THE_FAIRIES_GIFT\" name=\"RAGGEDY_ANN_AND_THE_FAIRIES_GIFT\"></a>RAGGEDY ANN AND THE FAIRIES’ GIFT</h2><p>All the dolls were tucked snugly in their little doll-beds for the night and the large house was very still.</p><p>Every once in a while Fido would raise one ear and partly open one eye, for his keen dog sense seemed to tell him that something was about to happen.</p><img src='https://xcx.mdavid.cn/img/s10b.jpg'></img><p>Finally he opened both eyes, sniffed into the air and, getting out of his basket and shaking himself, he trotted across the nursery to Raggedy Ann’s bed.</p><p>Fido put his cold nose in Raggedy Ann’s neck. She raised her head from the little pillow.</p><p>“Oh! It’s you, Fido!” said Raggedy Ann. “I dreamed the tin soldier put an icicle down my neck!”</p><p>“I can’t sleep,” Fido told Raggedy Ann. “I feel that something is about to happen!”</p><p>“You have been eating too many bones lately, Fido, and they keep you awake,” Raggedy replied.</p><p>“No, it isn’t that. I haven’t had any bones since the folks had beef last Sunday. It isn’t that. Listen, Raggedy!”</p><p>Raggedy Ann listened.</p><p>There was a murmur as if someone were singing, far away.</p><p>“What is it?” asked Fido.</p><p>“Sh!” cautioned Raggedy Ann, “It’s music.”</p><p>It was indeed music, the most beautiful music Raggedy Ann had ever heard.</p><p>It grew louder, but still seemed to be far away.</p><p>Raggedy Ann and Fido could hear it distinctly and it sounded as if hundreds of voices were singing in unison.</p><p>“Please don’t howl, Fido,” Raggedy Ann said as she put her two rag arms around the dog’s nose. Fido usually “sang” when he heard music.</p><p>But Fido did not sing this time; he was filled with wonder. It seemed as if something very nice was going to happen.</p><img src='https://xcx.mdavid.cn/img/s10c.jpg'></img><p>Raggedy Ann sat upright in bed. The room was flooded with a strange, beautiful light and the music came floating in through the nursery window.</p><p>Raggedy Ann hopped from her bed and ran across the floor, trailing the bed clothes behind her. Fido followed close behind and together they looked out the window across the flower garden.</p><p>There among the flowers were hundreds of tiny beings, some playing on tiny reed instruments and flower horns, while others sang. This was the strange, wonderful music Raggedy and Fido had heard.</p><p>“It’s the Fairies!” said Raggedy Ann. “To your basket quick, Fido! They are coming this way!” And Raggedy Ann ran back to her bed, with the bed clothes trailing behind her.</p><p>Fido gave three jumps and he was in his basket, pretending he was sound asleep, but one little black eye was peeping through a chink in the side.</p><p>Raggedy jumped into her bed and pulled the covers to her chin, but lay so that her shoe-button eyes could see towards the window.</p><p>Little Fairy forms radiant as silver came flitting into the nursery, singing in far away voices. They carried a little bundle. A beautiful light came from this bundle, and to Raggedy Ann and Fido it seemed like sunshine and moonshine mixed. It was a soft mellow light, just the sort of light you would expect to accompany Fairy Folk.</p><p>As Raggedy watched, her candy heart went pitty-pat against her cotton stuffing, for she saw a tiny pink foot sticking out of the bundle of light.</p><p>The Fairy troop sailed across the nursery and through the door with their bundle and Raggedy Ann and Fido listened to their far away music as they went down the hall.</p><p>Presently the Fairies returned without the bundle and disappeared through the nursery window.</p><p>Raggedy Ann and Fido again ran to the window and saw the Fairy troop dancing among the flowers.</p><p>The light from the bundle still hung about the nursery and a strange lovely perfume floated about.</p><p>When the Fairies’ music ceased and they had flown away, Raggedy Ann and Fido returned to Raggedy’s bed to think it all out.</p><p>When old Mister Sun peeped over the garden wall and into the nursery, and the other dolls awakened, Raggedy Ann and Fido were still puzzled.</p><p>“What is it, Raggedy Ann?” asked the tin soldier and Uncle Clem, in one voice.</p><p>Before Raggedy Ann could answer, Marcella came running into the nursery, gathered up all the dolls in her arms, and ran down the hall, Fido jumping beside her and barking shrilly.</p><p>“Be quiet!” Marcella said to Fido, “It’s asleep and you might awaken it!”</p><img src='https://xcx.mdavid.cn/img/s10d.jpg'></img><p>Mamma helped Marcella arrange all the dolls in a circle around the bed so that they could all see what was in the bundle.</p><p>Mamma gently pulled back the soft covering and the dolls saw a tiny little fist as pink as coral, a soft little face with a cunning tiny pink nose, and a little head as bald as the French dolly’s when her hair came off.</p><p>My, how the dollies all chattered when they were once again left alone in the nursery!</p><p>“A dear cuddly baby brother for Mistress!” said Uncle Clem.</p><p>“A beautiful bundle of love and Fairy Sunshine for everybody in the house!” said Raggedy Ann, as she went to the toy piano and joyously played “Peter-Peter-Pumpkin-Eater” with one rag hand.</p><img src='https://xcx.mdavid.cn/img/s10e.jpg'></img>"}