{"title": "The Rescue of Fairy Queen Maeve", "author": "Deirdre McCarthy", "level": "3 to 5,6 to 8,9 to12,", "category": "Celtic,Fairy Tale,Illustrated,Irish,Original,Poem,", "tag": "", "length": "05 - 10 mins,", "body": "<p>High on an Oak tree one morning in June</p><p>A fairy queen sat and played a fine tune.</p><p>As she plucked on her harp strings an old Irish air</p><p>Her sweet lilting music was heard everywhere.</p><img src='https://xcx.mdavid.cn/img/Queen-Maeve-Fairy-Queen-Maeve-opt1.jpg'></img><p>Today was a day that she yearned to be free.</p><p>Far away from her kingdom she wished she could be.</p><p>Sometimes being queen, her patience was tested.</p><p>But after playing her harp she always felt rested.</p><p> </p><p>Unbeknownst to the queen hiding right down below</p><p>Was a creature in black with a face white as snow.</p><p>The creature was wearing a smile ear to ear</p><p>And the thoughts it was thinking were far from sincere.</p><p> </p><p>Before the queen knew it that Banshee appeared</p><p>And spread her black cloak and they both disappeared.</p><p>The queen was then taken to cliffs by the sea</p><p>And kept in a cave with the howling banshee.</p><p> </p><p>An hour or two passed till a search had begun.</p><p>The fairies looked everywhere under the sun.</p><p>They tried to imagine just where she would go</p><p>No queen could they find, though they looked high and low.</p><p> </p><p>The queen had been put deep into a trance</p><p>To endlessly play for the Banshee’s wild dance.</p><p>She strummed on her harp through that entire morn</p><p>While her fingertips blistered and bleeding were torn.</p><p> </p><p>The Banshee joined in with a horrible scream</p><p>And the poor fairy wished she could wake from her dream.</p><p>But she didn’t know then that back at the fort</p><p>The fairies had all gathered round to hold court.</p><p> </p><p>They agreed on a plan they knew what to do</p><p>They’d send for the leprechauns Owen and Hugh!</p><p>The duo were famous throughout fairyland</p><p>For their trickery deeds were greater than grand.</p><p> </p><p>They soon headed out to look for the queen</p><p>And first started searching the place where she’d been.</p><p>Which everyone knew was the Royal Oak tree</p><p>They hoped for a clue as to where she might be.</p><img src='https://xcx.mdavid.cn/img/Queen-Maeve-Spotting-the-oak-tree-opt.jpg'></img><p>As Owen looked round he scratched on his beard</p><p>Then through the damp leaves a small hedgehog appeared.</p><p>He waddled around him and sniffed at his shoe</p><p>And told him a hawk up the tree had a clue.</p><p> </p><p>Owen called out, “Can you please come down here?</p><p>This hedgehog said you saw the queen disappear.”</p><p>“Yes!” said the hawk. “She was with the banshee.</p><p>They vanished this morning from this very tree.</p><p> </p><p>I watched that dark spirit take her off to her Cave</p><p>And I’m sure if you go there you’ll find your queen Maeve.</p><p>So climb on my wings and I’ll take you right now.”</p><p>“We both thank you kindly,” said Hugh with a bow.</p><p> </p><p>“Be japers” said Hugh, “There’s a crow flying by</p><p>And I notice a very strange look in its eye</p><p>And though I’m not certain of what if could be</p><p>I wonder if that bird could be our banshee.”</p><p> </p><p>Well his hunch was correct for the crow turned around</p><p>And tried to knock Owen and Hugh to the ground.</p><p>It lunged at the hawk and pecked hard with its beak</p><p>“Stay away” shrieked the crow, “If the queens who you seek.”</p><p> </p><p>The banshee flew off as the hawk tried to land</p><p>“Well good luck if she thinks we’ll obey her command!”</p><p>Said Hugh, as he waved a goodbye to the hawk.</p><p>As he circled above them heading up the cliff walk.</p><p> </p><p>Hugh then asked Owen had he thought of a plan.</p><p>“Are you codding me? Course I have, silly young man!</p><p>First we’ve to find her, and then we’ll proceed</p><p>with her majesty’s rescue so stay close, take heed!”</p><p> </p><p>So the pair kept on looking and listening to hear</p><p>If the banshee or fairy queen somehow was near.</p><p>And deep in a cave the queen kept on strumming</p><p>While hoping and praying that someone was coming.</p><p> </p><p>“Do you hear that?” said Owen. “It must be the queen!</p><p>At least she’s alive, though she hasn’t been seen!</p><p>How do you suppose we’re going to get through</p><p>With this rock in the way, and only us two?”</p><p> </p><p>Then Hugh said “Let’s see if there’s a small little hole</p><p>And we’ll squeeze in and rescue her.  How’s that for a goal”?</p><p>“Oh you’re good, very good!” said Owen quite brightly.</p><p>“Well come then.” said Hugh, “Let’s go very quietly!”</p><p> </p><p>While the waves splashed below them the pair looked about.</p><p>Till Hugh spied a crack, “We’ll get through it, no doubt!”</p><p>So with pushing and shoving the pair did succeed</p><p>And they lowered themselves with pure leprechaun speed.</p><p> </p><p>The cave was in darkness except for one spot</p><p>And there sat the queen in the dampness and rot.</p><p>When the queen saw the boys she cried out, “Who are you?”</p><p>“Pleased to meet you your majesty, I’m Owen, he’s Hugh!</p><p> </p><p>We were hired by your subjects when they voted at court</p><p>To carry you safely back home to your fort.</p><p>So please can we leave here as quick as can be</p><p>Before the return of the wicked banshee?”</p><p> </p><p>But just then the Banshee returned to her cave</p><p>And Owen and Hugh did their best to look brave.</p><p>The Banshee howled out “There’ll be no rescue today</p><p>Since a spell has been cast only me she’ll obey!</p><p> </p><p>And now ye’ll pay dearly for acting so sly</p><p>Since you have all seen me prepare ye to die.”</p><p>But Owen recalled an old leprechaun spell</p><p>And lifted his arms and let out a yell!</p><p> </p><p>“Dul amach, dul amach Banshee dul amach</p><p>as an tirna anois, dul amach, dul amach.”</p><p> </p><p>A moment went by, and then Owen could see</p><p>That they were well rid of the wailing Banshee.</p><p>The spell was now broken and the queen jumped up free</p><p>And flew around the cave with her harp joyously.</p><p> </p><p>With the spirit now gone from her dark evil den.</p><p>The queen then gave thanks to the brave little men.</p><p>They quickly got out of that dark dreary cave</p><p>And returned to the fort of the jubilant Maeve.</p><p> </p><p>Now safe and set free the queen was delighted.</p><p>And the leprechaun heroes. Well, they became knighted!</p><p>And all was then well throughout fairyland</p><p>For Owen and Hugh did exactly as planned.</p><img src='https://xcx.mdavid.cn/img/The-lads-are-knighted-opt.jpg'></img><p>Now Fairyland’s back to its normal routine</p><p>And Maeve’s more content with her duties as queen.</p><p>And the fairies still talk of those leprechauns, brave,</p><p>And remember the rescue of Fairy Queen Maeve.</p><p>(C) Copyright Deirdre McCarthy</p>"}