{"title": "Rite of Passage", "author": "Rodney Page", "level": "6 to 8,9 to12,", "category": "Modern,Original,True,", "tag": "", "length": "10 - 15 mins,", "body": "<p>When I was about to turn thirteen, my dad had an epiphany. He had been watching a documentary about “Rites of Passage” and was appalled by the fact that there was very little of this ritual left in the world. So then and there he declared his sons would have this unique experience. At the time, our family business was a health club and gym so he thought a test of strength would be appropriate. Being naturally athletic, I jumped at the opportunity to test my strength and fitness to make the passage into manhood. Especially, since my younger brothers wouldn’t be old enough for at least eight more years! So one sunny Saturday morning, I was given the task of performing 250 push-ups and 500 sit-ups in an hour. I decided to alternate between the exercises and to my dad’s amazement I completed the challenge in only 21 minutes, a record my younger brothers will surely challenge, someday. The next morning was hockey day with my friends at the local rink. My slow movements, moaning, and groaning were enough to convince me dad knew something I didn’t. He said I had received the wound and pain all boys must endure as they enter into manhood.</p><p>My next test would be of courage and intestinal fortitude (his words) and to complete this I would need to draw on lessons I had experienced to this point in my short life. My dad enlisted some of his friends to help, Joe a retired Captain from the California Department of Forestry, and a Vietnam Purple Heart recipient embraced his plan with exuberance. Joe contacted an old friend at the Parks Service and made arrangements for us to use a fire line for our test. A fire line is a man-made break in vegetation to help slow wild land fires, it is not a marked trail and can be rather difficult to navigate. The stumps protrude from the ground up to six inches and usually are covered with ground vegetation, which will have begun to re-grow. Their plan was to have me begin at the bottom of the mountain and climb the 36-degree grade for the two and one-half miles to the summit.</p><p>I would be able to see the radio towers at the summit from different points along the fire line, which was my ultimate destination. I carried a canteen of water, knife, and compass for the adventure. Unknown to me was the fact, that my dad had walked the fire line and that we had set up our day camp where Joe could glass the entire fire-line. I walked with my dad over a mile from a locked gate to the fire-line entry point. I was certainly a bit apprehensive, because there was no trail to follow and although my dad and I had hiked 100’s of miles with me as the “leader”, he was still always there with me. I would later understand his reasoning for this; he told me to trust my gut feelings and believe in myself. He had his usual grin as he looked me in the eye and told me something that has rang in my ears many times since, “I believe in you, son!”</p><p>With my jaw set, I turned towards the mountain and took off up the steep incline. As I made the first ridge, I turned and yelled, “See you on top, pops”! I thought I saw him wiping his eyes, as I turned I wondered why would he be crying. I had time to think about our relationship and how much I looked up to him, he had been there for everything my whole life. He would take time off from work to help in my school classes and no dad throws a better pizza party! He never missed a track meet, football game or science fair.</p><p>I took a good look at the mountain and realized I could jog to the top. As I think back now, I question myself was I just being an over-achiever or was I a bit scared. At any rate I pulled off my jacket secured it around my waist and leaned into the mountain as I picked up my pace stopping only to check my bearings and start off again. The cool spring air felt fantastic against my skin and the recent rains had made the clean crisp scent irresistible to my lungs, I felt so alive! What seemed like only moments to me had been over a half hour and I found myself facing a mangled mass of boulders strewn about like some giant’s building blocks. I knew this was a likely place for rattlesnakes, so I carefully chose my path all the time hearing a familiar voice in the back of my head. I made the summit, only to find myself completely alone, yet not lonely at all. The view was magnificent; I could see Mt. Shasta to the north, Mt. Lassen to the east and the Central Valley sprawling at my feet.</p><p>I’m not sure if Joe and dad were late by design or if my running to the top caught them by surprise, nevertheless I enjoyed that time feeling exhilarated. I polished off my water and found the obscure dirt path that led toward the radio towers, that was our designated rendezvous area. To my surprise no one was there so I started down the winding dirt road wondering, where are they? I hadn’t made a half-mile when the familiar rumble of my dad’s van struck my ears, as they rounded the bend kicking up a dusty cloud of silt.</p><p>Joe was smiling uncontrollably as he asked me, “Well, how’d you like those apples?” My exuberance was overflowing as I recounted every step, both Joe and my dad smiling and nodding their heads in agreement. We drove back to the towers and walked out to the summit where I had soaked up the view earlier, my dad snapping pictures like we could possibly forget this view or this day. They resupplied me with more water and reiterated the specific directions for hiking on a steep downhill grade; drive your heel into the ground first. The reason for this is a cause and effect; it keeps your toes from being squished into the toe of your boot, which leads to painful blisters.</p><p>The gravity assisted descent would take even less time, I kept having these flashbacks as I passed certain landmarks on the trail. I was remembering where I had been and what I was thinking at the moment I passed these spots on the way up the mountain. Uphill and downhill perspectives are certainly not two peas in the same pod. As I made the last ridge, I could see the asphalt road snaking it’s way to the campground where my dad and brothers would be waiting for my return. As I popped out of the woods onto the road I was unexpectedly greeted with my dad’s grin and a giant bear hug. We walked back to the camp slowly as if we both wanted to extend this time together as he listened to my excited chatter about the other half of my journey. He didn’t tell me at the time, he waited until I was a grown man to share that our hug and walk helped him heal a lifetime of not knowing his own father.</p><p>When I returned to camp my two younger brothers were fishing lakeside with an old fire fighter, Ron has been fighting wild land fires since the time of the Romans. He is a grizzled old warrior who seemingly melts like butter when my brothers and I come for a visit. He and Steve a high school teacher, Mike a successful businessman, and Gene a retired Human Resources director have all arrived to participate in this event. They have all agreed to take different character traits i.e. courage, humility, faithfulness, honesty, integrity etc. and expound on these with me, one on one. Man to Man. As I greeted each and thanked them personally for coming, I realized I was starving!</p><p>The grill had been fired up and meat was roasting. We all had a meal together; it seemed to me each man was contemplating what he would say to this newest member of the man clan. Each man as agreed sat with me, some placing a hand on my shoulder and shared the wealth of knowledge they had accumulated in their lives. When each man had his turn, I turned to my dad and said I am ready and with an emotional undertone he stood in front of me and gave his speech.</p><p>“Son, today you have embarked on a journey that no one can sway you from. I too walked that fire-line a week ago, not to make sure it was easy or safe, but so I could say what it is that I want to share with you today. You walked a path today, and even though I have walked it before as these other men have, you did not follow in our footsteps; you forged your own path. There are many ways to handle problems in life, only yours is right for you. My son be resolute in your convictions and compassionate in your dealings and a life filled with happiness will be your reward.” It’s as if he knew that this journey would serve me many times in my lifetime.</p><p>The story doesn’t end here; life is funny that way sometimes. It was about a month later, when a family friend called my dad to ask if we could attend a Spiritual convention in San Francisco. A tee shirt design that he had made was gifted to the woman leading the summit. She was from India and had requested a personal audience with my dad and us boys. My dad accepted the invitation, as this would surely be an exciting adventure to add to our memories.</p><p>When we arrived at the hotel, we were told it would be several hours before we could be seen. We were seated in the hotel dining area overlooking the terraced courtyard, when a very well dressed middle-aged man approached our table and began to speak to my brothers and myself. He introduced himself simply as Ron Parris, security manager. He remarked to my dad, “I couldn’t help but notice these fine young men sitting so politely, I am sure they must play sports.” Naturally, this opened the door for us boys to begin an in-depth recounting of football, basketball, and hockey stories. This man must be a Dad!</p><p>It was during the course of the conversation; Mr. Parris mentioned that he had served in the Marine Corps. I quickly responded with a smile, so did my Dad. So, Ron and my dad quickly fell into that comfortable conversation that always seems to happen when former Marines meet each other. Ron had proudly served during the Vietnam era, and he in a typical undertone that all great men have stated he was wounded and sent home – “They gave me a medal and called me a Hero.” I could tell from his eyes there was much more to the story. We would get the pleasure of hearing it later in the evening. My dad was able to share the story of my recent Rite of Passage experience with Mr. Parris before our food arrived.</p><p>After our meal, the attendant who came to escort us to have our audience with Ma found us talking with Mr. Parris again. Our meeting with her was brief, but enlightening and we agreed exotic and adventurous. Upon leaving, we met Mr. Parris in the hallway; he invited us on a tour of the facility especially a visit to the exercise room. As we were walking to the pool, Mr. Parris had questions about the Rite of Passage and how it came to be. He was most interested in the proposition of getting to have a turn, as did the other men. He asked for my and my dad’s permission, which I thought, was a wonderful symbol of his respect. My dad asked him before you get started I would like to know what was the medal you were awarded? It was at this moment his eyes met my dad’s as they had in the dining room; the intensity of his gaze answered the question before his words could reach our ears. He straightened up and with his shoulders back and head held high, he said “The Medal of Honor.” My dad smiled and simply said, “Boys, this is a real American Hero!”</p><p>This is what a real Hero looks like, not Superman or Spiderman. This man unselfishly sacrificed so others could be alive today. Mr. Parris very casually responded that anyone would have done the same thing and to this my dad quipped not true! I looked at Mr. Parris and said, “I would be honored to listen to your speech, sir.” He began with courage and methodically went through every character trait that had been covered by the other men. If my dad could have arranged this it couldn’t have been a more perfect scenario. We all too soon had to say our good-byes and begin our long ride home.</p><p>I was a non-stop flurry of talking for over an hour. Then I finally took a breath and looked at my dad and asked him, “You know what the most impressive thing about all of this is?”</p><p>“What’s that son?“</p><p>“Dad you knew everybody else and could have coached them on what to say to me. Today, you met Mr. Parris for the first time, as did I. He repeated many of the same things the other men spoke about, but he also mentioned something that is very important to me; how much you love me! Thanks for being my Dad I love you!” With this said I fell into a deep sleep leaving my dad to his thoughts.</p><p>I often hear how men can’t or don’t know how to be nurturing, and I couldn’t disagree more. Men nurture differently, after all we are different, we are not women. The gift of self-respect and confidence my dad instilled in me and my brothers’ is as important as any hug he gave us through the years. He would later tell me that in this one serendipitous meeting, I had grasped the most important lesson of all, that love is the most powerful force in the universe. I think he is right, again.</p>"}