{"title": "Rosie O’ Sullivan’s Adventure", "author": "Deirdre McCarthy", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Horse,", "length": "10 - 15 mins,", "body": "<p>Not too long ago on a bright moonlit night, young Rosie O’Sullivan was in her bedroom reading a very exciting Nancy Drew book.  It was well past midnight when all of a sudden a peaceful calm feeling washed over her and she began to feel light as a feather.  Next thing she knew she was rising up off her bed and floating across her room.  She dropped her book on the windowsill and then flew out through her open window.  She didn’t feel a bit scared at all.  It felt as natural to her as if she had been doing it her whole life.  Up she flew over the chimney tops.  She knew she couldn’t be dreaming because she pinched herself, and felt it!</p><p>“Ha-ha you can’t see me,” she thought to herself, as she floated past two guards walking their beat beneath her.  At the top of the street she saw Mrs. O’Brien’s cat, Ruby, suddenly dart across the street and disappear under the gate of the blacksmith’s forge. Not another soul was out and about. The rest of the world seemed to be cozy in their beds asleep.</p><p>It wasn’t long before she found herself far out in the countryside.  The moon was so bright that night she could clearly see all around her.  Below her she spied dozens of sheep nestled together in clusters and a few cows were huddled under the bushes by one of the stone walls.  Then a beam of light shone its brightest on him.  He was tall, dark and four legged!  He was the most beautiful horse Rosie had ever seen.  He looked just like Black Beauty, one of her favourite book characters.  It seemed that he was standing there under a sycamore tree just waiting for Rosie to ride him.  So she floated down just above the ground and tip-toed to a gentle landing several feet from him.  She slowly began to walk toward the horse.</p><p>Rosie always, always wanted a horse.  She lived in the city around the corner from the farmer’s market where she could have bought hay for a horse, that is, if her mother would ever let her get one!  And up the street there was even a blacksmith!  Then to top it all off, didn’t her back yard have cobblestones in it with stables that could hold three or more horses?  Her home was over two hundred years old.  Someone had horses there years ago.  Yet still her mother always said, “No!”  But now, here was her chance to ride this beautiful stallion.  His shiny coat glistened in the moonlight.</p><p>“Can I get on your back?”  she softly said to him.  Slowly reaching into the pocket of her pajamas she pulled out a hard sweet that was stuck in there from earlier.  She placed it in the middle of her hand and ‘Beauty’ bent his neck down and tickled Rosie’s palm with his lips as he took it from her.  She gently patted his neck and stared into his beautiful big eyes as he crunched away.  She could see the reflection of the moon staring back out at her.</p><p>“Now don’t you move,” she told him. “I’m going to get up on your back, so be a good horse for me, will you?”</p><p>She took a hold of his mane and stretched her leg up as high as she could, but she slipped down to the ground.  She tried once more but still she couldn’t get up on him.  It wasn’t as easy as she had thought.  Then finally she did a running jump and wouldn’t you know, third time lucky, she effortlessly flew up onto his back.</p><p>“Why didn’t I do that the first time?” she thought.  She had forgotten she could fly.  “Giddy up there,” Rosie said as she gripped his mane tightly with both hands.  She tapped her bare feet against Beauty’s belly a few times, trying to send him the message that she wanted him to move.  Beauty walked off slowly at first, and then gradually went into a trot.  Rosie was so proud of herself for doing so well.  With the wind at her back, her long black hair kept blowing onto her face preventing her from seeing where she was going.  She didn’t care!  She was feeling so free now.  She trusted the horse knew where he was going.</p><p>Rosie was beaming from ear to ear.  This was turning out to be the most exciting night of her life.  The horse began to canter across the field.  Before long the horse went into a gallop scattering a flock of sheep sending them in all directions.</p><p>Suddenly out of nowhere, a stone wall appeared in front of them.  All she could do now was close her eyes tight and grip on for dear life.  She felt her stomach quickly rise as Beauty sailed over the wall.  Then her stomach sank with a thud as they landed.  “Phew that was close,” she said then inhaled deeply. She opened her eyes and found herself laying half way up the neck of the horse with her arms wrapped tightly around him.</p><p>Rosie then became aware of a sign in front of her said in big capital letters, NO TRESSPASSING ALLOWED.   “OH NO! That’s not good,” she cried! “I better get out of here quickly!”  Rosie bent down and kissed Beauty on the neck.  “I think I’ve had enough of an adventure for one night!”</p><p>“Thanks a million for letting me ride you, Beauty,” Rosie said as she slapped him fondly on the side of his neck.  She wished she could take him home with her. “Good bye, Beauty I have to go now.” Rosie stared into his eyes once more.  “But I’ll never forget you!”</p><p>Rosie hoped the magic would work again to get her home.  Being hopeful she turned and ran with her arms outstretched to the center of the field and it only took a few steps before she lifted off the ground and was once more soaring high above the trees.  She was afraid to wave to her friend below in case she wobbled a bit and would lose her balance.  It was wonderful to be able to fly but she didn’t want to fall to the ground. Rosie circled around once then headed back towards the city lights.</p><p>She was so wrapped up in the magic of the evening that she forgot to pay attention to where she was going.  Beginning to feel scared she realized she had flown way past the city center, so she turned around and came back down a few more streets until she saw the clock tower that was just one street over from hers.  It was so nice to see her home come into view. Rosie was soon back home and flew in her open window which was on the third floor.  She landed softly on top of her bed.  She couldn’t go to sleep just yet, so she went over to the window sill and picked her book up off the floor.  It had been left there when she flew out the window earlier.  She sat for a minute on the window sill just staring up at the man in the moon. She gave him a big wink.</p><p>“Do I have you to thank for my big adventure this evening?” she smiled. Rosie couldn’t believe she just flew around out there in the night sky.  She hopped back on her bed and dove under the covers with her book.  She never got to read a single word and fell fast asleep.</p><p>When Rosie woke up the next morning her thoughts went immediately to the night before.  “It couldn’t have been a dream; it just had to have been real.”   She jumped out of bed and threw on some jeans and a shirt then ran downstairs two at a time to have her breakfast.</p><p>Rosie found herself smiling as she ate her porridge.</p><p>“What’s up with you this morning?” her mother asked.  “You usually are making all sorts of nasty looking faces while you eat your oatmeal.”</p><p>“Oh, I was just thinking I’d love to go horseback riding sometime!” Rosie replied.</p><p>“Oh you were now were you?”   Rosie’s mother said as she peered over the top of her reading glasses. “Now I don’t want to hear you asking me for a horse again this morning or ever again for that matter, but if its lessons you want, we’ll see!”</p><p>Her mother went back to reading the morning paper.  She turned page after page until she suddenly said “Ah ha, here’s what I was looking for!  Horse Riding Lessons available at ‘Fedamore Stables.’  They don’t come cheap young lady, and you could fall off a horse and break your neck!”</p><p>“Really, mum? You really mean it? I can go horse riding sometime?” I promise I will stop asking you for a horse.  I know that a horse needs lots of space.  The city is no place for a horse, you are so right mum!”</p><p>“Well young lady, you are finally growing up,” her mother said smiling.  “Now would you kindly go into the bathroom and brush your hair?  It looks an absolute mess this morning!”</p><p>“Yes mum.” Rosie replied.</p><p>Later on that evening Rosie got ready very early for bed.  She went into the kitchen and found a nice crunchy carrot and stuck it up her sleeve just in case she happened to go on another adventure.  She found her parents in the sitting room enjoying a cup of tea so she kissed them both good night and told them she was off to bed for she couldn’t wait to find out what happened at the end of her book she was reading.</p><p>Rosie looked out her window to see what kind of night it was like.  She was delighted to find it was another clear moonlit night.  Then into bed she went and just laid there trying to read the same page over and over.  It was useless.  She couldn’t read her book. “Last night was a magical night I wonder if it will ever happen to me again,” she thought.  Rosie tossed and turned for what seemed like hours.</p><p>Suddenly she got an idea so she hunted around her room for some notepaper and a pen.  She said down at her dressing table and began to write:</p><p>Rosie put the letter in an envelope and licked it closed.  Then she shoved it deep into the pocket of her pajamas.  She went back to bed and just laid there waiting….and waiting…..</p><p>Then suddenly, just like before, she felt a weightless feeling wash over her and she knew it was time to rise up out of bed.  The magic was happening again.  Out through the window she flew.  Rosie didn’t waste any time.  She knew exactly where she was heading.  Soon the lights of the city were behind her and before she knew it she found the field where the sycamore tree stood in the center of the field.  Beauty was waiting for her just like the night before.  She spied a hay stack and landed on it, then slid down to the ground.  Rosie walked over to Beauty and pulled out the carrot from up her sleeve.  While he munched on it Rosie whispered something in his ear.  Then she gingerly crept on tip toe to the front door of the farmer’s house and quickly slid something into their letter box.  Then off again home she flew.</p><p>She was very tired the next morning from being out late two nights in a row.  Sitting there eating her breakfast the phone began to ring and her mother answered it. Rosie couldn’t help but overhear.</p><p>“Yes, this is Mrs. O’Sullivan.”  Then came a long moment of silence.</p><p>“Uh huh, yes, my daughter is interested in taking horse riding lessons.  Thanks for calling me back.  Her name is Rosie. Fedamore Stables, Co Limerick.  That’s next Saturday at two o’clock.  The first lesson is free you say?  That’s great!  Your number is 42409.  Yes, I will let you know if she can’t come.  Thank you so very much.  Goodbye!”</p><p>Rosie all this time was sitting on her hands trying to act calm and collected.  When her mother finally got off the phone she sat down next to Rosie and told her that her first horse riding lesson would be next Saturday morning.</p><p>“One free lesson is a pretty good deal, I’d say!”</p><p>Rosie jumped up and hugged her mother real tight for the longest time.</p><p>Saturday couldn’t come quick enough for Rosie.  She kept trying on outfits that she thought would best suit for horse riding.  She ended up wearing her favourite brown polo neck jumper with the diamond design across the top and her chocolate corduroy pants.  She went to her big sisters room and asked to borrow her cowboy boots.  She had to promise to do the dishes that night in payment!  They were a little big for Rose but she didn’t care.  She brushed her hair back into a pony-tail to make sure her hair wouldn’t blow onto her face.  She was all set.</p><p>The drive out was painfully slow.  The traffic was moving at a snail’s pace.  It seemed like forever before they came to the place.  A black wrought iron sign hung out from the stone wall that said, Fedamore Stables. Up the drive they went.  They passed flocks of sheep and a few cows grazed lazily about.  Her mother parked the car and as they got out, a lady came up to greet them.</p><p>“Oh you must be the O’Sullivans,” she said.  “I’m Mary O’Connor and I’ll be giving Rosie her lesson.”</p><p>“Pleased to meet you Mrs. O’Connor,” Rosie’s mother replied as she reached out to shake hands.</p><p>“Mrs. O’Sullivan you can come back in an hour.  We have a lot of work to do, don’t we Rosie?”</p><p>“Thanks very much Mrs. O’Connor.  Rosie, make sure you do what you are told!” Rosie’s mother said. Then she turned and walked back to her car and drove away.</p><p>They walked towards the stables and Mrs. O’Connor stopped just before they went in and said, “Rosie, after I spoke with your mother on the phone the other day I reread a very interesting note that had been slipped into my letterbox.  Then I put two and two together.  Now I’d like to introduce to you to Chieftain.”</p><p>Then she opened the stable door and there, to Rosie’s amazement, stood ‘Beauty!’</p>"}