{"title": "Rudolph the red-nosed reindeer", "author": "Dulce Rodrigues", "level": "3 to 5,6 to 8,9 to12,", "category": "Christmas,Classic,True,", "tag": "Reindeer,", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Rudolphs-face.jpg'></img><p>The story of the red-nosed reindeer Rudolph appeared around Christmas 1939. It was written by Robert May, an employee in the advertising department of Montgomery Ward stores at Chicago, and illustrated by Denver Gillen.</p><p>The story booklet was distributed by Santa at the stores; it was a best-seller and more than 2.4 million copies were given away that Christmas. The original name of the reindeer was Rollo, but May’s boss did not like it, and the name Rudolph came from the author’s young daughter.</p><p>Ten years later, Robert May asked his brother-in-law Johny Marks, who was a composer, to make a musical version of the story. It had again a great success and is second only to “White Christmas” in popularity.</p><p>Now, let me share the story with you. As you may remember, Santa’s sleigh is pulled by eight reindeer, whose names are Dasher, Dancer, Prancer, Vixen, Comet, Donder, Cupid, and Blitzen. But there is also a ninth reindeer… the youthful Rudolph.</p><p>Contrarily to what is generally believed, Rudolph was neither one of Santa’s reindeer nor the offspring of one of his reindeer. Rudolph did not live with Santa’s reindeer either. Instead, he lived in a reindeer village somewhere else, and Santa caught sight of Rudolph’s nose quite by accident. When delivering presents to Rudolph’s house, Santa noticed the glow emanating from Rudolph’s room! Rudolph had indeed a very shiny nose, and if you ever saw it, you’d even say it glowed. All of the other reindeer used to laugh at Rudolph and call him names, and they never let poor Rudolph join in any reindeer games.</p><p>With his red nose, Rudolph was however capable of seeing through the  thick fog. So one foggy Christmas Eve, worried that the thickening fog could be the cause of an accident or delays and would keep him from completing his Christmas Eve rounds, Santa came to Rudolph and said: Rudolph, with your glowing nose, won’t you come and lead my sleigh tonight?</p><p>Rudolph immediately agreed to lead Santa’s sleigh. But Rudolph was a responsible reindeer with a good self-image and sense of worth, so before leaving he stopped to write a note for his parents.</p><p>The luminosity of Rudolph’s nose was so great that it illuminated the team’s path through the foggy night, and Santa’s task could safely be accomplished. The young red-nosed reindeer was very proud of himself! And he was finally treated better by his fellow reindeer for his heroism. All the reindeer loved him, and shouted out with delight: Rudolph the red-nose Reindeer, you’ll go down in history!</p><img src='https://xcx.mdavid.cn/img/Rudolp-pulling-sleigh.gif'></img>"}