{"title": "Sally Mae Jones and the Ferris Wheel Ride", "author": "Sharon Krager", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/girl.jpg'></img><p> Sally Mae Jones stood head and shoulders above all of her friends. Her red hair and freckles make her stand out in a crowd. Sally Mae had a heart as big as Texas and at this time of year, she had only one thing on her mind. The Farrow County Fair was opening in two days, and she had her mind made up that this year she was taking a Ferris wheel ride.</p><p>Each year she had been too afraid to ride it, but not this time. She had saved her allowance for weeks to get to go to the fair. All of her friends were going on Saturday and she was not going to be left out.</p><p>Sally Mae knew when she got to the top of that big bright lit up wheel that she would be able to see as far as the whole world. She had been on the merry go round, the tilt a whirl, and the scrambler, but never the Ferris wheel.</p><p>Saturday came and all day long Sally Mae Jones was busy picking out what clothes to wear. She called all of her friends and made sure everyone knew where to meet when they got to the fair. Sally Mae put her long red hair in pig tails and put on her brand new shoes. Everyone in the family piled in the car to go to the fair.</p><p>Her excitement was overflowing by the time she got there. Sally Mae found all of her friends just where they said they would be.</p><p>Butterflies filled her stomach as they reached the line for the Ferris wheel ride. The closer they got to the front of the line the more butterflies there were, but she was not about to chicken out now. This was what she had waited for since last summer. At that time she had not been able to go through with it. This year was different and there was no backing out now.</p><p>Then it came time for her and her best friend Julie to get on. She looked straight up to the top of the wheel as she sat down in the seat. The bar was placed in front of them and a sharp click was heard. She closed her eyes and held her breath as the wheel began to move. What a feeling this was. All of her friends got on two at a time until they were all on board. The lever went forward and away they went backwards, then up, then forward and down. The swift breeze made Sally Mae’s pig tails fly straight out in back of her. She held on tight to the bar in front of her and as she came up to the top she looked around and sure enough, she could see the whole world. There it was just as she had imagined it would be. There were trees, the people and fields as far as she could see .The butterflies were still there, but for a different reason. As the wheel went round and round, she waved to people she knew that were standing near.</p><p>She knew that every year when the fair was open, she would be in line for the most incredible Ferris wheel ride.  After the ride was over, she had decided that this was the best day ever for Sally Mae Jones.</p>"}