{"title": "Sammy and Pittu", "author": "Srijaya Char", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Cat,Dog,", "length": "01 - 05 mins,", "body": "<p>Sammy felt lonely. He seemed to be the only dog in that small area. He felt that he had no friends.</p><p>There was one named Pittu close by, but it was a cat. Sammy was not the fighting type he wanted to be friends with Pittu. Pittu’s owners were wary of Sammy.</p><p>One evening, Sammy saw Pittu searching for something. He immediately took this opportunity and picked up one of the bread slices that was given to him by his master’s daughter Minti, and went a little near Pittu and dropped it at a distance and came back to his kennel. Pittu looked at Sammy and hesitantly picked up the slice with one eye on Sammy to see if he came to attack him. When he saw Sammy wagging his tail giving him a smile (which only animals can understand), Pittu realized that Sammy was a friend and not an enemy.</p><p>Sammy started giving Pittu something or the other to Pittu going closer to him. Rinki, was just seven years old and she kept observing this from her balcony. She could realize that Sammy and Pittu had become friends.</p><p>When she told her mother the mother was aghast.</p><p>“A dog and cat? The dog might bite the cat any day,” she said.</p><p>As both parents were working and the girl had her vacation she was witness to a lot of nice things that were happening between the two animal friends.</p><p>She would see both of them sharing something or the other every day. The cat would bring a piece of bone in exchange for a piece of meat from the dog. The cat would hide behind a bush and the dog would search for him. There was never any fight.</p><p>She narrated the incident to her parents in the evenings,.</p><p>“Minti, you need to be careful. Animals are animals. They may not be friends all the time,” they said.</p><p>She had her own thoughts.</p><p>‘We human beings are the ones that are always fighting with each other and the adults have coined a saying “Don’t fight like cats and dogs!” But they are so sweet and friendly.’</p><p>One Sunday, Pittu got lost. Rinki came running to Minti to tell her that she could not find her cat. Both of them started searching. Rinki was a bit worried that Sammy could be the culprit.</p><p>‘Minti, do you think that Sammy could have frightened Pittu from the area?’ she asked.</p><p>“He is so fond of him. Why would he do it? We need to find him before our parents come home. Otherwise they are sure to blame Sammy.”</p><p>It was a Sunday. Minti and Rinki started the search going around all the places near about the areas. Suddenly, they heard Sammy barking loudly; both of them ran to the place and found Pittu caught in a trap of net near a fence.</p><p>Minti and Rinki looked at each other. Pittu was meowing loudly to be let free. The children went home and brought their parents with some ropes and knives to free Pittu.</p><p>The parents worked hard and freed Pittu. Later they appreciated the children for their good deed.</p><p>“Yes, we were wrong. The children have a better sense,” they said.</p>"}