{"title": "Santa Claus is Jewish!", "author": "Wendy Lee Klenetsky", "level": "3 to 5,6 to 8,", "category": "Christmas,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Sandra Klein was playing with her 3 five-year-old friends in her family’s playroom, one snowy winter’s night.</p><p>“Sandra”, her friend Kim said,” how come your house isn’t decorated for Christmas?  You don’t even have your TREE up yet!”</p><p>“Yeah”, said Judy, “you don’t even have MISTLETOE hanging over your doorway or pretty tinsel on your windows, or nothin’.”</p><p>“Maybe your Mommy and Daddy don’t have enough money,” Tammy suggested.</p><p>“No, that’s not it. My Mommy and Daddy have the SAME amount of money YOUR Mommies and Daddies have”, Sandra answered. “We just don’t BELIEVE in Christmas like you; that’s all…”</p><p>“How come?” they all asked. “EVERYBODY believes in Christmas. You’re just being silly, Sandra.”</p><p>“I AM NOT!” Sandra protested in a loud voice.”Mommy and Daddy and Me are JEWISH!  We have our OWN kind of Christmas. It’s called ‘CHANUKAH’ and we have lights and presents, too. So don’t tell me I’m being silly.  My holiday is JUST as nice and special to me as yours is to you”, stated Sandra proudly.</p><p>“Well, YOUR holiday doesn’t have a SANTA CLAUS, does it?,” Kim asked with a little sly grin.</p><p>“No it doesn’t, Kim”, said Sandra, “but the teacher said that SANTA CLAUS is a friend to EVERYBODY; he’s EVERY RELIGION AND EVERY COLOR. He doesn’t just give presents to good girls and boys who only celebrate Christmas.”</p><p>The girls all thought about what Sandra had said, looked at each other and then looked at Sandra, and, in one voice said” Well, if that’s true, we guess you could say that SANTA CLAUS IS JEWISH!”</p><p>Then they all sat down together and continued playing their games; friends once again…..</p>"}