{"title": "Santa’s Helpers", "author": "Jim McCarthy", "level": "3 to 5,6 to 8,", "category": "Christmas,Fairy Tale,Folk Tale,Original,Poem,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Way up in the North Pole lives Santa, of course.</p><p>And there in his workshop is Santa’s workforce.</p><p>They’re nine little elves who work hard every day.</p><p>Creating the treasures that fill Santa’s sleigh.</p><p> </p><p>There’s Fricky and Flim-Flub, Gulbert and Flux,</p><p>Clotworthy, Glibberstein, Walworth and Snucks.</p><p>But the littlest elf is the star of the show.</p><p>He’s everyone’s favorite, Billy Bo-Bo.</p><p> </p><p>Now, Billy Bo-Bo is a great friend to all,</p><p>With so many good friends, gigantic and small.</p><p>He chats with the penguins and talks to the whales.</p><p>He visits the walruses, dolphins and snails.</p><p> </p><p>They’re very good friends and there’s so many more.</p><p>That live in the sea and along the seashore.</p><p>Yet none of the other elves ever have seen,</p><p>His two very best friends, Pu-nor and Mu-keen.</p><p> </p><p>Each day Billy visits these mystery friends.</p><p>Who live by the sea where the great river ends.</p><p>He jumps on his skis and then scurries away.</p><p>When his work is all done at the end of the day.</p><p> </p><p>Some elves say they’re sea lions, some think that they’re birds.</p><p>Some say that they’re creatures that run in great herds.</p><p>But Billy just chuckles at their guessing games.</p><p>His friends are a secret, except for their names.</p><p> </p><p>One gray autumn day Santa said to his elves,</p><p>“I’m going away; you’ll be all by yourselves.</p><p>I’m taking the sled dogs and Mrs. Claus too.</p><p>So watch over things, I’m depending on you.</p><p> </p><p>We’re visiting Inuit friends far away.</p><p>And won’t return home for the rest of the day.</p><p>If all goes as planned we should be back by nine.”</p><p>“Don’t worry,” said Snucks. “The workshop will be fine.”</p><p> </p><p>But not very long after Santa went out.</p><p>The workshop was disturbed by a terrible shout.</p><p>“The wolves have returned!” Fricky said with great fright.</p><p>“And Santa won’t be back until late tonight!”</p><p> </p><p>“Oh dear me,” said Walworth, his face turning blue.</p><p>“With Santa away, what on earth will we do?”</p><p>“Quick, let’s take a roll call,” Clotworthy then said.</p><p>So they stood side-by-side for a count of each head.</p><p> </p><p>There was Fricky and Flim-Flub, Gulbert and Flux,</p><p>Clotworthy, Glibberstein, Walworth and Snucks.</p><p>But at once, in a panic, they searched high and low</p><p>For, one elf was missing,…..Billy-Bo Bo!</p><p> </p><p>Then they looked out and saw those wolves darting around.</p><p>And their terrible howls made a bloodcurdling sound</p><p>As they rushed toward the barn where each one of them tried</p><p>To get to the terrified reindeer inside.</p><p> </p><p>And since reindeer only can fly in December</p><p>They couldn’t escape on that day in November.</p><p>And all they could do was to frantically wait</p><p>And hope Santa Claus wouldn’t get there too late.</p><p> </p><p>The wolves knocked and kicked at the wobbly barn door.</p><p>They gouged and they pulled and they rammed and they tore</p><p>While the reindeer inside the barn gathered in fear</p><p>And desperately wished Santa soon would appear.</p><p> </p><p>But then, all at once, with a twist and a sway</p><p>The tattered and flimsy old barn door gave way.</p><p>And the wolves stepped inside and they howled with delight</p><p>As the poor terrified reindeer trembled with fright.</p><p> </p><p>Then Fricky cried out, “We must do something now!</p><p>We’ll fight and we’ll rescue the reindeer somehow!”</p><p>So he pulled out a log from the fireplace and dashed</p><p>To the barn where he swung and he stabbed and he lashed.</p><p> </p><p>And each of the other brave elves did the same.</p><p>And the wolves became startled, in fear of each flame.</p><p>But slowly they crept and began to draw near</p><p>To the elves who had clustered together in fear.</p><p>Then, little by little, the torches grew weak</p><p>And the largest wolf grinned and he started to speak.</p><p>“My brave little friends,” he said, “There is no doubt</p><p>That the flames in your small torches soon will go out.</p><p> </p><p>And when they do, my little friends, have no fear</p><p>That many more, just like us, soon will be near.</p><p>For word will be sent from the west to the east</p><p>Inviting all wolves to our reindeer-elf feast.”</p><p> </p><p>Then all of those evil wolves started to howl.</p><p>And soon the elves heard other wolves on the prowl.</p><p>For their horrible shrieks were heard mile after mile</p><p>And the head-wolf looked on with his sinister smile.</p><p> </p><p>His mouth watered as he admired his prey</p><p>While the flames, one by one, slowly faded away.</p><p>And soon the last torch flickered out and was gone.</p><p>And the poor elves all feared that they’d seen their last dawn.</p><p> </p><p>They stood and they clung to each other in fear.</p><p>As the dreadful wolves started to slowly draw near</p><p>They howled and they slobbered while slowly they crept.</p><p>Then little by little, more quickly they stepped.</p><p> </p><p>And then, in a frenzy, they started to charge</p><p>Led on by the head-wolf, whose teeth were so large.</p><p>They were inches away with their mouths opened wide…..</p><p>When the sound of a distant horn came from outside.</p><p> </p><p>The wolves stopped at once as they heard that faint sound.</p><p>And the evil head-wolf turned himself all around.</p><p>Then he peered at a group that was now drawing near.</p><p>And suddenly he began howling with fear.</p><p> </p><p>For there, on his skis, was the small missing elf</p><p>Who had come to the rescue, but not by himself.</p><p>Alongside of Billy Bo-Bo could be seen</p><p>His two very best friends, Pu-nor and Mu-keen.</p><p>The elf had been visiting his secret friends</p><p>Far away, by the sea, where the great river ends.</p><p>When suddenly they’d heard the wolves’ distant cry.</p><p>And the three friends took off in the wink of an eye.</p><p> </p><p>And now Billy’s mystery had become clear</p><p>As everyone saw the three friends drawing near.</p><p>And the wolves became frozen with petrified stares.</p><p>Billy’s mystery friends were two great polar bears!</p><p> </p><p>Then the two bears let out with great deafening roars</p><p>That shook up the mountains and rocked the seashores.</p><p>And the wolves slipped and tripped and collided as they</p><p>Very desperately tried to get far, far away.</p><p> </p><p>For they knew, against polar bears, they were no match</p><p>For even their sharp teeth would not make a scratch.</p><p>So they fled from the North Pole, the whole dreadful pack.</p><p>And everyone knew they would never come back.</p><p> </p><p>Then just before nine o’clock Santa returned</p><p>And shook with surprise and great joy when he learned</p><p>All about the elves’ valor when he was away</p><p>And declared a great party be held the next day.</p><p> </p><p>And many friends came, some from far, some from near</p><p>To hear of the rescue of Santa’s reindeer.</p><p>And the great honored guests were Pu-nor and Mu-keen.</p><p>And next to the great bears, nine elves could be seen.</p><p> </p><p>There was Fricky and Flim-Flub, Gulbert and Flux,</p><p>Clotworthy, Glibberstein, Walworth and Snucks.</p><p>And there, next to Santa, his face all aglow,</p><p>Sat the littlest hero, Billy Bo-Bo!</p>"}