{"title": "The Seagull who couldn’t fly", "author": "Ann Lang", "level": "", "category": "Christmas,Illustrated,Modern,Original,", "tag": "Bird,Seagull,", "length": "05 - 10 mins,", "body": "<p>I was born on a rooftop. Three of us hatched out at the same time thanks to Mother keeping us safe and warm until we felt the need to explore daylight!</p><p>The nest Mother had built for us on the rooftop was wedged between two chimney pots  sheltering us from the rain and winds.</p><img src='https://xcx.mdavid.cn/img/image002.gif'></img><p>Ours was the only seagull nest on the roof of No. 23 but as our eyes learnt how to focus we could see there were many others on rooftops further along the street with young gulls already letting the  townspeople know they had arrived!</p><p> </p><p> </p><p>I remember feeling the hot sun on my back and trying, without success, to stand on my two feet. My brothers had no difficulty moving along the gully in the roof and I felt so ashamed that I could not achieve what they were doing.</p><p>Mother kept telling me to be patient and called me a “Stupid Seagull” but days later I still seemed to be unable to follow in their footsteps. I watched my brothers begin to fly from the rooftops and explore the nearby trees and open spaces. As hard as I tried to copy their actions my wings would just not open to enable me to fly.</p><img src='https://xcx.mdavid.cn/img/image013.png'></img><p>Weeks later I again watched my brothers begin to fly from the rooftops and explore the nearby trees and gardens.  Mother had been very protective of her baby gulls but she told us we would soon have to search for our own food and to be aware of all the hazards that life would present to us.</p><p>I remember falling from the rooftop to the ground in an attempt to fly. Fortunately I landed on my feet!! By this time Mother and brothers had fled from the nest telling me that if I didn’t open my wings and fly then I would not survive. It wasn’t my fault that my wings would not open – they just remained tucked into my side no matter how hard I tried to spread them.</p><p>I fell to the ground in an attempt to fly. Fortunately I landed on my feet! I soon realised that I would never be able to fly and finally admitted that I was different to other seagulls. I now had to build my life around my flying problem and survive as best as I could.</p><img src='https://xcx.mdavid.cn/img/traffic.gif'></img><p>The small fishing town I had been born into boasted a very pretty harbour. I felt if I could find my way to the town centre then the harbour would be a good place to live. It was getting near to Christmas and I definitely had to find a warm and safe place to settle. After trying many different roads and only finding ploughed fields and open spaces I finally could smell the sea! Walking along the pavements many people would “shoo” me away as if I was an alien from out of space who was about to attack them!</p><p>I tried walking on the road but the cars would beep their horns and point their front wheels in my direction as if to say “for goodness sake fly away”. How could they possibly know that I couldn’t fly?</p><img src='https://xcx.mdavid.cn/img/image010.gif'></img><p>After many hours of walking I finally arrived at the harbour. How busy it was! I seemed to be in everybody’s way. All I could see was people’s feet! I bumped into people pushing prams and people walking dogs. I tried so hard to leave the ground. There appeared to be more room in the sky but my wings would still not unfold.</p><img src='https://xcx.mdavid.cn/img/image008.gif'></img><p>I found a hiding place underneath a wooden bench. I felt quite safe and happy until a group of children came and sat on the bench and started eating fish and chips. How hungry that made me feel.</p><p>Shrieks of laughter came from the children when a seagull (could it have been my brother?) swooped down and helped himself to their lunch! I didn’t stand a chance of getting any food because I couldn’t escape into the sky.</p><p>In the harbour background I could see a fishing trawler bringing in its catch. Circling all around the boat were many seagulls calling out to each other as they smelt the fish. This is what I should be doing – up there in the sky circling around with them.</p><p>As I watched I remembered how my mother had christened me “Stupid Seagull” She kept telling me I needed to fly to survive. No matter how hard I tried my wings would not open. It was almost like they did not exist. I needed to move away from the harbour as I was getting tramped on by people in a hurry all carrying their Christmas shopping. They did not understand why I remained on the ground. If only I could tell them.</p><img src='https://xcx.mdavid.cn/img/image012.gif'></img><p> </p><p> </p><p> </p><p>The harbour was surrounded by stone built cottages. Twinkling lights were shining from windows to celebrate Christmas. As I hopped on to the garden wall of a cottage painted bright yellow and blue a voice called out “Hello little seagull. My name is Katie – have you come to visit me?”</p><img src='https://xcx.mdavid.cn/img/image016.gif'></img><p>I looked into the kind face of a lady sitting in a wheelchair hugging a small dog. The wheelchair was placed just inside an open glass door separating the garden from the house. Inside I could see a large open fire. Beside the fire stood an enormous Christmas tree decorated so brightly. The shining star on the top appeared to smile at me. I knew then that I was safe.</p><p>The lady threw me a crust of bread from a plate on her lap. At last I had food! I was so grateful.</p><p>“I suppose you will fly away now that you have food” said Katie, “every other seagull does.” Katie would soon find out how different I was!</p><img src='https://xcx.mdavid.cn/img/image020.gif'></img><p>Katie’s garden had several shady spots and each night I would snuggle down amongst the shrubs. In the morning I would tap my beak on Katie’s glass door to let her know I had not flown away. Katie would respond by opening the glass door and throwing food out for me. We seemed to make a good pair – Katie unable to walk and me unable to fly!</p><p>On Christmas day Katie invited me inside her lovely cottage. By this time her little dog (Patch) and I had become great friends. We were both given lots of treats to celebrate Christmas. There was even a colourful stocking with our names on. I didn’t realise she had named me Sammy!</p><img src='https://xcx.mdavid.cn/img/image022.gif'></img><p>Katie was so kind. I had everything I wanted here in Katie’s lovely garden. I had at last found a good friend who kept calling me her “Special Seagull.” I was not a “stupid seagull” after all!</p>"}