{"title": "The Shepherdess and the Chimney Sweep", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/p246i.png'></img><p>Have you ever seen an old wooden cabinet, quite worn black with age, and decorated with all sorts of carved figures and patterns?</p><p>Just such a one stood in a certain parlour. It had been left by the great-grandmother and was covered from top to bottom with carved roses and tulips. The most strange patterns were on it, too and little stags’ heads stuck out between them, with their zigzag antlers. On the door panel the shape of a most ridiculous man had been carved, for he grinned – you could not call it smiling or laughing—in quite a curious way. He also had crooked legs, little horns upon his forehead, and a long beard.</p><p>The children called him the crooked-legged field-general. It must have been a big job to carve him out of the wood. However, there he was. His eyes were always fixed upon the table below, and toward the mirror, for on this table stood a charming little figure of a shepherdess, her cloak gathered gracefully around her and fastened with a red rose. Her shoes and hat were gold-coloured, and her hand held a shepherd’s crook. She really was very lovely. Close by her stood a little chimney sweep. He was as clean and neat as any other figure. Indeed, he might as well have been made a prince as a sweep, since he was only make-believe, for though everywhere else he was as black as a coal, his round, bright face was as fresh and rosy. This was certainly a mistake—it ought to have been black and covered in coal-dust if he was really a chimney-sweep.</p><p>There he stood so prettily, with his ladder in his hand, quite close to the shepherdess. He always stayed in the same spot, and from the first time he was put there they promised each other they would always stay together. They suited each other exactly—they were both young, both of the same kind of porcelain, and both equally fragile.</p><p>Close to them stood another figure three times as big as themselves. It was an old Chinaman, a mandarin, who could nod his head. He was of porcelain, too, and he said he was the grandfather of the shepherdess, but he couldn’t prove this. He said that he ws in charge of her and so when the crooked-legged field-general proposed marriage to the little shepherdess, the mandarin nodded his head, giving his approval.</p><p>“You will have a husband,” said the old mandarin to her, “a husband who, I believe, is made of mahogany wood. You will be the wife of a field-general, of a man who has a whole cabinet full of silver plates and even more things in the secret drawers.</p><p>“I will never go into that horrible cabinet,” cried the little shepherdess. “I have heard there are eleven porcelain ladies already stuck in there.”</p><p>“Then,” replied the mandarin, “you will be the twelfth, and you will be in good company. This very night, when the old cabinet creaks, we shall have the wedding, as surely as I am a Chinese mandarin.” And upon this he nodded his head and fell asleep.</p><p>But the little shepherdess wept, and turned to the beloved of her heart, the porcelain chimney sweep.</p><p>“I must ask you,” she said, “to go out with me into the wide world, for here it is not possible for us to stay.”</p><p>“I will do in everything as you wish,” replied the little chimney sweep. “Let us go at once. I am sure I can earn enough money for both of us with my work.”</p><p>“If we were only down from the table,” she said. “I won’t feel safe till we are far away out in the wide world and free.”</p><p>The little chimney sweep comforted her, and showed her how to set her little foot on the carved edges, and on the leaves carved around the leg of the table, until at last they both reached the floor. But, turning for a last look at the old cabinet, they saw that everything was in uproar. All the carved stags stretched their heads farther out than before, raised their antlers, and moved their throats, while the crooked-legged field-general sprang up and shouted to the old Chinese mandarin, “Look! they are running away! They are running away!”</p><p>They were frightened at this, and jumped quickly into an open drawer in the seat by the window.</p><p>Here lay some packs of cards and a little doll’s theater, which had been set up as nicely as could be. A play was going on, and all the queen sat in the front row, and fanned themselves with the flowers which they held in their hands, while behind them stood the jacks, each with two heads, one above and one below, as playing cards have. The play was about two persons who were not allowed to marry, and the shepherdess cried, for it seemed so like her own story.</p><p>“I cannot bear this!” she said. “Let us leave the drawer.”</p><p>But when she had again reached the floor she looked up at the table and saw that the old Chinese mandarin was awake and that he was rocking his whole body to and fro with rage.</p><p>“The old mandarin is coming!” cried she, and down she fell on her porcelain knees, so frightened that she was.</p><p>“I have thought of a plan,” said the chimney sweep. “Suppose we creep into the vase which stands in the corner. There we can lie upon the roses and lavender, and throw salt in his eyes if he comes near.”</p><p>“That will not do at all,” she said. “Besides, I know that the old mandarin and the vase were once engaged and no doubt they are still friends. No, there is no help for it, we must go together out into the wide world.”</p><p>“Have you really the courage to go out into the wide world with me?” asked the chimney sweep. “Have you thought how big it is, and that if we go, we can never come back?”</p><p>“I have,” she replied.</p><p>And the chimney sweep looked earnestly at her and said, “My way lies through the chimney. Are you really brave enough to go with me through the stove, and creep through the pipes and the tunnel? Well do I know the way! We shall come out by the chimney, and then I shall know how what to do. We climb so high that they can never reach us, and at the top there is an opening that leads out into the wide world.”</p><p>And he led her to the door of the stove.</p><p>“Oh, how black it looks!” she said. Still she went on with him, through the stove, the pipes, and the tunnel, where it was pitch dark.</p><p>“Now we are in the chimney,” he said, “and see what a lovely star shines above us.”</p><p>There actually was a star in the sky, that was shining right down on them, as if to show them the way. Now they climbed and crept—an awful long way it was, so steep and high! But he went first to lead, and to smooth the way as much as he could for her. He showed her the best places to put her little china foot, until at last they came to the edge of the chimney and sat down to rest, for they were very tired, as you can well imagine.</p><p>The sky and all its stars were above them, and below lay all the roofs of the town. They saw all around them the great, wide world. It was not like what the poor little shepherdess had thought it might be, and she leaned her little head upon her chimney sweep’s shoulder and wept so bitterly that the gold was washed from her golden scarf.</p><p>“This is too much,” said she; “it is more than I can bear. The world is too big! I wish I was safe back again on the little table under the mirror. I shall never be happy till I am there once more. I have followed you out into the wide world. Surely, if you really love me, you will follow me back.”</p><p>The chimney sweep tried to reason with her. He reminded her of the old mandarin, and the crooked-legged field-general, but she cried so bitterly, and kissed her little chimney sweep so fondly, that he could not do otherwise than as she wished, foolish as it was.</p><p>So they climbed down the chimney, though with the greatest difficulty, crept through the pipes, and into the stove, where they stopped to listen behind the door, to discover what might be going on in the room.</p><p>All was quiet, and they peeped out. Goodness! There on the floor lay the old mandarin. He had fallen from the table in his attempt to follow the runaways, and had broken into three pieces. His whole back had come off in a single piece, and his head had rolled into a corner. The crooked-legged field-general stood where he had always stood, looking out at what had happened.</p><p>“This is shocking!” said the little shepherdess. “My old grandfather is broken in pieces, and we are the cause of it,” and felt guilty.</p><p>“He can be fixed,” said the chimney sweep; “he can certainly be fixed. Do not be so sad! If they glue his back and put a bolt through his neck, he will be just as good as new, and will be able to say as many horrible things to us as ever.”</p><p>“Do you really think so?” she asked. Then they climbed again up to the place where they had stood before.</p><p>“How far we have been,” said the chimney sweep, “and since we have got no farther than this, we could have saved all the effort and just stayed here.”</p><p>“I wish grandfather were mended,” said the shepherdess; “I wonder if it will cost very much.”</p><p>Mended he was. The family had his back glued and his neck bolted, so that he was as good as new, only he could not nod any more.</p><p>“You have become awfully proud since you were broken to piece,” said the crooked-legged field-general to the mandarin, “but I must say, in my opinion, I don’t see much to be proud of. Am I to marry her, or am I not? Just answer me that.”</p><p>The chimney sweep and the shepherdess looked pleadingly at the old mandarin, hoping for pity from him. They were so afraid that he would nod his head. But he could not, and it would have been beneath his dignity to have confessed to having a bolt in his neck. So the young porcelain people always remained together, and they blessed the grandfather’s bolt and loved each other for the rest of their lives.</p>"}