{"title": "Siren Alert", "author": "Jan Fenimore", "level": "6 to 8,9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>“Leave me alone, Sam, I’m busy,” Amy said, her eyes riveted to the black desk phone. Maybe if she stared hard enough she could keep it from ringing.</p><p>The lump in Amy’s stomach felt the size of the biggest onion in the truck on its way to the warehouse a block away. Why had Grandpa Harry left her in charge of his funeral home office? What if someone died? What if someone needed to be rushed to a hospital? What would she do? Being in charge was a big responsibility. And watching her six-year-old brother, Sam, was no picnic either.</p><p>“Sis, you don’t have to sit by the phone every minute. Let’s play hide-and-seek in the casket room,” Sam taunted. “I’ll bet I can hide so you can’t find me.”</p><p>Amy frowned. “Do you always have to take chances? Grandpa said the casket room is no place for children. Beside, the phone might ring and I’d have to answer it all out of breath.”</p><p>“Excuses, excuses. Just let me hide once,” said Sam. “Grandpa won’t be back for a long time.”</p><p>“Okay, pest, if you promise you’ll stop bugging me. But just one game.”</p><p>“Great.  Be sure to count to 100.” Sam disappeared in seconds.</p><p>“One…two…three…”</p><p>Just then the phone rang. Amy gulped as she picked it up, finally finding her voice. After she hung up, it rang again. She relaxed a little. Really, all she had to do was write down who called and she could do that. Then she noticed the envelopes next to the list she had been asked to address and stamp. When Amy looked up after finishing her task the late afternoon had turned to dusk. The groanings of heavy, old cottonwood trees pushed by a sudden autumn wind drifted in the open window.</p><p>I forgot all about Sam, she thought. He probably got tired of waiting on me and wandered outside.  And where is Grandpa Harry? He’s been gone so long. Amy twisted the phone cord while the ever-present knot twisted tighter in her stomach. She knew she should look for Sam but then she’d have to leave the phone. Why did she have to make these tough decisions? Anger replaced worry.</p><p>Amy shouted for Sam out the front door, but only a dog’s bark echoed in the distance. Back inside, she looked out the corner window, hoping to see her brother or grandfather. What she saw she had not expected to see at all.</p><p>An orange glow lit the dark sky. It came from the onion warehouse just a block away. Flames leaped in the air and the smell of burnt onions filled Amy’s nostrils. Her heart pounded.</p><p>“I’ve got to find Sam,” she cried. “What if he’s near the fire?” She remembered how he loves to play with matches and she felt the heat of the fire on her forehead.</p><p>First, she ran to the casket room yelling as she jerked open the lids. Then, flying out the front door she yelled for her brother. Smoke billowed from the warehouse but there was no sound of sirens. No one rushed to the fire. In fact, the streets looked deserted. What if she were the first one to see it? She had to warn others.</p><p>I know just the thing to do. Amy ran toward the long, black ambulance parked in the rear of the funeral home. She jerked open the door, fumbling for the siren button.  Grandpa Larson had warned her and Sam never, ever to push that button. It was only for emergencies.</p><p>This was an emergency if there ever was one. Amy found the button in the dark and leaned on it. The screeching sound filled the air. She looked down the street toward the fire and saw Sam running toward her.</p><p>“Why did you leave?” she yelled. “I was so worried.” The relief of seeing him pushed away her anger.</p><p>“You wouldn’t play with me so I went to the five-and-ten for some licorice.” Sam answered. “I heard the siren and ran all the way back.”</p><p>Amy and Sam watched as the small town cop, alerted by the ambulance siren raced toward the fire. Within minutes someone rang the curfew siren mounted on city hall, summoning the volunteer fire department.</p><p>“Sam, look how the wind blows those sparks everywhere.” Amy shouted above the noise of wailing sirens. “They could set the whole town on fire.”</p><p>Amy sighed with relief as Grandpa Larson drove up and jumped out of his car.  After checking on Amy and Sam, he ran to the garage, and pulled a ladder off the wall. Next, he headed toward the outside stairs up to the building’s second story. A neighbor came running and grabbed a garden hose.</p><p>While Grandpa Larson climbed the stairs with the ladder the neighbor hooked all the hoses together he could find and followed with water splashing behind him. Amy watched in terror as her grandpa crawled on the third story roof with hose in hand. He had to work fast to drench the shingles so they wouldn’t burn.</p><p>There would be no help from the fire department. The city had only one fire truck and enough volunteers to fight one fire at a time. Sparks bounced in the smoky breeze, all in the direction of the mortuary.</p><p>All the tension of the day burst forth in tears, streaming down Amy’s cheeks. Her grandpa might fall. He might not be able to stop the fire from spreading.</p><p>She looked at Sam. There he stood in all the excitement, chewing on his licorice with black juice running down his chin. He didn’t seem worried and Amy took a deep breath after seeing his reaction.</p><p>Hours later, with the danger from the fire over, Grandpa Larson hugged both his grandchildren. “I’m really proud of you, Amy. Ringing the siren was quick thinking. It alerted others to the fire. Such a take-charge girl can work for me anytime.”</p><p>Amy smiled. Next time she worked for her grandfather she hoped things would be a little less exciting.</p>"}