{"title": "Size of a Whisper", "author": "Savannah Hendricks", "level": "3 to 5,6 to 8,9 to12,", "category": "Instructional,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>I have always wished that I could be tiny again. Maybe even the size of a whisper.</p><p>“Mom, how small is a whisper?” I asked.</p><p>“A whisper?” she asked. “I imagine very small, Mark. How come?”</p><p>“Olivia is tiny. I want to be tiny again too, and a whisper might be a good tiny size to be,” I said.</p><p>“Olivia is a baby, but you are a big boy. Why do you want to be tiny again?” my mom asked.</p><p>“I don’t remember being tiny. I think being tiny again would be fun. If I was tiny again then you could carry me around just like Olivia,” I said.</p><p>“I could tell you stories of when you were tiny,” my mom suggested.</p><p>“No, that will not work,” I said. “I need to be tiny in a whisper sort of way.”</p><p>I headed off to my room and closed the door. With my door closed Mom couldn’t bother me in my transformation to become a whisper. I felt excited about being tiny again and did a little dance.</p><p>After my dance, I grabbed my photo album and flashlight off my bookcase. I walked over and closed my blinds so that it would be very dark. Then I sat in the middle of my bed. I opened the photo album full of my baby pictures and shined my flashlight on them. After I had the pictures in my memory, I switched off the flashlight so I could concentrate. Nothing happened. I needed help. I shone my flashlight around my room until I found what I needed. My secret weapon!</p><p>Placing my football helmet on my head, I once again sat on my bed. I pointed the flashlight on the pictures quickly and then shut it off. I closed my eyes and thought really hard. I was still having trouble, so I placed both my hands firmly on my helmet. My hands will help keep my powers from escaping. I whispered, “Mark, baby Mark. Tiny baby Mark.”</p><p>Then I stopped whispering and thought again, tiny like a whisper. Then slowly I started to feel like a whisper, which is really quite small, the size of lint from a belly button. The same tiny as in the baby pictures of me. I had tiny fingers, toes, arms, legs, and even my belly button was tiny too. I had done it! I had become the size of a whisper. I jumped off my bed, tore off my helmet, and open my bedroom door.</p><p>“Mom, Mom,” I called running down the hall.</p><p>“Yes Mark, what is it?” she asked.</p><p>“I did it. I became the size of a whisper!” I said, falling into her lap.</p><p>“Oh no,” I added. “What happened? I’m not tiny anymore. It didn’t last.”</p><p>“It’s okay Mark. Tell me how tiny a whisper was,” my mom said.</p><p>“The size of belly button lint,” I proudly said.</p><p>“Goodness, that is small,” she said with a smile. “But I like you as a big boy instead,” she added, giving me a squeeze, “because big boys get to help me make cookies.”</p><p>“Then I am a big boy, and not the size of a whisper,” I told my mom.</p>"}