{"title": "Sketch the Dormouse and the Bakers’ Spice", "author": "Nathan Oser", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Cat,Mouse,", "length": "10 - 15 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Sketch-Mouse.jpg'></img><p>Sketch was big and tall… if you were ladybug. If you were a cat, he was short and small and scrawny… but not so much that he wouldn’t make for a fine afternoon snack. Sketch was a dormouse.</p><p>He made his home in the walls of a secluded old cottage north of the frozen lake. He didn’t live alone. There was Mr. Baker and Mrs. Baker, and then there was Knitty–Knitty the tabby cat.</p><p>To say Knitty was frisky would be an understatement. She had more energy than an electric eel, and such an appetite that ravens could scarcely be as ravenous. Sketch was constantly on the watch for Knitty. He had once heard a statistic that 50% of all dormice end up getting eaten by the house cat. He wondered if the remaining 50% didn’t live with canary lovers. In other words, he was scared.</p><p>The only thing Knitty hated more than mice (she liked the taste, mind you) was the snowy cold, and she hardly ever went outside. Oftentimes that left Sketch confined to his cozy little mouse hole. Cozy, but foodless. It was only on late nights when Knitty had had too much milk and fell deep asleep and began snoring as loud as if she might be choking on a trumpet that Sketch could sneak out to search for crumbs.</p><p>Tonight a dash of stars seasoned the cold sky. From the hardwood floor Sketch could see them twinkling through the window, and they were so beautiful he could almost hear them too, like tiny jingling silver bells. The cottage was quiet enough to hear them, at least, if they did make a sound. Not a creature was stirring, except for the mouse.</p><p>He padded into the kitchen, hiding behind chair and table legs as he went. Every few steps he looked back to make sure Knitty was still napping in the sofa cushions. He had to be careful, for the cat was asleep, but only in a shallow sleep. Sketch could tell because she wasn’t even snoring as loud as a kazoo yet, much less a trumpet.</p><p>There were no crumbs to be found under the dining table, but when Sketch scurried past the big sacks of flour and yeast and baking soda and sugar and cornmeal that crowded the kitchen floor he picked up a sharp aroma of cheese from the cold pantry. He couldn’t remember the last time he’d eaten, and neither could his tummy, which began to grumble and growl and groan in anticipation.</p><p>Out along the baseboards the dormouse creeped, and through a chip in the wood. The cold pantry was packed full with fresh eggs and milk, fruits and vegetables, and shelf after shelf of cheese. Red cheddar, white cheddar, parmesan, brie, feta, gouda–and was that a hint of limburger? Pee-yew! You bet! It was a brand new stockpile, and Sketch’s mouth began to water.</p><p>He climbed a cardboard pyramid of egg cartons and wasted no time in finding a soft block of poorly wrapped Colby Jack to nibble on. He went from one cheese to the next until he’d had a taste of most, and when he was full, he plucked up a crumb of blue cheese to take with him back to his hole on the other side of the cottage. It was then that he heard a scratching.</p><p>Knitty was up and clawing away at the pantry door. Sketch wondered if maybe he’d been chewing too loudly or if maybe it was his rumbling tummy that woke the cat. Having been caught off guard, he fumbled into a heavy red wheel of gouda, and down it slipped, off the shelf where it landed on its side with a bounce and started rolling for the door. There was a thump, and the door burst wide, and in pounced Knitty.</p><p>The cat had its two front paws on the shelf in no time, nails out, pointy as thorns. All this before you could say “A-B—” See? There she was! Fast as lightning!</p><p>Sketch clamped the blue cheese in his jaw and scurried across the narrow board. He knocked into a few cheeses on the way but soon found a long stem of celery to slide down. From the vegetable box he jumped and landed atop a milk bottle. He hopped across the caps of a dozen other bottles as if they were stepping stones, and Knitty turned and gave a toothy smile. Better than cookies and milk! thought the cat.</p><p>Sketch gasped to see the feline’s hungry expression, and the crumb of cheese fell from his mouth. He quickly reached down to catch the morsel, twining his tail around a bottle neck for support, but the container began to teeter and totter. Then it fell.</p><p>Sketch went toppling down, but before the glass crashed upon the floor and shattered, he leaped and dug his mitts into the closest thing, which just happened to be Knitty’s furry back. The cat arched its spine with surprise when it saw all that delicious milk splash over the floor, and Sketch went flying upward like a stone from a catapult. He landed far away from the pools of spilt milk and broken glass and ran off while Knitty still stood there in shock.</p><p>Any cat would normally be in heaven to find a spilt bottle of milk. And Knitty of course thought about stopping to lick it up, but she was far too angry. Like bowling pins the other bottles had come crashing down with the first, and that was her whole stockpile for the next few weeks spreading over the floor. Not only would she not have any milk for later, but she’d missed her mouse. She was no longer just angry; she was mad and furious and fuming too.</p><p>She went tearing out of the pantry, seeing red, but not seeing her mouse. She sniffed the air for hints of rodent, but only winced at the strong, smelly cheeses.</p><p>By then Sketch had scurried up to the kitchen countertop where he could spy down at the bristling feline.</p><p>Then, suddenly, their eyes met.</p><p>Sketch jumped and staggered backward, only to run up against a wobbly wooden spice rack. A small burlap pouch hit him from above like a powder puff, spilling a brown cloud of strange, pungent spice. It was catnip, and so overwhelming that Sketch let out sneeze after sneeze after sneeze, each one sending him summersaulting forward and flipping, topsy-turvy. Even after the sneezing stopped he was too woozy and dazed to stand up straight. He stumbled into a rolling pin and lost his footing at the edge of the counter. Then down he went into an open sack of flour. POOF!</p><p>Knitty scraped at the big paper sack, no doubt sharpening her claws at the same time she tore open the hole. It didn’t take long before the flour came streaming out to the floor as if from a faucet, and Sketch, his coat now white as snow, poured down with it. He slipped and skittered and ran. Knitty gave chase, building up speed until she finally pounced, the dormouse dead in her sights.</p><p>There was no escape for Sketch. He could only stand there, white as a ghost, shaking against the brick wall as he watched the furry feline come flying toward him. He clenched his eyes shut and curled up as small as possible.</p><p>BANG!</p><p>Sketch was so small that the cat missed him and hit the wall instead. There was a crunching-cracking sound as one of the old red bricks crumbled and fell loose. Knitty shook her head to get her eyes pointing the same way again. And when she could finally see straight what she saw was a little ball of white flour jump through the hole where the brick had been and dart outside into the crisp snowy night.</p><p>The draft that rushed in would have given Knitty the chills if she wasn’t so burning mad. She crouched to her belly and, with a wiggle and a squiggle and a push, followed the mouse outside. The country around the frozen lake was dark, and unimaginably quiet. Sketch ran and ran, light as a feather, slipping and sliding and skating across the crunchy, glazed surface of snow until he had to stop to catch his breath. Only then did he dare to look back.</p><p>It’s important to keep in mind how much Knitty hated the snow, and why. Sketch watched as her dainty feet sunk with each tentative step through the yard, and her fur became wet and heavy and cold. Luckily for her, though, the snow was only one foot deep this night, and Knitty had four feet. She clenched her jaw (partially to stop her teeth from chattering) and plowed onward. The little flour-doused dormouse was invisible in the weather and already quite far away, but the scent of catnip was unmistakeable—as strong and enticing as a Christmas turkey might be to you or me. It was slow going for Knitty, but she knew exactly which way to go.</p><p>The mouse’s heart, which already beats more than five times as fast as yours or mine, began to beat even faster with fear. Thumpthumpthump! He couldn’t bring himself to run anymore, and with nothing but vast frozen lake ahead, he knew there was nowhere to hide. If only there were some trees or brush to squirrel away amongst! he thought at first. But the forest was on the other side of the cottage, and besides, trees meant owls, and an owl might as well have been Knitty with wings. Sketch was determined not to get eaten, and by the time the tabby cat had trudged out of the buried flowerbeds, he was buzzing with an idea.</p><p>The cat followed her nose, closer and closer to the lakeshore where Sketch stood waiting. But Sketch was not exactly waiting. Nor was he standing. He was rolling.</p><p>The fact that the flour on his fur already made him look like a snowball gave Sketch the idea to turn into a snowball. He rolled and rolled, left and right and back again, picking up course lumps and thick swaths of white. The fresh, powdery flakes stuck to his back and belly, and then stuck to each other. Sketch dredged himself in snow the way the Bakers might dredge a doughnut. Only much, much more, and much, much bigger. The size of a snowman’s legs, in fact!</p><p>Of course this took quite some time, and Knitty was right there to see the big snowball roll to a stop because it was now too big to roll anymore at all. Though there was no way for the mouse to see the cat, he could surely hear her as she began chewing and chomping away at his thick icy shell. Sketch shivered. Knitty ate. And the more Knitty ate, the more Sketch shivered. A few minutes passed, and then, suddenly, the cat was only a few gulps away from the center of the big, round snow-cake.</p><p>Sketch pulled his head in as tight as he could and pried open one eye. Knitty’s teeth came down on another mouthful of snow and she opened wide for the next bite, which was all dormouse, and Sketch clenched his eyes shut again, very tight. The cat’s teeth were sharp and ready to snap, but the cavernous mouth stayed open and trembled and…</p><p>BUUUUUURP!</p><p>Knitty let out a giant belch, then stepped back from the half-sphere of snow. She ate so much watery snow that her belly was full—excruciatingly so—and for all she could tell, she might have already eaten her mouse.</p><p>Sketch peered down at the tabby who had now flipped to her side on the ground, and he watched as she lulled into a hunger-sated sleep. He listened a moment to her snores, making sure she was really out—it was almost too sudden to believe, after all—but they were soft, purring, violin snores. She was pleasantly full and definitely in dreams. Sketch thought they weren’t all that different, he and Knitty. All either wanted was something to fill them up.</p><p>With the flour and catnip now washed off by the snow Sketch skittered past the cat and back to the cottage. He climbed through the hole in the bricks. The ruckus of the chase must have woken the Bakers, for they were picking up the cold pantry and mopping the kitchen floor. That was fine. Sketch had had his fill for the night, and he waddled sleepily back to his hole.</p><p>It was only when he reached the far corner of the cottage that he saw the big red wheel of gouda cheese parked at his doorstep. After bumping open the pantry door it must have rolled straight across the room. He gnawed it into quarters and carried them inside.</p><p>It had been a long night of food and exercise, and now Sketch was ready to turn in. The cottage lights went dark, and the Bakers returned to bed, and Sketch curled up with his cheese. He wondered if the feisty old tabby cat had changed her mind about hating the snow, if not about hating mice. He hoped so. And he hoped she wasn’t too cold.</p>"}