{"title": "Sleeping Beauty", "author": "Charles Perrault", "level": "3 to 5,6 to 8,", "category": "Audio,Classic,Fairy Tale,Illustrated,", "tag": "", "length": "05 - 10 mins,", "body": "<p>// < ![CDATA[\n// < ![CDATA[ // < ![CDATA[ // < ![CDATA[ // < ![CDATA[ // < ![CDATA[ // < ![CDATA[ // < ![CDATA[ // < ![CDATA[ // < ![CDATA[ (function($) {window.fnames = new Array(); window.ftypes = new Array();fnames[0]='EMAIL';ftypes[0]='email';fnames[1]='FNAME';ftypes[1]='text';}(jQuery));var $mcj = jQuery.noConflict(true); // ]]&gt;</p><h2>Illustrated by <a href=\"http://www.shortkidstories.com/aswin-amarnath/\" title=\"Aswin Amarnath\">Aswin Amarnath</a></h2><h2>Narrated by <a href=\"http://www.shortkidstories.com/authors/sharon-blumberg/\">Sharon Blumberg</a></h2><p>Once upon a time, in the days when there were fairies, a king and queen reigned in a country far away. Now this king and queen had plenty of money, plenty of fine clothes to wear, plenty of good things to eat and drink and a coach to ride out in every day. However, although they had been married many years, they had no children. This saddened them very much, as they dearly wanted a child.</p><p>One day, as the queen was walking by the side of the river at the bottom of the garden, she saw a poor little fish that had thrown itself out of the water and lay gasping and nearly dead on the bank. The queen took pity on the little fish and threw it back again into the river. Before it swam away, it raised its head out of the water and said “I know what your wish is and it shall come true, in return for your kindness to me — you will soon have a daughter.”</p><img src='https://xcx.mdavid.cn/img/Sleeping_Beauty_panel11-1024x568.jpg'></img><p>What the little fish had said soon happened and the queen had a little girl, so very beautiful, that the king could not stop looking at her he was so happy. He said he would throw a great party and show the child to all the land, so he asked his kinsmen, nobles, friends, and neighbours. But the queen said “I will have the fairies also, that they might be kind and good to our little daughter.”</p><p>Now there were thirteen fairies in the kingdom, but as the king and queen had only twelve golden dishes for them to eat out of, they were forced to leave one of the fairies without asking her. So twelve fairies came, each with a high red cap on her head, red shoes with high heels on her feet and a long white wand in her hand. After the feast was over they gathered round in a ring and gave all their best gifts to the little princess. One gave her goodness, another beauty, another riches, and so on till she had all that was good in the world.</p><p>Just as eleven of them had done blessing her, a great noise was heard in the courtyard and word was brought that the thirteenth fairy had come, with a black cap on her head, black shoes on her feet and a broomstick in her hand. She quickly came up into the dining-hall. Now, as she had not been asked to the feast she was very angry, scolded the king and queen very much and set to work to take her revenge. So she cried out “The king’s daughter shall, in her fifteenth year, be wounded by a spindle, and fall down dead.”</p><img src='https://xcx.mdavid.cn/img/Sleeping_Beauty_panel21-1024x541.jpg'></img><p>Then the twelfth of the friendly fairies, who had not yet given her gift, came forward, and said that the evil wish must be fulfilled, but that she could soften its mischief; so her gift was, that the king’s daughter, when the spindle wounded her, should not really die, but should only fall asleep for a hundred years.</p><p>However, the king hoped still to save his dear child altogether from the threatened evil, so he ordered that all the spindles in the kingdom should be bought up and burnt. But all the gifts of the first eleven fairies came true in the meantime, for the princess was so beautiful, well behaved, good and wise, that everyone who knew her loved her.</p><img src='https://xcx.mdavid.cn/img/Sleeping_Beauty_panel31-1024x710.jpg'></img><p>It happened that, on the very day she was fifteen years old, the king and queen were not at home and she was left alone in the palace. So she roved about by herself, and looked at all the rooms and chambers, until at last she came to an old tower, to which there was a narrow staircase ending with a little door. In the door there was a golden key, and when she turned it the door sprang open, and there sat an old lady spinning away very busily.</p><p>“Why how now, good mother,” said the princess, “what are you doing there?”</p><p>“Spinning,” said the old lady, nodding her head and humming a tune, while the wheel buzzed.</p><p>“How prettily that little thing turns round!” said the princess, who took the spindle and began to try and spin. But scarcely had she touched it before the fairy’s prophecy was fulfilled. The spindle wounded her and she fell down lifeless on the ground.</p><img src='https://xcx.mdavid.cn/img/Sleeping_Beauty_panel41-1024x556.jpg'></img><p>However, she was not dead, but had only fallen into a deep sleep. The king and the queen, who had just come home, and all their court, fell asleep too. The horses slept in the stables, the dogs in the court, the pigeons on the house-top and the very flies slept upon the walls. Even the fire on the hearth left off blazing and went to sleep and the spit that was turning about with a goose upon it for the king’s dinner stood still. The cook, who was at that moment pulling the kitchen-boy by the hair to give him a box on the ear for something he had done amiss, let him go, and both fell asleep. The butler, who was slyly tasting the ale, fell asleep with the jug at his lips. And thus everything stood still, and slept soundly.</p><p>A large hedge of thorns soon grew round the palace and every year it became higher and thicker. At last, the old palace was surrounded and hidden, so that not even the roof or the chimneys could be seen. But there went a report through all the land of the beautiful sleeping princess, so that, from time to time, several kings’ sons came and tried to break through the thicket into the palace. This, however, none of them could ever do, for the thorns and bushes laid hold of them, as it were with hands and there they got stuck and could not escape.</p><p>After many, many years there came a king’s son into that land and an old man told him the story of the thicket of thorns, how a beautiful palace stood behind it and how a wonderful princess lay in it asleep, with all her court. He told, too, how he had heard from his grandfather that many, many princes had come and had tried to break through the thicket, but that they had all stuck fast in it. Then the young prince said, “All this shall not frighten me; I will go and see this sleeping princess.” The old man tried to hinder him, but his mind was made up to go.</p><p>Now that very day the hundred years were ended and as the prince came to the thicket he saw nothing but beautiful flowering shrubs. He got through them with ease and they shut in after him as thick as ever. Then he came at last to the palace and there in the court lay the dogs asleep. The horses were standing in the stables and on the roof sat the pigeons fast asleep, with their heads under their wings. And when he came into the palace, the flies were sleeping on the walls, the spit was standing still, the butler had the jug of ale at his lips, the maid sat with a chicken in her lap ready to be plucked and the cook in the kitchen was still holding up her hand, as if she was going to beat the boy.</p><img src='https://xcx.mdavid.cn/img/Sleeping_Beauty_panel5-1024x494.jpg'></img><p> Then he went on still farther, and all was so still that he could hear every breath he drew. At last he came to the old tower and opened the door of the little room in which the princess was and there she lay, fast asleep on a couch by the window. She looked so beautiful that he could not take his eyes off her, so he stooped down and gave her a kiss.</p><img src='https://xcx.mdavid.cn/img/Sleeping_Beauty_panel6-1024x640.jpg'></img><p>But the moment he kissed her, she opened her eyes and awoke, smiled upon him and they went out together. Soon the king and queen also awoke and all the court and gazed on each other with great wonder. And the horses shook themselves, the dogs jumped up and barked, the pigeons took their heads from under their wings and looked about and flew into the fields, the flies on the walls buzzed again, the fire in the kitchen blazed up, round went the spit, with the goose for the king’s dinner upon it; the butler finished his drink of ale, the maid went on plucking the fowl and the cook gave the boy the box on his ear.</p><p>The prince and the princess were married, there was a tremendous wedding feast and they lived happily together for the rest of their lives.</p>"}