{"title": "A Very Special Guitar", "author": "Andrea Tillmanns", "level": "3 to 5,6 to 8,", "category": "Funny,Modern,Original,", "tag": "Frog,", "length": "01 - 05 mins,", "body": "<p>Once upon a time, there was a little frog who loved music more than anything else. He love croaking together with his brothers, but he also loved listening to the birds’ singing or the crickets’ chirping. He just could not get enough of all those beautiful melodies surrounding his pond each day.</p><p>One day, however, he noticed a young man who sat down in the meadow near the pond and took a strange thing out of a large case. This wooden thing had two bumps on either side and a long, thin neck on which six strings were fixed. The young man laid the thing on his legs, pressed down the strings with his left hand, pulled them with the right hand, and all of a sudden, the most wonderful music filled the air that he had ever heard.</p><p>Enchanted, the little frog listened to him, while the young man played all new melodies. How he would have loved to sing such wonderful songs on his own … But all at once, croaking seemed boring to the little frog, and even the birds’ singing or the crickets’ chirping appeared much more humdrum to him now than these melodies.</p><p>When the young man put the musical instrument back into the case and went away, the little frog directly headed for the wise, old owl. He described the instrument for her and then waited for her answer in excitement.</p><p>“Hm, let me think”, the owl said and rubbed her beak’s tip thoughtfully with her right wing. “This must have been a guitar …”</p><p>“Then I will learn to play the guitar!” the frog explained and hopped back to his pond.</p><p>“Frogs cannot play the guitar!” the owl called after him. But the little frog did not hear her anymore. As soon as he reached his pond, he told all of his friends that he wanted to play the guitar.</p><p>“Frogs cannot play the guitar”, contradicted one of the older frogs, too. “We have fingers that are much too short and skin which is much too thin.”</p><p>“Moreover, you don’t have a guitar at all”, a younger frog lady added.</p><p>Hereupon the young frog became very sad. He had no fun at all any more croaking together with the other frogs. The whole evening long, he could only think about the wonderful melodies which the young man had elicited from the guitar. And during the night, he could hardly sleep, since he could only think about how he would have loved to play the guitar on his own.</p><p>When he was sitting unhappily at the edge of his pond next day, two of his brothers came along. Together they carried a furled leaf in which they had apparently wrapped something heavy.</p><p>“We would like to give you something”, his younger brother explained.</p><p>“A very special guitar”, his older brother added. Slowly and carefully they let the furled leaf slid down to the ground.</p><p>Excitedly the little frog hopped to the leaf and rapidly uncurled it. Then he looked up, disappointed. “But this is only an empty leaf”, he said.</p><p>“But no”, his brothers contradicted unanimously, “this is a very special guitar. A guitar only for frogs – it is waterproof, has quite soft strings which won’t hurt your fingers … and for the stork not to discover you, it is also – transparent!”</p><p>Together they put the transparent strap of the transparent guitar around the little frog’s neck. The guitar was so light that he did not feel it at all. He grabbed the strings with his left hand, and indeed they were so soft that he did not sense how he touched them. With his right hand, he strummed the strings, and now the little frog believed he heard some wonderful sounds. Joyously he started croaking with the melody, and his brothers joined in.</p><p>From then on, every day the little frog played on his transparent guitar, and soon he became the best air guitar player far and wide.</p>"}