{"title": "Sprinting Spencer Still Wants to Run", "author": "Artie Knapp", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Horse,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Sprinting-Spencer-Still-Wants-to-Run-opt.jpg'></img><p>It was summertime and most folks were in town gearing up for fireworks, barbecues and the annual holiday parade. But not me!  My thoughts laid elsewhere; I was thinking about Sprinting Spencer.</p><p>Who is Sprinting Spencer you ask? Well, Sprinting Spencer is a horse, and not just any horse; there was a time when Sprinting Spencer was considered the fastest horse that ever lived.  He wasn’t just fast – he was really, really fast.  But then he got hurt.  And once that happened his racing days were over.</p><p>In his very last race, Sprinting Spencer was way ahead of all the other horses when he tripped and hurt his leg. Luckily, the doctors were able to fix Sprinting Spencer’s leg so he could walk, but his leg just wasn’t the same after his accident. The lightning fast speed he once had was all but gone.</p><p>After Sprinting Spencer’s injury few people in town paid him much attention. It was sad to see him treated that way. He used to be everything to our little town. Everyone knew Sprinting Spencer’s name and people would visit from far away just to catch a glimpse of him. Sadly, what people in town forgot to realize is that Sprinting Spencer was the one most devastated about not being able to race anymore. He really missed running.</p><p>I could see Sprinting Spencer whenever I wanted, because I lived in the farmhouse across the road from him. Sprinting Spencer needed a friend now more than ever, so I went over to see how he was doing.</p><p>When I approached Sprinting Spencer’s stable he was visibly upset. Horses are known for whimpering, but I soon discovered they actually cry sometimes too. It was hard to see my friend that way. I did everything I could to try and cheer Sprinting Spencer up, but nothing seemed to work. He wouldn’t even accept the apples I offered him. That was a first.</p><p>After about a minute went by, Sprinting Spencer finally looked up at me and said, “I’m surprised you would even want to be seen with me. I’m just useless now.”</p><p>“Don’t ever say that,” I said. “We’ll always be friends and you should be proud of all the races you won.”</p><p>“It’s hard to be proud when the whole town is ashamed of me,” said Sprinting Spencer. “I let everybody down.”</p><p>“You did no such thing,” I said. “Your success is the biggest thing that ever happened to our little town.”</p><p>“I sure didn’t finish the way I wanted to, though,” said Sprinting Spencer. Sprinting Spencer hung his head as tears rolled down his face. I didn’t know what to say to him. I felt helpless.</p><p>The wind had picked up and the sky was very dark. “You better get home where it’s safe,” said Sprinting Spencer.</p><p>At that moment, the loudest, most thunderous boom you ever heard crackled directly over us. It was so loud it shook our entire town. After the thunder rumbled, the sound of animals crying out for help soon followed. Sprinting Spencer recognized the cries for help immediately, because they were his friends.</p><p>Just down the road from us set a very old farmhouse and barn. The barn was full of animals. In addition to horses, there were also cows, ducks and rabbits in the barn. We soon realized why the animals were crying out for help when smoke poured out of the barn’s roof. The barn had been hit by lightning.</p><p>Earlier that day, I had waved to the owner of the barn, Mr. Harpole, and his family, as they drove to the Fourth of July festivities. With the Harpole family in town there was no way they would be able to save the animals from the fire.</p><p>“We need to get help,” said Sprinting Spencer.</p><p>“The fire department is part of the parade and probably isn’t available,” I said. “It’s up to us to do something.”</p><p>“Let me out of here,” said Sprinting Spencer.</p><p>I opened up the gate to Sprinting Spencer’s stable and jumped on his back.</p><p>VROOM! Sprinting Spencer dashed out of the stable so fast I nearly fell off of him.   “Hang on tight,” said Sprinting Spencer. “We’ll be there shortly.”</p><p>Even though Sprinting Spencer’s injury prevented him from ever racing against other horses again, he was still very fast. As we approached the burning barn, I carefully opened the main gate and stepped to the side. At that moment, a big gray cloud of smoke blew out of the barn.</p><p>“In here,” yelled several of the animals. “Please help us.”</p><p>Sprinting Spencer told me to stay back as he darted into the barn. One by one, Sprinting Spencer freed all the animals from the burning barn. When he brought the animals out of the barn he asked one of the horses, “Where can I get some water to put out these flames?”</p><p>The horse, who was still rubbing his eyes from the smoke said, “The water well is on the other side of the barn.”</p><p>VROOM! Sprinting Spencer dashed to the other side of the barn so fast I thought he was using magic. He picked up the bucket next to the well and dipped his head into the water.</p><p>Sprinting Spencer raced to the barn and splashed the water over the flames. He did this over and over again. While Sprinting Spencer dashed back and forth between the well and the barn, the fire department finally arrived on the scene. Several folks came out from town as well. Before the firemen could pull the first hose off their truck, Sprinting Spencer had put out the very last flame.</p><p>As everyone praised Sprinting Spencer for saving the animals and barn, his chestnut brown coat turned bright red out of embarrassment.</p><p>Great things came Sprinting Spencer’s way because of his heroics that day; he made the front page of the paper, and the whole town considered him a hero again. That made Sprinting Spencer feel good, but all he ever really wanted was to feel needed and loved in the first place… that and a good bowl of oats.</p>"}