{"title": "The Star Wife", "author": "", "level": "6 to 8,9 to12,", "category": "American Indian,Classic,Folk Tale,", "tag": "", "length": "10 - 15 mins,", "body": "<p>IN the days when the buffalo raced and thundered over the earth and the stars danced and sang in the sky, a brave young hunter lived on the bank of Battle River. He was fond of the red flowers and the blue sky; and when the rest of the Indians went out to hunt in waistcloths of skin he put on his fringed leggings all heavy with blue beads, and painted red rings and stripes on his face, till he was as happy as the earth and the sky himself. High-feather was his name, and he always wore a red swan’s feather on his head.</p><p>One day, when High-feather was out with his bow and arrows, he came on a little beaten trail that he had never seen before, and he followed it—but he found that it went round and round and brought him back to where he had started. It came from nowhere, and it went to nowhere.</p><p>“What sort of animal has made this?” he said. And he lay down in the middle of the ring to think, looking up into the blue sky.</p><p>While he lay thinking, he saw a little speck up above him in the sky, and thought it was an eagle. But the speck grew bigger, and sank down and down, till he saw it was a great basket coming down out of the sky. He jumped up and ran back to a little hollow and lay down to hide in a patch of tall red flowers. Then he peeped out and saw the basket come down to the earth and rest on the grass in the middle of the ring. Twelve beautiful maidens were leaning over the edge of the basket. They were not Indian maidens, for their faces were pink and white, and their long hair was bright red-brown like a fox’s fur, and their clothes were sky-blue and floating light as cobwebs.</p><p>The maidens jumped out of the basket and began to dance round and round the ring-trail, one behind the other, drumming with their fingers on little drums of eagle-skin, and singing such beautiful songs as High-feather had never heard.</p><p>Then High-feather jumped up and ran towards the ring, crying out, “Let me dance and sing with you!”</p><p>The maidens were frightened, and ran to the basket and jumped in, and the basket flew up into the sky, and grew smaller till at last he could not see it at all.</p><p>The young man went home to his wigwam, and his mother roasted buffalo meat for his dinner; but he could not eat, and he could not think of anything but the twelve beautiful maidens. His mother begged him to tell her what the matter was; and at last he told her, and said he would never be happy till he brought one of the maidens home to be his wife.</p><p>“Those must be the Star-people,” said his mother, who was a great magician—the prairie was full of magic in those days, before the white man came and the buffalo went. “You had better take an Indian girl for your wife. Don’t think any more of the Star-maidens, or you will have much trouble.”</p><p>“I care little how much trouble I have, so long as I get a Star-maiden for my wife,” he said; “and I am going to get one, if I have to wait till the world ends.”</p><p>“If you must, you must,” said his mother.</p><p>So next morning she sewed a bit of  the fur of a gopher on to his feather. (A gopher is a small rodent creature that likes to burrow holes a lot.) He ate a good breakfast of buffalo meat and tramped away over the prairie to the dancing ring. As soon as he came into the ring he turned into a gopher; but there were no gophers’ holes there for him to hide in, so he had to lie in the grass and wait.</p><p>Presently he saw a speck up in the sky, and the speck grew larger and larger till it became a basket, and the basket came down and down till it rested on the earth in the middle of the ring.</p><p>The eldest maiden put her head over the edge and looked all around, north and east and south and west.</p><p>“There is no man here,” she said. So they all jumped out to have their dance. But before they came to the beaten ring the youngest maiden spied the gopher, and called out to her sisters to look at it.</p><p>“Away! away!” cried the eldest maiden. “No gopher would dare to come on our dancing ground. It is a magician in disguise!”</p><p>So she took her youngest sister by the arm and pulled her away to the basket, and they all jumped in and the basket went sailing up into the sky before High-feather could get out of his gopher skin or say a word.</p><p>The young man went home very miserable; but when his mother heard what had happened she said: “It is a hard thing you want to do; but if you must, you must. To-night I will make some fresh magic, and you can try again to-morrow.”</p><p>Next morning High-feather asked for his breakfast; but his mother said, “You must not have any buffalo meat, or it will spoil the magic. You must not eat anything but the wild strawberries you find on the prairie as you go.”</p><p>Then she sewed a little bit of a mouse’s whisker on to his red feather; and he tramped away across the prairie, picking wild strawberries and eating them as he went, till he came to the dancing ring. As soon as he was inside the ring he turned into a little mouse, and made friends with the family of mice that lived in a hole under the grass; and the mother mouse promised to help him all she could.</p><p>They had not waited long when the basket came dropping down out of the sky. The eldest sister put her head over the edge, and looked all around, north and west and south and east and down on the ground.</p><p>“There is no man here,” she said, “and I do not see any gopher; but you must be very careful.”</p><p>So they all got out of the basket, and began to dance round the ring, drumming and singing as they went. But when they came near the mouse’s nest the eldest sister held up her hand, and they stopped dancing and held their breath. Then she tapped on the ground and listened.</p><p>“It does not sound so hollow as it did,” she said, “The mice have a visitor.”</p><p>And she tapped again, and called out, “Come and show yourselves, you little traitors, or we will dig you up!”</p><p>But the mother mouse had made another door to her nest, just outside the ring, working very fast with all her toes; and while the maidens were looking for her inside the ring she came out at the other door with all her children and scampered away across the prairie.</p><p>The maidens turned round and ran after them; all but the youngest sister, who did not want any one to be killed; and High-feather came out of the hole and turned himself into what he was, and caught her by the arm.</p><p>“Come home and marry me,” he said, “and dance with the Indian maidens; and I will hunt for you, and my mother will cook for you, and you will be much happier than up in the sky.”</p><p>Her sisters came rushing round her, and begged her to go back home to the sky with them; but she looked into the young man’s eyes, and said she would go with him wherever he went. So the other maidens went weeping and wailing up into the sky, and High-feather took his Star-wife home to his tent on the bank of the Battle River.</p><p>High-feather’s mother was glad to see them both; but she whispered in his ear: “You must never let her out of your sight if you want to keep her; you must take her with you everywhere you go.”</p><p>And he did so. He took her with him every time he went hunting, and he made her a bow and arrows, but she would never use them; she would pick wild strawberries and gooseberries and raspberries as they went along, but she would never kill anything; and she would never eat anything that any one else had killed. She only ate berries and crushed corn.</p><p>One day, while the young man’s wife was embroidering feather stars on a dancing-cloth, and his mother was gossiping in a tent at the end of the village, a little yellow bird flew in and perched on High-feather’s shoulder, and whispered in his ear:</p><p>“There is a great flock of wild red swans just over on Loon Lake. If you come quickly and quietly you can catch them before they fly away; but do not tell your wife, for red swans cannot bear the sight of a woman, and they can tell if one comes within a mile of them.”</p><p>High-feather had never seen or heard of a red swan before; all the red feathers he wore he had had to paint. He looked at his wife, and as she was sewing busily and looking down at her star embroidering he thought he could slip away and get back before she knew he had gone. But as soon as he was out of sight the little yellow bird flew in and perched on her shoulder, and sang her such a beautiful song about her sisters in the sky that she forgot everything else and slipped out and ran like the wind, and got to the dancing ring just as her sisters came down in their basket. Then they all gathered round her, and begged her to go home with them.</p><p>But she only said, “High-feather is a brave man, and he is very good to me, and I will never leave him.”</p><p>When they saw they could not make her leave her husband, the eldest sister said: “If you must stay, you must. But just come up for an hour, to let your father see you, because he has been mourning for you ever since you went away.”</p><p>The Star-wife did not wish to go, but she wanted to see her father once more, so she got into the basket and it sailed away up into the sky. Her father was very glad to see her, and she was very glad to see him, and they talked and they talked till the blue sky was getting gray. Then she remembered that she ought to have gone home long before.</p><p>“Now I must go back to my husband,” she said.</p><p>“That you shall never do!” said her father.</p><p>And he shut her up in a white cloud and said she should stay there till she promised never to go back to the prairie. She begged to be let out, but it was no use.</p><p>Then she began to weep; and she wept so much that the cloud began to weep too, and it was weeping itself quite away. So her father saw she would go down to the earth in rain if he kept her in the cloud any longer, and he let her out.</p><p>“What must I do for you,” he said, “to make you stay with us here and be happy?”</p><p>“I will not stay here,” she said, “unless my husband comes and lives here too.”</p><p>“I will send for him at once,” said her father. So he sent the basket down empty, and it rested in the middle of the dancing ring.</p><p>Now when High-feather reached Loon Lake he found it covered with red swans. He shot two with one arrow, and then all the rest flew away. He picked up the two swans and hurried back to his tent, and there lay the dancing-cloth with the feather stars on it half finished, but no wife could he see. He called her, but she did not answer. He rushed out, with the two red swans still slung round his neck and hanging down his back, and ran to the dancing ring, but nobody was there.</p><p>“I will wait till she comes back,” he said to himself, “if I have to wait till the world ends.” So he threw himself down on the grass and lay looking up at the stars till he went to sleep.</p><p>Early in the morning he heard a rustling on the grass, and when he opened his eyes he saw the great basket close beside him. He jumped up, with the two red swans still slung round his neck, and climbed into the basket. There was nobody there; and when he began to climb out again he found that the basket was half way up to the sky. It went up and up, and at last it came into the Star-country, where his wife was waiting for him. Her father gave them a beautiful blue tent to live in, and High-feather was happy enough for a while; but he soon grew tired of the cloud-berries that the Star-people ate, and he longed to tramp over the solid green prairie, so he asked his wife’s father to let him take her back to the earth.</p><p>“No,” said the Star-man, “because then I should never see her again. If you stay with us you will soon forget the dull old earth.”</p><p>The young man said nothing; but he put on the wings of one of the red swans, and he put the other red swan’s wings on his wife, and they leapt over the edge of the Star-country and flew down through the air to the prairie, and came to the tent where High-feather’s mother was mourning for them; and there was a great feast in the village because they had come back safe and sound. The Star-wife finished embroidering her dancing-cloth that day; and whenever the Indians danced she danced with them. She never went back to the Star-maidens’ dancing ring; but she still lived on berries and corn, because she would never kill anything,—except one thing, and that was the little yellow bird. It flew into the tent one day when High-feather had his back turned, and began to whisper into the Star-wife’s ear; but it never came to trouble her again.</p>"}