{"title": "Stingy Jack and the Jack O’Lantern", "author": "Pat St. Pierre", "level": "3 to 5,6 to 8,", "category": "Halloween,", "tag": "", "length": "01 - 05 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Pumpkin-Farm-opt.jpg'></img><p>“Daddy,” shouted Dylan Joseph, “how many more days until Fall Festival?”</p><p>“Two more weeks,” said Dad.</p><p>“I can’t wait,” said Dylan Joseph. “Mommy promised to take me to the store to pick out a costume.”</p><p>This Fall Festival was especially exciting for Dylan Joseph. In school there was going to be a Halloween party with a parade.  They were also going to carve out a pumpkin.</p><p>“Do Jack O’Lanterns grow with a funny face?” asked Dylan Joseph.</p><p>“No,” answered Dad. Jack O’Lanterns start out as pumpkins. “Remember went we went to the farm and we saw all those pumpkins on the ground.”</p><p>“But how do pumpkins become Jack O’Lanterns?” asked Dylan Joseph.</p><p>“We carve the faces into them.”</p><p>“Why?” Dylan Joseph asked</p><p>“Well,” said Dad, “the tradition started many years ago in Ireland. There was a story that people told, much like a fairy tale, about an old man, named Stingy Jack.”</p><p>“Tell me the story,” Dylan Joseph begged.</p><p>Dad sat down on the couch and Dylan Joseph climbed up and sat near him.</p><p>“Many years ago, there was an old man named Stingy Jack. Stingy Jack was always playing mean tricks on everyone. After Stingy Jack died, the story says that  he was forced to wander around in darkness because of his evil ways. In order for him to find his way in dark, Jack put a piece of coal into a carved out turnip to provide some light in the darkness.”</p><p>“And then what happened?” asked Dylan Joseph.</p><p>“Well,” said Dad, “the Irish people named a day called Hallows Eve. On that day they would carve out pumpkins rather than turnips, because they were larger, and they put lights in them to scare off evil spirits and to frighten Stingy Jack.”</p><p>“Are they’re still evil spirits today?” asked Dylan Joseph.</p><p>“No,” said Dad. “But each year on that certain day in October, the children dress up in costumes and carve pumpkins into Jack O’ Lanterns. Inside the Jack O’Lantern they place a light just like they did many years ago in Ireland. They do this to frighten the make-believe evil spirits and Stingy Jack,” said Dad.</p><p>“I’m going to carve the scariest face on my Jack O’Lantern.,” Dylan Joseph said. “I want to make sure I frighten Stingy Jack.”</p><p>“I’m sure it will,” Dad said and gave Dylan Joseph a great big hug.</p>"}