{"title": "The Story of Caliph Stork", "author": "", "level": "6 to 8,9 to12,", "category": "Arabian,Classic,Fairy Tale,Folk Tale,", "tag": "Owl,Stork,", "length": "05 - 10 mins,10 - 15 mins,", "body": "<p>CALIPH Charid, ruler of Bagdad, was reclining on his couch one pleasant afternoon, smoking his long pipe and sipping coffee from a handsome dish which a slave was holding for him, when his Grand Vizier (minister) Mansor, entered and told him of a peddler (seller) in the court below whose wares might interest him. The Caliph, being in an agreeable state of mind, summoned the peddler, who, delighted with the opportunity, displayed all the treasures of his pack. There were pearls, rings, silks, and many other rich things. The Caliph selected something for himself, a handsome present for the Vizier, and another for the Vizier’s wife.</p><p>Just as the peddler was putting the things back into his box, the Caliph noticed a small drawer and asked what it contained.</p><p>“Only something of no value, which I picked up in a street of Mecca,” the peddler replied. He thereupon opened the drawer and showed the Caliph a small box, containing a black powder and a scroll written in characters which neither the Caliph nor his Grand Vizier could make out. The Caliph immediately decided that he wanted this strange scroll, and the peddler was persuaded to part with it for a trifle. Then the Vizier was asked to find some one to decipher its meaning.</p><p>Near the mosque lived a man called Selim, who was so learned that he knew every language in the world. When the Vizier brought him to interpret the scroll, the Caliph said to him:</p><p>“They tell me that you are a scholar and can read all languages. If you can decipher what is written here, I shall know that it is true, and will give you a robe of honor; but if you fail, I shall have you punished with many strokes, because you are falsely named.”</p><p>Selim bowed at the feet of the Caliph, and then took the scroll. He had not looked at it long when he exclaimed:</p><p>“My lord and master, I hope to die if this is not Latin.”</p><p>“Well, if so, let us hear what it says,” the Caliph impatiently answered. Selim at once began:</p><p>“Let him who finds this box praise Allah. If he snuffs the powder it contains, at the same time pronouncing the word ‘Matabor,’ he will be transformed into any creature that he desires, and will understand the language of all animals. When he wishes to return to his own form, let him bow to the east three times, repeating the word ‘Matabor.’ But remember if, while he is bird or beast, he should laugh, the magic word would be forgotten, and the enchantment would be on him forever.”</p><p>The Caliph was delighted with the knowledge of Selim. He made him a splendid present, and told him to keep the secret. When he had dismissed the learned man, he turned to the Grand Vizier, and expressed a wish to try the powder.</p><p>“Come to-morrow morning early,” said he, “and we will go together to the country and learn what the animals are talking about.”</p><p>The Vizier came as he was ordered, and they left the palace without attendants. Beyond the town was a large pond where some handsome storks were often seen, and to this place they presently came. A grave and stately stork was hunting for frogs, while another flew about and kept him company.</p><p>“Most gracious lord,” said the Vizier, “what think you of these dignified long legs, and how would you like to know their chatter?”</p><p>The Caliph replied that the stork had always interested him, and he would very much like a more intimate acquaintance. Taking the box from his waistcoat, he helped himself to a pinch of snuff and offered it to the Vizier, who followed his example.</p><p>Together they cried “Matabor,” and instantly their beards disappeared, and feathers covered their bodies; their necks stretched out long and slender, and their legs shriveled into red and shapeless sticks. The Caliph lifted up his foot to stroke his beard in astonishment, but found a long bill in its place.</p><p>“By the beard of the Prophet, since I have not one of my own to swear by, but we are a pretty pair of birds, Mansor!”</p><p>“If I may say so, your Highness, you are equally handsome as a stork as when you were a Caliph,” replied the Vizier. “I see our two relations are conversing over there; shall we join them?”</p><p>When they came near to where the storks were smoothing their feathers and touching bills in the most friendly manner, this was the conversation they overheard, “Will you have some of my frog’s legs for breakfast, Dame Yellowlegs?” “No, thank you; I am obliged to practise a dance for my father’s guests, and cannot eat.” Thereupon Dame Yellowlegs stepped out, and began to pose most gracefully. The Caliph and the Vizier watched her, until she stood on one foot and spread her wings; then they both, at the same time, burst into such peals of laughter that the two storks flew away.</p><p>Suddenly, however, the Vizier ceased his mirth, and commenced bowing to the east. The Caliph recovered himself and did the same, but neither could think of the magic word.</p><p>“Mansor, just recall that unholy word, and I will become Caliph once more, and you my Grand Vizier. I have had enough of being a bird for one day.”</p><p>“Most gracious lord, that dancing stork has undone us, for, since laughing at her antics, I cannot remember the word that will restore us to human shape.”</p><p>So at last, in despair, the two unhappy birds wandered through the meadows. They appeased their hunger with fruits, for they could not bring themselves to eat frogs and lizards. As they dared not return to Bagdad and tell the people their humiliation, they flew over the city, and had the satisfaction of seeing signs of mourning and confusion. In a few days, however, while sitting on the roof of a house, they saw a splendid procession coming up the street, and the people welcoming the new ruler. “Hail! Hail Mirza, ruler of Bagdad!” they shouted.</p><p>The procession came nearer. At the head of it the Caliph saw a man dressed in scarlet and gold, riding a handsome horse. He at once recognized the new ruler as the son of his worst enemy.</p><p>“Behold,” said he, “the explanation of our enchantment! This is the son of Kaschnur, the magician, who is my great enemy, who seeks revenge. Let us not lose hope, but fly to the sacred grave of the Prophet and pray to be released from the spell.”</p><p>They at once spread their wings and soared away toward Medina, but not being accustomed to such long flights, they soon became very tired and descended to a ruin which stood in a valley below. The two enchanted birds decided to remain there for the night; then wandered through the deserted rooms and corridors, which gave of evidence of former splendor. Suddenly the Vizier stopped and remarked that if it were not ridiculous for a stork to be afraid of ghosts, he would feel decidedly nervous. The Caliph listened, and heard a low moaning and sobbing, which seemed to come from a room down the passage. He started to rush toward it, but the Vizier held him fast by a wing. He had retained the brave heart that he had possessed when a Caliph, however, and freeing himself from the Vizier’s bill, he hurried to the room from where came the pitiful sounds. The moon shone through a barred window and showed him a screech owl sitting on the floor of the ruined chamber, lamenting in a hoarse voice. The Vizier had cautiously moved up beside the Caliph; and at sight of the two storks, the screech owl uttered a cry of pleasure. To their astonishment it addressed them in Arabic, in the following words:</p><p>“I have abandoned myself to despair, but I believe my deliverance is near, for it was prophesied in my youth that a stork would bring me good fortune.”</p><p>The Caliph, thus appealed to, arched his neck most gracefully and replied:</p><p>“Alas! Screech Owl, I fear we are unable to aid you, as you will understand when you have heard our miserable story.”</p><p>He then related how the magician, Kaschnur, had changed them into storks and made his own son ruler of Bagdad. The screech owl became very much excited and exclaimed:</p><p>“How strange that misfortune should have come to us through the same man. I am Tusa, the daughter of the King of the Indies. The magician, Kaschnur, came one day to my father, to ask my hand in marriage for his son Mirza. My father ordered him thrown down stairs, and in revenge he managed to have me given a powder which changed me into this hideous shape. He then conveyed me to this lonely castle, and swore I should remain here until some one asked me to be his wife, and so freed me from the enchantment.”</p><p>At the conclusion of her story, the screech owl wept anew and would not be consoled. Suddenly, however, she wiped her eyes on her wing and said:</p><p>“I have an idea that may lead to our deliverance. Once every month the magician, Kaschnur, and his companions meet in a large hall at this castle, where they feast and relate their evil deeds. We will listen outside the door, and perhaps you may hear the forgotten word. Then, when you have resumed human form, one of you can ask to marry me, that I too may be freed from this wretched enchantment; and the prophecy that a stork would bring me happiness would be fulfilled.”</p><p>The Caliph and the Vizier withdrew and discussed the situation. “It is unfortunate,” said the Caliph, “but if we are to meet again, I think you will have to ask the screech owl to marry you.”</p><p>“Not so, your Highness, I already have a wife, and would rather remain a stork forever than take another; besides, I am an old man, while you are young and unmarried, and much better suited to a beautiful Princess.”</p><p>“That is it,” said the Caliph. “How do I know that she will not prove to be some old fright?” As the Vizier was firm, the Caliph at last said he would take the chances and do as the screech owl required.</p><p>That very night it so happened that the magicians met at the ruined castle. The screech owl led the two storks through difficult passages till they came to a hole in the wall, through which they could plainly see all that transpired in the lighted hall. Handsomely carved pillars adorned the room, and a table was spread with many dishes. About the table sat eight men, among whom was their enemy, the magician. He entertained the company with many stories, and at last came to his latest—that of turning the Caliph and Vizier into storks—in relating which he pronounced the magic word. The storks did not wait to hear more, but ran to the door of the castle. The screech owl followed as fast as she could, and when the Caliph saw her he exclaimed:</p><p>“To prove my gratitude, O our deliverer! I beg you to take me for your husband.”</p><p>Then the two storks faced the rising sun, and bowed their long necks three times. “Matabor!” they solemnly cried, together; and in an instant they were no longer storks, but stood before each other in their natural forms. In their joy they fell on each other’s necks and forgot all about the screech owl, until they heard a sweet voice beside them, and turning beheld a beautiful Princess. When the Caliph recovered from his astonishment he said that he was now, indeed, enchanted and hoped to remain so always.</p><p>They then started at once for the gate of Bagdad; and when they arrived, the people were overjoyed, for they had believed their ruler dead. The magician was taken to the ruined castle and thrown into jail, and his son was given the choice of the black powder or prison. Choosing the powder, he was changed into a stork, and was kept in the palace gardens.</p><p>Caliph Charid and the Princess were married; and when their children grew old enough, the Caliph often amused them with imitations of the Grand Vizier when he was a stork,—while Mansor sat smiling and pulling his long beard.</p>"}