{"title": "The Story of King Frost", "author": "", "level": "6 to 8,9 to12,", "category": "Classic,Fairy Tale,Folk Tale,Russian,", "tag": "", "length": "01 - 05 mins,", "body": "<p>A bad-tempered peasant woman had a daughter on whom she lavished everything she could get, and a stepdaughter whom she neglected and ill treated. In the mother’s eyes the daughter had no faults, while the stepdaughter was always blamed, and, try as she might, the poor girl never could please. So unhappy was she made that her eyes were often red from weeping. The sight of her tear-stained face only angered the stepmother the more, and caused her to say to the girl’s father:</p><p>“Send her away, old man. My eyes are tired of the sight of her, and my ears of the sound of her voice. Send her out of the house.”</p><p>The father begged to have his daughter remain, but the step-mother was determined to be rid of her, and gave him no peace. At last, when he could hold out against her no longer, he placed his daughter in a sledge and drove her to the open fields. Here he left her, with nothing to shield her from the bitter cold. Kissing her good-by, he drove away with tears in his eyes, not daring to look back at her.</p><p>Left alone by her father, the girl wandered across the bleak fields to the edge of the forest, where she sat down under a fir-tree and wept. A crackling sound caused her to look up, and she saw King Frost springing from one tree to another. When he reached the fir-tree he jumped down beside her with a bound. Snapping his fingers in her lovely face, he asked:</p><p>“Do you know who I am? I will tell you. I am King Frost.”</p><p>“Hail to you, great King!” smiled the maiden. “Have you come for me?”</p><p>“Are you warm, fair maiden?” he asked in answer.</p><p>“Yes, quite warm, King Frost,” the maiden replied, although she was shivering.</p><p>King Frost bent over her and snapped his fingers about her, until the air seemed full of needles. Again he asked, “Are you still warm, dear maiden?”</p><p>Her lips could scarcely move to utter the words, “Quite warm, King Frost.”</p><p>He snapped his teeth and cracked his fingers, till all the air was filled with stinging things. His eyes glistened and for the last time he asked, “Are you warm, now, beautiful maiden? Are you still warm, my dear?”</p><p>She was now scarcely able to speak, but managed to gasp, “Still warm, King Frost.”</p><p>The gentle girl’s patience and uncomplaining endurance caused King Frost to take pity on her suffering. He dressed her in a robe, embroidered in silver and gold, and decked her with sparkling diamonds. She glittered and shone, and was dazzling to behold. Then placing her in his sleigh, he wrapped her in furs; and six white horses bore them swiftly away.</p><p>The stepmother, at home, was baking pancakes for the girl’s funeral feast. “Go in the field,” she said to her husband, “and bring your daughter’s body home, so we can bury her.” The old man rose to obey, when the little dog barked to him:</p><p>The woman kicked the dog, then tried to coax it with a pancake, telling it to say:</p><p>When the little dog had swallowed the pancake, he barked:</p><p>The woman whipped the dog, then coaxed it with more pancakes; but the blows could not terrify it nor food persuade it to change it’s tune. It barked always the same. Suddenly the door opened, and a huge chest was thrust into the room, followed by the radiant stepdaughter, in a dress that dazzled them with its beauty.</p><p>As soon as the stepmother recovered from her astonishment, she ordered her husband to yoke the horses to the sledge, and take her own daughter to the field. “Take care you leave her in the same place,” the old woman cautioned. The father left the girl as he was told, and returned to his home.</p><p>She was not long alone when King Frost came by.</p><p>“Are you warm, maiden?” he asked.</p><p>“You must be a fool not to see that my hands and feet are nearly frozen,” she angrily replied.</p><p>The King danced in front of her, and cracked his fingers.</p><p>“Are you warm, maiden?” he asked her, over and over. She cried with rage, and called him rude names, until he froze the words on her lips, and she was dead.</p><p>The mother waited for her daughter’s return until she became impatient; then she told her husband to take the sledge and go for her. “But don’t lose the chest,” she added.</p><p>The dog under the table, barked:</p><p>The old woman was scolding the dog for telling lies, when the door opened. Rushing out to welcome her daughter and her treasures, she clasped the frozen body in her arms; and the chill of it killed her as well.</p>"}