{"title": "The Tale of Timmy Tiptoes", "author": "Beatrix Potter", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,", "tag": "Chipmunk,Squirrel,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/4-tb.jpg'></img><img src='https://xcx.mdavid.cn/img/8-tb.jpg'></img><p>Once upon a time there was a little fat comfortable grey squirrel, called Timmy Tiptoes. He had a nest thatched with leaves in the top of a tall tree; and he had a little squirrel wife called Goody.</p><img src='https://xcx.mdavid.cn/img/11-tb.jpg'></img><p>Timmy Tiptoes sat out, enjoying the breeze; he whisked his tail and chuckled—”Little wife Goody, the nuts are ripe; we must lay up a store for winter and spring.” Goody Tiptoes was busy pushing moss under the thatch—”The nest is so snug, we shall be sound asleep all winter.” “Then we shall wake up all the thinner, when there is nothing to eat in spring-time,” replied prudent Timothy.</p><img src='https://xcx.mdavid.cn/img/12-tb.jpg'></img><p>When Timmy and Goody Tiptoes came to the nut thicket, they found other squirrels were there already.</p><p>Timmy took off his jacket and hung it on a twig; they worked away quietly by themselves.</p><img src='https://xcx.mdavid.cn/img/15-tb.jpg'></img><p>Every day they made several journeys and picked quantities of nuts. They carried them away in bags, and stored them in several hollow stumps near the tree where they had built their nest.</p><img src='https://xcx.mdavid.cn/img/16-tb.jpg'></img><p>When these stumps were full, they began to empty the bags into a hole high up a tree, that had belonged to a wood-pecker; the nuts rattled down—down—down inside.</p><p>“How shall you ever get them out again? It is like a money-box!” said Goody.</p><p>“I shall be much thinner before spring-time, my love,” said Timmy Tiptoes, peeping into the hole.</p><img src='https://xcx.mdavid.cn/img/19-tb.jpg'></img><p>They did collect quantities—because they did not lose them! Squirrels who bury their nuts in the ground lose more than half, because they cannot remember the place.</p><p>The most forgetful squirrel in the wood was called Silvertail. He began to dig, and he could not remember. And then he dug again and found some nuts that did not belong to him; and there was a fight. And other squirrels began to dig,—the whole wood was in commotion!</p><img src='https://xcx.mdavid.cn/img/20-tb.jpg'></img><p>Unfortunately, just at this time a flock of little birds flew by, from bush to bush, searching for green caterpillars and spiders. There were several sorts of little birds, twittering different songs.</p><p>The first one sang—”Who’s bin digging-up my nuts? Who’s-been-digging-up my nuts?”</p><p>And another sang—”Little bita bread and-no-cheese! Little bit-a-bread an’-no-cheese!”</p><img src='https://xcx.mdavid.cn/img/23-tb.jpg'></img><p>The squirrels followed and listened. The first little bird flew into the bush where Timmy and Goody Tiptoes were quietly tying up their bags, and it sang—”Who’s-bin digging-up my nuts? Who’s been digging-up my-nuts?”</p><p>Timmy Tiptoes went on with his work without replying; indeed, the little bird did not expect an answer. It was only singing its natural song, and it meant nothing at all.</p><img src='https://xcx.mdavid.cn/img/24-tb.jpg'></img><p>But when the other squirrels heard that song, they rushed upon Timmy Tiptoes and cuffed and scratched him, and upset his bag of nuts. The innocent little bird which had caused all the mischief, flew away in a fright!</p><p>Timmy rolled over and over, and then turned tail and fled towards his nest, followed by a crowd of squirrels shouting—”Who’s-been digging-up my-nuts?”</p><img src='https://xcx.mdavid.cn/img/27-tb.jpg'></img><p>They caught him and dragged him up the very same tree, where there was the little round hole, and they pushed him in. The hole was much too small for Timmy Tiptoes’ figure. They squeezed him dreadfully, it was a wonder they did not break his ribs. “We will leave him here till he confesses,” said Silvertail Squirrel, and he shouted into the hole—</p><p>“Who’s-been-digging-up my-nuts?”</p><img src='https://xcx.mdavid.cn/img/28-tb.jpg'></img><p>Timmy Tiptoes made no reply; he had tumbled down inside the tree, upon half a peck of nuts belonging to himself. He lay quite stunned and still.</p><img src='https://xcx.mdavid.cn/img/31-tb.jpg'></img><p>Goody Tiptoes picked up the nut bags and went home. She made a cup of tea for Timmy; but he didn’t come and didn’t come.</p><p>Goody Tiptoes passed a lonely and unhappy night. Next morning she ventured back to the nut-bushes to look for him; but the other unkind squirrels drove her away.</p><p>She wandered all over the wood, calling—</p><p>“Timmy Tiptoes! Timmy Tiptoes! Oh, where is Timmy Tiptoes?”</p><img src='https://xcx.mdavid.cn/img/32-tb.jpg'></img><p>In the meantime Timmy Tiptoes came to his senses. He found himself tucked up in a little moss bed, very much in the dark, feeling sore; it seemed to be under ground. Timmy coughed and groaned, because his ribs hurted him. There was a chirpy noise, and a small striped Chipmunk appeared with a night light, and hoped he felt better?</p><p>It was most kind to Timmy Tiptoes; it lent him its night-cap; and the house was full of provisions.</p><img src='https://xcx.mdavid.cn/img/35-tb.jpg'></img><p>The Chipmunk explained that it had rained nuts through the top of the tree—”Besides, I found a few buried!” It laughed and chuckled when it heard Timmy’s story. While Timmy was confined to bed, it ‘ticed him to eat quantities—”But how shall I ever get out through that hole unless I thin myself? My wife will be anxious!” “Just another nut—or two nuts; let me crack them for you,” said the Chipmunk. Timmy Tiptoes grew fatter and fatter!</p><img src='https://xcx.mdavid.cn/img/36-tb.jpg'></img><p>Now Goody Tiptoes had set to work again by herself. She did not put any more nuts into the woodpecker’s hole, because she had always doubted how they could be got out again. She hid them under a tree root; they rattled down, down, down. Once when Goody emptied an extra big bagful, there was a decided squeak; and next time Goody brought another bagful, a little striped Chipmunk scrambled out in a hurry.</p><img src='https://xcx.mdavid.cn/img/39-tb.jpg'></img><p>“It is getting perfectly full-up down-stairs; the sitting-room is full, and they are rolling along the passage; and my husband, Chippy Hackee, has run away and left me. What is the explanation of these showers of nuts?”</p><p>“I am sure I beg your pardon; I did not know that anybody lived here,” said Mrs. Goody Tiptoes; “but where is Chippy Hackee? My husband, Timmy Tiptoes, has run away too.” “I know where Chippy is; a little bird told me,” said Mrs. Chippy Hackee.</p><img src='https://xcx.mdavid.cn/img/40-tb.jpg'></img><p>She led the way to the woodpecker’s tree, and they listened at the hole.</p><p>Down below there was a noise of nut crackers, and a fat squirrel voice and a thin squirrel voice were singing together—</p><p>“My little old man and I fell out,</p><p>How shall we bring this matter about?</p><p>Bring it about as well as you can,</p><p>And get you gone, you little old man!”</p><img src='https://xcx.mdavid.cn/img/43-tb.jpg'></img><p>“You could squeeze in, through that little round hole,” said Goody Tiptoes. “Yes, I could,” said the Chipmunk, “but my husband, Chippy Hackee, bites!”</p><p>Down below there was a noise of cracking nuts and nibbling; and then the fat squirrel voice and the thin squirrel voice sang—</p><p>“For the diddlum day</p><p>Day diddle dum di!</p><p>Day diddle diddle dum day!”</p><img src='https://xcx.mdavid.cn/img/44-tb.jpg'></img><p>Then Goody peeped in at the hole, and called down—”Timmy Tiptoes! Oh fie, Timmy Tiptoes!” And Timmy replied, “Is that you, Goody Tiptoes? Why, certainly!”</p><p>He came up and kissed Goody through the hole; but he was so fat that he could not get out.</p><p>Chippy Hackee was not too fat, but he did not want to come; he stayed down below and chuckled.</p><img src='https://xcx.mdavid.cn/img/47-tb.jpg'></img><p>And so it went on for a fortnight; till a big wind blew off the top of the tree, and opened up the hole and let in the rain.</p><p>Then Timmy Tiptoes came out, and went home with an umbrella.</p><img src='https://xcx.mdavid.cn/img/48-tb.jpg'></img><p>But Chippy Hackee continued to camp out for another week, although it was uncomfortable.</p><img src='https://xcx.mdavid.cn/img/51-tb.jpg'></img><p>At last a large bear came walking through the wood. Perhaps he also was looking for nuts; he seemed to be sniffing around.</p><img src='https://xcx.mdavid.cn/img/52-tb.jpg'></img><p>Chippy Hackee went home in a hurry!</p><img src='https://xcx.mdavid.cn/img/55-tb.jpg'></img><p>And when Chippy Hackee got home, he found he had caught a cold in his head; and he was more uncomfortable still.</p><img src='https://xcx.mdavid.cn/img/57-tb.jpg'></img><p>And now Timmy and Goody Tiptoes keep their nut-store fastened up with a little padlock.</p><img src='https://xcx.mdavid.cn/img/58-tb.jpg'></img><p>And whenever that little bird sees the Chipmunks, he sings—”Who’s-been-digging-up my-nuts? Who’s been digging-up my-nuts?” But nobody ever answers!</p><h2>THE END</h2>"}