{"title": "The Tale of Tom Kitten", "author": "Beatrix Potter", "level": "0 to 2,3 to 5,6 to 8,", "category": "Classic,Illustrated,", "tag": "Cat,Duck,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/tom04.jpg'></img><img src='https://xcx.mdavid.cn/img/tom05.jpg'></img><img src='https://xcx.mdavid.cn/img/tom08.jpg'></img><p>Once upon a time there were three little kittens, and their names were Mittens, Tom Kitten, and Moppet.</p><p>They had dear little fur coats of their own; and they tumbled about the doorstep and played in the dust.</p><p>But one day their mother—Mrs. Tabitha Twitchit—expected friends to tea; so she fetched the kittens indoors, to wash and dress them, before the fine company arrived.</p><img src='https://xcx.mdavid.cn/img/tom11.jpg'></img><img src='https://xcx.mdavid.cn/img/tom12.jpg'></img><p>First she scrubbed their faces (this one is Moppet).</p><p>Then she brushed their fur, (this one is Mittens).</p><img src='https://xcx.mdavid.cn/img/tom15.jpg'></img><img src='https://xcx.mdavid.cn/img/tom16.jpg'></img><p>Then she combed their tails and whiskers (this is Tom Kitten).</p><p>Tom was very naughty, and he scratched.</p><p>Mrs. Tabitha dressed Moppet and Mittens in clean pinafores and tuckers; and then she took all sorts of elegant uncomfortable clothes out of a chest of drawers, in order to dress up her son Thomas.</p><img src='https://xcx.mdavid.cn/img/tom19.jpg'></img><img src='https://xcx.mdavid.cn/img/tom20.jpg'></img><p>Tom Kitten was very fat, and he had grown; several buttons burst off. His mother sewed them on again.</p><p>When the three kittens were ready, Mrs. Tabitha unwisely turned them out into the garden, to be out of the way while she made hot buttered toast.</p><p>“Now keep your frocks clean, children! You must walk on your hind legs. Keep away from the dirty ash-pit, and from Sally Henny Penny, and from the pig-stye and the Puddle-Ducks.”</p><img src='https://xcx.mdavid.cn/img/tom23.jpg'></img><img src='https://xcx.mdavid.cn/img/tom24.jpg'></img><p>Moppet and Mittens walked down the garden path unsteadily. Presently they trod upon their pinafores and fell on their noses.</p><p>When they stood up there were several green smears!</p><p>“Let us climb up the rockery, and sit on the garden wall,” said Moppet.</p><p>They turned their pinafores back to front, and went up with a skip and a jump; Moppet’s white tucker fell down into the road.</p><img src='https://xcx.mdavid.cn/img/tom27.jpg'></img><img src='https://xcx.mdavid.cn/img/tom28.jpg'></img><p>Tom Kitten was quite unable to jump when walking upon his hind legs in trousers. He came up the rockery by degrees, breaking the ferns, and shedding buttons right and left.</p><p>He was all in pieces when he reached the top of the wall.</p><p>Moppet and Mittens tried to pull him together; his hat fell off, and the rest of his buttons burst.</p><img src='https://xcx.mdavid.cn/img/tom31.jpg'></img><img src='https://xcx.mdavid.cn/img/tom32.jpg'></img><p>While they were in difficulties, there was a pit pat paddle pat! and the three Puddle-Ducks came along the hard high road, marching one behind the other and doing the goose step—pit pat paddle pat! pit pat waddle pat!</p><p>They stopped and stood in a row, and stared up at the kittens. They had very small eyes and looked surprised.</p><img src='https://xcx.mdavid.cn/img/tom35.jpg'></img><img src='https://xcx.mdavid.cn/img/tom36.jpg'></img><p>Then the two duck-birds, Rebeccah and Jemima Puddle-Duck, picked up the hat and tucker and put them on.</p><p>Mittens laughed so that she fell off the wall. Moppet and Tom descended after her; the pinafores and all the rest of Tom’s clothes came off on the way down.</p><p>“Come! Mr. Drake Puddle-Duck,” said Moppet—”Come and help us to dress him! Come and button up Tom!”</p><img src='https://xcx.mdavid.cn/img/tom39.jpg'></img><img src='https://xcx.mdavid.cn/img/tom40.jpg'></img><p>Mr. Drake Puddle-Duck advanced in a slow sideways manner, and picked up the various articles.</p><p>But he put them on himself! They fitted him even worse than Tom Kitten.</p><p>“It’s a very fine morning!” said Mr. Drake Puddle-Duck.</p><img src='https://xcx.mdavid.cn/img/tom43.jpg'></img><img src='https://xcx.mdavid.cn/img/tom44.jpg'></img><p>And he and Jemima and Rebeccah Puddle-Duck set off up the road, keeping step—pit pat, paddle pat! pit pat, waddle pat!</p><p>Then Tabitha Twitchit came down the garden and found her kittens on the wall with no clothes on.</p><img src='https://xcx.mdavid.cn/img/tom47.jpg'></img><img src='https://xcx.mdavid.cn/img/tom48.jpg'></img><p>She pulled them off the wall, smacked them, and took them back to the house.</p><p>“My friends will arrive in a minute, and you are not fit to be seen; I am affronted,” said Mrs. Tabitha Twitchit.</p><p>She sent them upstairs; and I am sorry to say she told her friends that they were in bed with the measles; which was not true.</p><img src='https://xcx.mdavid.cn/img/tom51.jpg'></img><img src='https://xcx.mdavid.cn/img/tom52.jpg'></img><p>Quite the contrary; they were not in bed: not in the least.</p><p>Somehow there were very extraordinary noises over-head, which disturbed the dignity and repose of the tea party.</p><p>And I think that some day I shall have to make another, larger, book, to tell you more about Tom Kitten!</p><img src='https://xcx.mdavid.cn/img/tom55.jpg'></img><p>As for the Puddle-Ducks—they went into a pond.</p><p>The clothes all came off directly, because there were no buttons.</p><img src='https://xcx.mdavid.cn/img/tom57.jpg'></img><img src='https://xcx.mdavid.cn/img/tom58.jpg'></img><p>And Mr. Drake Puddle-Duck, and Jemima and Rebeccah, have been looking for them ever since.</p>"}