{"title": "The Tale of Ginger and Pickles", "author": "Beatrix Potter", "level": "0 to 2,3 to 5,6 to 8,", "category": "Classic,Funny,Illustrated,", "tag": "Cat,Dog,Hen,Mouse,Rabbit,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/ginger_cover1.png'></img><img src='https://xcx.mdavid.cn/img/ginger_cover2.png'></img><img src='https://xcx.mdavid.cn/img/grayp9.png'></img><img src='https://xcx.mdavid.cn/img/grayp11.png'></img><p>Once upon a time there was a village shop. The name over the window was “Ginger and Pickles.”</p><p>It was a little small shop just the right size for Dolls—Lucinda and Jane Doll-cook always bought their groceries at Ginger and Pickles.</p><p>The counter inside was a convenient height for rabbits. Ginger and Pickles sold red spotty pocket-handkerchiefs at a penny three farthings.</p><p>They also sold sugar, and snuff and galoshes.</p><p>In fact, although it was such a small shop it sold nearly everything—except a few things that you want in a hurry—like bootlaces, hair-pins and mutton chops.</p><p>Ginger and Pickles were the people who kept the shop. Ginger was a yellow tom-cat, and Pickles was a terrier.</p><p>The rabbits were always a little bit afraid of Pickles.</p><img src='https://xcx.mdavid.cn/img/ginger_fig13.jpg'></img><img src='https://xcx.mdavid.cn/img/grayp14.png'></img><p>The shop was also patronized by mice—only the mice were rather afraid of Ginger.</p><p>Ginger usually requested Pickles to serve them, because he said it made his mouth water.</p><p>“I cannot bear,” said he, “to see them going out at the door carrying their little parcels.”</p><p>“I have the same feeling about rats,” replied Pickles, “but it would never do to eat our own customers; they would leave us and go to Tabitha Twitchit’s.”</p><p>“On the contrary, they would go nowhere,” replied Ginger gloomily.</p><p>(Tabitha Twitchit kept the only other shop in the village. She did not give credit.)</p><img src='https://xcx.mdavid.cn/img/grayp17.png'></img><img src='https://xcx.mdavid.cn/img/ginger_fig18.jpg'></img><p>Ginger and Pickles gave unlimited credit.</p><p>Now the meaning of “credit” is this—when a customer buys a bar of soap, instead of the customer pulling out a purse and paying for it—she says she will pay another time.</p><p>And Pickles makes a low bow and says, “With pleasure, madam,” and it is written down in a book.</p><p>The customers come again and again, and buy quantities, in spite of being afraid of Ginger and Pickles.</p><p>But there is no money in what is called the “till.”</p><img src='https://xcx.mdavid.cn/img/grayp21.png'></img><img src='https://xcx.mdavid.cn/img/ginger_fig22.jpg'></img><p>The customers came in crowds every day and bought quantities, especially the toffee customers. But there was always no money; they never paid for as much as a pennyworth of peppermints.</p><p>But the sales were enormous, ten times as large as Tabitha Twitchit’s.</p><img src='https://xcx.mdavid.cn/img/grayp24.png'></img><p>As there was always no money, Ginger and Pickles were obliged to eat their own goods.</p><p>Pickles ate biscuits and Ginger ate a dried haddock.</p><p>They ate them by candle-light after the shop was closed.</p><img src='https://xcx.mdavid.cn/img/grayp26.png'></img><p>When it came to Jan. 1st there was still no money, and Pickles was unable to buy a dog licence.</p><p>“It is very unpleasant, I am afraid of the police,” said Pickles.</p><p>“It is your own fault for being a terrier; I do not require a licence, and neither does Kep, the Collie dog.”</p><p>“It is very uncomfortable, I am afraid I shall be summoned. I have tried in vain to get a licence upon credit at the Post Office;” said Pickles. “The place is full of policemen. I met one as I was coming home.”</p><p>“Let us send in the bill again to Samuel Whiskers, Ginger, he owes 22/9 for bacon.”</p><p>“I do not believe that he intends to pay at all,” replied Ginger.</p><img src='https://xcx.mdavid.cn/img/ginger_fig29.jpg'></img><p>“And I feel sure that Anna Maria pockets things—Where are all the cream crackers?”</p><p>“You have eaten them yourself,” replied Ginger.</p><img src='https://xcx.mdavid.cn/img/grayp31.png'></img><p>Ginger and Pickles retired into the back parlour.</p><p>They did accounts. They added up sums and sums, and sums.</p><p>“Samuel Whiskers has run up a bill as long as his tail; he has had an ounce and three-quarters of snuff since October.”</p><p>“What is seven pounds of butter at 1/3, and a stick of sealing wax and four matches?”</p><p>“Send in all the bills again to everybody ‘with compts,'” replied Ginger.</p><img src='https://xcx.mdavid.cn/img/ginger_fig33.jpg'></img><img src='https://xcx.mdavid.cn/img/grayp34.png'></img><p>After a time they heard a noise in the shop, as if something had been pushed in at the door. They came out of the back parlour. There was an envelope lying on the counter, and a policeman writing in a note-book!</p><p>Pickles nearly had a fit, he barked and he barked and made little rushes.</p><p>“Bite him, Pickles! bite him!” spluttered Ginger behind a sugar-barrel, “he’s only a German doll!”</p><p>The policeman went on writing in his notebook; twice he put his pencil in his mouth, and once he dipped it in the treacle.</p><p>Pickles barked till he was hoarse. But still the policeman took no notice. He had bead eyes, and his helmet was sewed on with stitches.</p><img src='https://xcx.mdavid.cn/img/ginger_fig37.jpg'></img><p>At length on his last little rush—Pickles found that the shop was empty. The policeman had disappeared.</p><p>But the envelope remained.</p><img src='https://xcx.mdavid.cn/img/grayp38.png'></img><img src='https://xcx.mdavid.cn/img/grayp39.png'></img><p>“Do you think that he has gone to fetch a real live policeman? I am afraid it is a summons,” said Pickles.</p><p>“No,” replied Ginger, who had opened the envelope, “it is the rates and taxes, £3 19 11-3/4.”</p><p>“This is the last straw,” said Pickles, “let us close the shop.”</p><p>They put up the shutters, and left. But they have not removed from the neighbourhood. In fact some people wish they had gone further.</p><img src='https://xcx.mdavid.cn/img/grayp41.png'></img><p>Ginger is living in the warren. I do not know what occupation he pursues; he looks stout and comfortable.</p><img src='https://xcx.mdavid.cn/img/grayp43.png'></img><img src='https://xcx.mdavid.cn/img/ginger_fig44.jpg'></img><p>Pickles is at present a gamekeeper.</p><img src='https://xcx.mdavid.cn/img/grayp46.png'></img><p>The closing of the shop caused great inconvenience. Tabitha Twitchit immediately raised the price of everything a half-penny; and she continued to refuse to give credit.</p><p>Of course there are the tradesmen’s carts—the butcher, the fish-man and Timothy Baker.</p><p>But a person cannot live on “seed wigs” and sponge-cake and butter-buns—not even when the sponge-cake is as good as Timothy’s!</p><img src='https://xcx.mdavid.cn/img/grayp49.png'></img><p>After a time Mr. John Dormouse and his daughter began to sell peppermints and candles.</p><p>But they did not keep “self-fitting sixes”; and it takes five mice to carry one seven inch candle.</p><img src='https://xcx.mdavid.cn/img/ginger_fig51.jpg'></img><img src='https://xcx.mdavid.cn/img/grayp52.png'></img><p>Besides—the candles which they sell behave very strangely in warm weather.</p><img src='https://xcx.mdavid.cn/img/grayp53.png'></img><p>And Miss Dormouse refused to take back the ends when they were brought back to her with complaints.</p><p>And when Mr. John Dormouse was complained to, he stayed in bed, and would say nothing but “very snug;” which is not the way to carry on a retail business.</p><img src='https://xcx.mdavid.cn/img/grayp55.png'></img><img src='https://xcx.mdavid.cn/img/grayp56.png'></img><p>So everybody was pleased when Sally Henny Penny sent out a printed poster to say that she was going to re-open the shop—Henny’s Opening Sale! Grand co-operative Jumble! Penny’s penny prices! Come buy, come try, come buy!”</p><p>The poster really was most ‘ticing.</p><img src='https://xcx.mdavid.cn/img/ginger_fig58.jpg'></img><p>There was a rush upon the opening day. The shop was crammed with customers, and there were crowds of mice upon the biscuit canisters.</p><p>Sally Henny Penny gets rather flustered when she tries to count out change, and she insists on being paid cash; but she is quite harmless.</p><img src='https://xcx.mdavid.cn/img/grayp60.png'></img><p>And she has laid in a remarkable assortment of bargains.</p><p>There is something to please everybody.</p>"}