{"title": "The Tale of Mr. Jeremy Fisher", "author": "Beatrix Potter", "level": "0 to 2,3 to 5,6 to 8,", "category": "Classic,Funny,Illustrated,", "tag": "Fish,Frog,", "length": "05 - 10 mins,", "body": "<h2>THE END</h2><img src='https://xcx.mdavid.cn/img/jf04.jpg'></img><p class=\"text-for-image drop-caps\">Once upon a time there was a frog called Mr. Jeremy Fisher; he lived in a little damp house amongst the buttercups at the edge of a pond.</p><img src='https://xcx.mdavid.cn/img/jf05.jpg'></img><p>The water was all slippy-sloppy in the larder and in the back passage.<br/> But Mr. Jeremy liked getting his feet wet; nobody ever scolded him, and he never caught a cold!</p><img src='https://xcx.mdavid.cn/img/jf06.jpg'></img><p>He was quite pleased when he looked out and saw large drops of rain, splashing in the pond—</p><img src='https://xcx.mdavid.cn/img/jf07.jpg'></img><p>“I will get some worms and go fishing and catch a dish of minnows for my dinner,” said Mr. Jeremy Fisher. “If I catch more than five fish, I will invite my friends Mr. Alderman Ptolemy Tortoise and Sir Isaac Newton. The Alderman, however, eats salad.”</p><img src='https://xcx.mdavid.cn/img/jf08.jpg'></img><p>Mr. Jeremy put on a macintosh, and a pair of shiny goloshes; he took his rod and basket, and set off with enormous hops to the place where he kept his boat.</p><img src='https://xcx.mdavid.cn/img/jf09.jpg'></img><p>The boat was round and green, and very like the other lily-leaves. It was tied to a water-plant in the middle of the pond.</p><img src='https://xcx.mdavid.cn/img/jf10.jpg'></img><p>Mr. Jeremy took a reed pole, and pushed the boat out into open water. “I know a good place for minnows,” said Mr. Jeremy Fisher.</p><img src='https://xcx.mdavid.cn/img/jf11.jpg'></img><p>Mr. Jeremy stuck his pole into the mud and fastened the boat to it.<br/> Then he settled himself cross-legged and arranged his fishing tackle. He had the dearest little red float. His rod was a tough stalk of grass, his line was a fine long white horse-hair, and he tied a little wriggling worm at the end.</p><img src='https://xcx.mdavid.cn/img/jf12.jpg'></img><p>The rain trickled down his back, and for nearly an hour he stared at the float.<br/> “This is getting tiresome, I think I should like some lunch,” said Mr. Jeremy Fisher.</p><img src='https://xcx.mdavid.cn/img/jf13.jpg'></img><p>He punted back again amongst the water-plants, and took some lunch out of his basket.<br/> “I will eat a butterfly sandwich, and wait till the shower is over,” said Mr. Jeremy Fisher.</p><img src='https://xcx.mdavid.cn/img/jf14.jpg'></img><p>A great big water-beetle came up underneath the lily leaf and tweaked the toe of one of his goloshes.<br/> Mr. Jeremy crossed his legs up shorter, out of reach, and went on eating his sandwich.</p><img src='https://xcx.mdavid.cn/img/jf15.jpg'></img><p>Once or twice something moved about with a rustle and a splash amongst the rushes at the side of the pond.<br/> “I trust that is not a rat,” said Mr. Jeremy Fisher; “I think I had better get away from here.”</p><img src='https://xcx.mdavid.cn/img/jf16.jpg'></img><p>Mr. Jeremy shoved the boat out again a little way, and dropped in the bait. There was a bite almost directly; the float gave a tremendous bobbit!<br/> “A minnow! a minnow! I have him by the nose!” cried Mr. Jeremy Fisher, jerking up his rod.</p><img src='https://xcx.mdavid.cn/img/jf17.jpg'></img><p class=\"text-for-image\">But what a horrible surprise! Instead of a smooth fat minnow, Mr. Jeremy landed little Jack Sharp the stickleback, covered with spines!</p><img src='https://xcx.mdavid.cn/img/jf18.jpg'></img><p>The stickleback floundered about the boat, pricking and snapping until he was quite out of breath. Then he jumped back into the water.</p><img src='https://xcx.mdavid.cn/img/jf19.jpg'></img><p>And a shoal of other little fishes put their heads out, and laughed at Mr. Jeremy Fisher.</p><img src='https://xcx.mdavid.cn/img/jf20.jpg'></img><p>And while Mr. Jeremy sat disconsolately on the edge of his boat—sucking his sore fingers and peering down into the water—a <i>much</i> worse thing happened; a really <i>frightful</i> thing it would have been, if Mr. Jeremy had not been wearing a macintosh!</p><img src='https://xcx.mdavid.cn/img/jf21.jpg'></img><p>A great big enormous trout came up—ker-pflop-p-p-p! with a splash—and it seized Mr. Jeremy with a snap, “Ow! Ow! Ow!”—and then it turned and dived down to the bottom of the pond!</p><img src='https://xcx.mdavid.cn/img/jf22.jpg'></img><p>But the trout was so displeased with the taste of the macintosh, that in less than half a minute it spat him out again; and the only thing it swallowed was Mr. Jeremy’s goloshes.</p><img src='https://xcx.mdavid.cn/img/jf23.jpg'></img><p>Mr. Jeremy bounced up to the surface of the water, like a cork and the bubbles out of a soda water bottle; and he swam with all his might to the edge of the pond.</p><img src='https://xcx.mdavid.cn/img/jf24.jpg'></img><p>He scrambled out on the first bank he came to, and he hopped home across the meadow with his macintosh all in tatters.</p><img src='https://xcx.mdavid.cn/img/jf25.jpg'></img><p>“What a mercy that was not a pike!” said Mr. Jeremy Fisher. “I have lost my rod and basket; but it does not much matter, for I am sure I should never have dared to go fishing again!”</p><img src='https://xcx.mdavid.cn/img/jf26.jpg'></img><p>He put some sticking plaster on his fingers, and his friends both came to dinner. He could not offer them fish, but he had something else in his larder.</p><img src='https://xcx.mdavid.cn/img/jf27.jpg'></img><p>Sir Isaac Newton wore his black and gold waistcoat,</p><img src='https://xcx.mdavid.cn/img/jf28.jpg'></img><p>And Mr. Alderman Ptolemy Tortoise brought a salad with him in a string bag.</p><img src='https://xcx.mdavid.cn/img/jf29.jpg'></img><p>And instead of a nice dish of minnows—they had a roasted grasshopper with lady-bird sauce; which frogs consider a beautiful treat; but <i>I</i> think it must have been nasty!</p>"}