{"title": "The Tale of Mrs. Tiggy-winkle", "author": "Beatrix Potter", "level": "0 to 2,3 to 5,6 to 8,", "category": "Classic,Illustrated,", "tag": "Hedgehog,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/cover-tb.jpg'></img><img src='https://xcx.mdavid.cn/img/emblem-tb.jpg'></img><img src='https://xcx.mdavid.cn/img/4-tb.jpg'></img><img src='https://xcx.mdavid.cn/img/8-tb.jpg'></img><p>Once upon a time there was a little girl called Lucie, who lived at a farm called Little-town. She was a good little girl—only she was always losing her pocket-handkerchiefs!</p><p>One day little Lucie came into the farm-yard crying—oh, she did cry so! “I’ve lost my pocket-handkin! Three handkins and a pinny! Have you seen them, Tabby Kitten?”</p><img src='https://xcx.mdavid.cn/img/11-tb.jpg'></img><p>The Kitten went on washing her white paws; so Lucie asked a speckled hen—</p><p>“Sally Henny-penny, have you found three pocket-handkins?”</p><p>But the speckled hen ran into a barn, clucking—</p><p>“I go barefoot, barefoot, barefoot!”</p><img src='https://xcx.mdavid.cn/img/12-tb.jpg'></img><p>And then Lucie asked Cock Robin sitting on a twig.</p><p>Cock Robin looked sideways at Lucie with his bright black eye, and he flew over a stile and away.</p><p>Lucie climbed upon the stile and looked up at the hill behind Little-town—a hill that goes up—up—into the clouds as though it had no top!</p><p>And a great way up the hill-side she thought she saw some white things spread upon the grass.</p><img src='https://xcx.mdavid.cn/img/15-tb.jpg'></img><p>Lucie scrambled up the hill as fast as her stout legs would carry her; she ran along a steep path-way—up and up—until Little-town was right away down below—she could have dropped a pebble down the chimney!</p><img src='https://xcx.mdavid.cn/img/16-tb.jpg'></img><p>Presently she came to a spring, bubbling out from the hill-side.</p><p>Some one had stood a tin can upon a stone to catch the water—but the water was already running over, for the can was no bigger than an egg-cup! And where the sand upon the path was wet—there were foot-marks of a very small person.</p><p>Lucie ran on, and on.</p><img src='https://xcx.mdavid.cn/img/19-tb.jpg'></img><p>The path ended under a big rock. The grass was short and green, and there were clothes—props cut from bracken stems, with lines of plaited rushes, and a heap of tiny clothes pins—but no pocket-handkerchiefs!</p><p>“Lily-white and clean, oh!</p><p>With little frills between, oh!</p><p>Smooth and hot—red rusty spot</p><p>Never here be seen, oh!”</p>"}