{"title": "Tale of Sephrenia", "author": "Salva Piera", "level": "6 to 8,9 to12,", "category": "Fairy Tale,Fantasy,Modern,Original,", "tag": "Parakeet,", "length": "01 - 05 mins,", "body": "<p>Once upon a time, not long, long ago, there was a good little fairy of name Sephrenia, who loved marshmallows with a big cup of hot chocolate. Every afternoon at five o’clock she rewarded herself that way in the company of her best friends, having such  a great time together. She was not only a good little fairy, she was also a very joyful and funny one, though probably a bit naughty too.</p><p>But Sephrenia was not completely happy. Our good little fairy did not know what was to get a truly and sincere hug: she was dying for a day when a generous soul, without asking for anything in exchange, spontaneously cuddled her whispering  sweet words into her ears.</p><p>“It is not easy to be a good fairy” – she said one day, talking out loudly to herself, without being aware of a tiny parakeet with blue and green feathers that just arrived to her windowsill. “Everybody wants me to do good things for them because I am a good fairy, but nobody ever thinks for a moment that I also need a bit of affection” – she kept talking and breaking into tears. “Waaaah, waaaah!”</p><p>“Let me drink one of your tears” – said suddenly the parakeet.</p><p>“Who is there!?” – exclaimed Sephrenia with surprise, looking at the window. “Oh, you little parakeet! Why do you want to drink one of my tears?” – she asked.</p><p>“All the birds in the forest know that doesn’t exist in the whole world a most refreshing nectar than the tears of a good fairy” – replied the parakeet.</p><p>“I am sad, parakeet, can’t you see it? Today I’m not in the mood of doing good actions. Please, leave me alone!” – commanded the little fairy.</p><p>“Sephrenia, I want to hug you” – said the parakeet jumping to a small  crystal table next to the window.</p><p>“Ha, ha, ha! A hug? Do you want to hug me with those tiny wings?” – laughed Sephrenia with sarcasm. “Don’t be silly my dear parakeet. Please, LEAVE!!!”</p><p>Then the parakeet, feeling heartbroken, flew away and Sephrenia kept crying desperately. After a while her sister arrived, the nymph of Enchanted Love, who, seeing Sephrenia in such a state, decided, worried, to bring her to visit Bruno the Dwarf, the wisest between all the dwarfs in the kingdom.</p><p>“Ehem, ehem, ehem, what do we have here?” – said Bruno while adjusting his big glasses and climbing to the highest of a pile of boxes with dried tobacco. Taking a few drags off his old pipe, he looked at Sephrenia with great interest…, and looked…, and suddenly said: “So! What a contradiction! You are a good fairy, aren’t you!? How can you be soooo saaaad?”</p><p>“I’m tired, wise dwarf, of being a good fairy and never get a demonstration of sincere affection” confessed our little poor fairy with her little soggy face. “I need somebody to hug me!” And she broke into tears again. “Waaaah, waaaah!”</p><p>“Ehem, ehem” – muttered the dwarf, observing how a puddle of tears was forming at the feet of Sephrenia. “You must learn, my dear, to better discern to whom you do good. You don’t need to do good to everybody. Do you?”</p><p>And our good little fairy continued crying, and crying, and the puddle at her feet was getting bigger, and bigger. In the meanwhile,  some little birds from the forest heard the sobs from the tower and, out of curiosity, came to see what was going on. Upon arriving and seeing that it was a good fairy, and the puddle of tears at her feet, they could not resist themselves to the temptation of coming closer and drink. As soon  as the birds tasted the tears they became transformed into beautiful boys and girls who hugged Sephrenia all at once. Gladly amazed she transmuted  her tears into laughs of real joy.</p><p>Right then the memory of the parakeet with blue and green feathers that wanted to comfort her, and that she was so mean to refuse just a few hours earlier, popped up to her mind. In that precise moment…</p><p>“Let  me drink one of your tears”  – was heard. Everybody turned their faces towards the tower’s narrow window where the parakeet with blue and green feathers was standing.</p><p>“Please, parakeet, forgive me for being selfish and so rude with you this morning. You did not deserve it and I feel very sorry. Of course, you can drink now one of my tears” – Sephrenia said with a bit of shame. And a last tear rolled down her pinkish cheek.</p><p>With extreme ability the parakeet with blue and green feathers flew to Sephrenia’s face and drank her last tear of fresh nectar, being transformed into a tall and handsome youngster with blue and green clothes.</p><p>“Wow! For all my goody goodies! – exclaimed our astonished fairy with great excitement – “you are …, yes …, you are Prince of Lu!” And the Prince cuddled Sephrenia and whispered sweet loving words into her ears.</p><p>In this way Sephrenia and Prince of Lu, who had been bewitched by the witch of Flickering Sparks, met each other. And since that day they lived happily ever after, eating marshmallows with big cups of hot chocolate every afternoon at five o’clock.</p>"}