{"title": "The Emperor’s New Clothes", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,9 to12,", "category": "Audio,Classic,Fairy Tale,Funny,Instructional,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/image008-300x118.png'></img><p>Many, many years ago lived an emperor, who thought so much of new clothes that he spent all his money in order to obtain them. His only ambition was to be always well dressed. He did not care for his soldiers, and going to the theatre did not interest him. The only thing, in fact, he thought anything of was to go out and show himself off with new clothes as often as possible. He had a coat for every hour of the day. As often as you would say of a normal king “He is busy ruling the kingdom,” you could say of him, “The emperor is in his dressing-room trying on new gear.”</p><p>The great city where he lived was a very busy place, every day many strangers from all parts of the globe arrived. One day, two swindlers came to this city and pretended to everyone that they were weavers. They said that they could make the finest cloth anyone could imagine. Their colours and patterns, they said, were not only very beautiful, but were made of a special material invisible to any person who was stupid.</p><p>That must be wonderful cloth, thought the emperor. If I were to be dressed in a suit made of this cloth I would be able to find out which people in my kingdom are stupid and therefore should not be in their jobs. I must have this cloth made for me without delay.</p><p>And he gave a large sum of money to those rascals, in advance, so that they should get to work immediately. They set up two looms and pretended to be very hard at work. They asked for the finest silk and the most precious gold-cloth. All the expensive material they got they hid away for themselves and worked at the empty looms till late at night.</p><p>I’d love to know how they are getting on with the cloth, thought the emperor. But he felt worried when he remembered that anyone who couldn’t see it was stupid. He thought that of course he would be able to see it, but decided to send someone else first to check it out, just in case. Everybody in the town knew how remarkable the clothes were and were dying to see how bad or stupid their neighbours were.</p><p>I shall send my honest old minister to the weavers, thought the emperor. He can see how it looks, for he is very clever.</p><p>The good old minister went into the room where the swindlers sat before the empty looms. Goodness gracious! he thought and opened his eyes wide, I cannot see anything at all, but he did not say so. Both swindlers told him to come near and asked him if he did not admire the lovely pattern and the beautiful colours, pointing to the empty looms. The poor old minister tried his very best, but he could see nothing, for there was nothing to be seen. Oh dear, he thought, Can I be so stupid? I would never have thought so, and nobody must find out! Is it possible that I am too stupid to do my job? No, I cannot admit that I wasn’t able to see the cloth.</p><p>“Have you got nothing to say?” said one of the swindlers, while he pretended to be busy weaving.</p><p>“Oh, it is very pretty, really beautiful,” replied the old minister looking through his glasses. “What a beautiful pattern, what brilliant colours! I will tell the emperor that I like the cloth very much.”</p><p>“We are pleased to hear that,” said the two weavers and described to him the colours and explained the curious pattern. The old minister listened carefully, so he would be able to tell the emperor what they said and so he did.</p><p>Now the swindlers asked for more money, silk and gold-cloth, which they said they required for weaving. They kept everything for themselves and not a thread came near the loom, but they continued, as before, to pretend to work at the empty looms.</p><p>Soon afterwards the emperor sent another good man to the weavers to see how they were getting on, and if the cloth was nearly finished. Like the old minister, he looked and looked but could see nothing, as there was nothing to be seen.</p><p>“Is it not a beautiful piece of cloth?” asked the two rascals, showing and explaining the fantastic pattern, which, however, did not exist.</p><p>I think I am not stupid, thought the man. Maybe I am not clever enough for my job. I must not let any one know that and he praised the cloth, which he did not see and praised the beautiful colours and the fine pattern. “It is very excellent,” he said to the emperor.</p><p>o — o — o</p><p>Everybody in the whole town talked about the precious cloth. At last the emperor wished to see it himself, while it was still on the loom. With a number of assistants, including the two who had already been there, he went to the two clever swindlers, who now worked as hard as they could, but without using any thread.</p><p>“Is it not magnificent?” said the two old men who had been there before. “Your Majesty must admire the colours and the pattern.” And then they pointed to the empty looms, for they expected that the others could see the cloth.</p><p>What is this? thought the emperor, I do not see anything at all. That is terrible! Am I stupid? Too stupid to be an emperor? That would indeed be the most terrible thing that could happen to me.</p><p>“Really,” he said, turning to the weavers, “your cloth is wonderful, really wonderful.”  He nodded contentedly as he looked at the empty loom, because he didn’t want to say that he couldn’t see anything. All his attendants, who were with him, looked and looked, and although they could not see anything more than the others, they said, like the emperor, “It is very beautiful.” And all advised him to wear the new magnificent clothes at a great procession which was soon to take place. “It is magnificent, beautiful, excellent,” they said. Everybody seemed to be delighted, and the emperor appointed the two swindlers “Imperial Court weavers.”</p><p>The whole night before the day on which the procession was to take place, these two rascals pretended to work, and burned more than sixteen candles. They wanted people to see that they were busy finishing the emperor’s new clothes. They pretended to take the cloth from the loom, and worked about in the air with big scissors, and sewed with needles without thread. At last they said: “The emperor’s new clothes are ready now.”</p><p>The emperor and all his barons then came to the hall. The swindlers held their arms up as if they held something in their hands and said: “These are the trousers!” “This is the coat!” and “Here is the cloak!” and so on. “They are all as light as a cobweb, so light in fact, that it feels as if you have nothing on at all, but that is just the beauty of the clothes.”</p><p>“Indeed!” said all the assistants, but they could not see anything, for there was nothing to be seen.</p><p>“Does it please your Majesty now to undress,” said the swindlers, “that we may help your Majesty in putting on the new suit in front of the mirror?”</p><p>The emperor undressed and the swindlers pretended to put the new suit on him, one piece after another. The emperor looked at himself in the glass from all sides.</p><p>“How well they look! How well they fit!” said all. “What a beautiful pattern! What fine colours! That is a magnificent suit of clothes!”</p><p>It was announced that it was time to start the procession.</p><p>“I am ready,” said the emperor. “Does not my suit fit me wonderfully?” Then he turned once more to the looking-glass, so that people would think he was admiring his clothes again.</p><p>Two boys were there to walk behind the emperor, to hold up the train of the emperor’s clothes, that is the material from his clothes that would otherwise trail behind on the ground. They stretched their hands to the ground as if they lifted up the train and pretended to hold something in their hands. They did not like people to know that they could not see or feel anything.</p><p>The emperor marched in the procession under a beautiful canopy and all who saw him in the street and out of the windows exclaimed: “Indeed, the emperor’s new suit is amazing! What a long train he has! How well it fits him!” Nobody wanted to admit they saw nothing, for then it would mean they were too stupid. Never were the emperor’s clothes more admired.</p><p>At last a little boy piped up. “But he has nothing on at all! He’s completely nude!”</p><p>“Good heavens! I’m sorry about that,” said the embarrassed father. “He’s just a simple boy who doesn’t know any better.” But soon, the whole crowd was whispering what the child had said.</p><p>“He does have nothing on at all!” cried all the people, realising the truth. The emperor suddenly realised they were right, but he thought to himself, Now I must keep pretending until the end or I’ll look even more stupid.</p><p>So the emperor tried to walk with even greater dignity, while the crowd laughed and teased him all the way to the end. Afterwards he sent his soldiers to arrest the two swindlers, but they had fled the city with all the money and precious material.</p><p>For the rest of his days, people joked about the time the emperor went for a parade with no clothes on and he never lived it down.</p>"}