{"title": "Thanks to Bubbles", "author": "Wendy Lee Klenetsky", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>One month before Jamie Lynne’s 10th birthday, a new restaurant opened in her neighborhood. Its name was “FUNTIME”. Jamie Lynne and her parents went for lunch at the place, and they liked what they ate and saw: “FUNTIME” had a GAMES ROOM with all kinds of games and plenty of good food. But the BEST thing about it, according to Jamie Lynne, was “BUBBLES THE CLOWN.” “BUBBLES” performed many fun tricks, and made the most BEAUTIFUL balloon animals and flowers.</p><p>“Mom and Dad,” Jamie Lynne said, “THIS is where I want my birthday party to be. I LOVE BUBBLES THE CLOWN.”</p><p>“We like this place, too, Jamie Lynne. Okay, we’ll tell the “FUNTIME” people that we want your birthday party here.”</p><p>“Oh THANK you, Mom and Dad. I can’t wait until my friends come here for my birthday,” Jamie said to them. “They’re going to LOVE BUBBLES THE CLOWN too.”</p><p>Jamie went home and mailed out her party invitations. Then she crossed the days off on her wall calendar. She couldn’t WAIT for her special day.</p><p>Well, the days went by quickly, and, before she knew it, it was 2 days before her party. Jamie Lynne was SO EXCITED talking about the party to her friends that she didn’t see the rock on the sidewalk ahead of her. Jamie Lynne tripped over the rock and fell hard on her ankle. She let out a SCREAM when she fell, and her friends ran to find the school principal for help. Mr. Sheldon, the principal, ran over to her, and called her parents and then called for an ambulance.</p><p>Jamie Lynne’s parents were at the hospital as the ambulance arrived. Jamie Lynne was taken to the emergency room, and before long, she was resting in a hospital bed. While her ankle was NOT broken, it WAS severely sprained. The doctor told Jamie Lynne and her parents that she had to rest in bed at home, and keep her foot up on pillows. He said that she could not go ANYWHERE for about one week. “But I’m having my birthday party at “FUNTIME” in 2 days. My FRIENDS will all be there, and BUBBLES THE CLOWN will be there, too!” Jamie Lynne cried.</p><p>The doctor looked at Jamie Lynne and held her hand. “You’re a VERY LUCKY girl, Jamie Lynne. You COULD have broken your ankle BADLY, but it’s just a bad sprain. If you rest up, you can be back at school and with your friends in a week.”</p><p>“But MOM, my PARTY..”</p><p>“It’s okay, Jamie Lynne”, her mother said. “We’ll work something out. Don’t worry!”</p><p>And that’s just what happened: Jamie Lynne’s parents cancelled the party at “FUNTIME”, and told Jamie Lynne’s friends to come to her house for the party. The house was decorated with streamers, confetti and balloons of every color. Her parents let Jamie Lynne choose what kind of food and cake she wanted for her party. Jamie Lynne and her friends were very happy with everything they saw and ate there. Then came the SURPRISE her parents had arranged for her: The doorbell rang, and who was there?? It was “BUBBLES THE CLOWN!”</p><p>Jamie Lynne let out a SCREAM, but THIS time it was a scream of happiness.</p><p>“Oh, Mom and Dad, I CAN’T BELIEVE that “BUBBLES THE CLOWN” is at my party! That’s AWESOME!! Thank you SOOOO much!!” Jamie Lynne yelled to her parents. She was VERY happy.</p><p>“BUBBLES THE CLOWN” did all the tricks she did at “FUNTIME”. Then she opened a big suitcase and took out her balloons and made the most BEAUTIFUL balloon animals and flowers that Jamie Lynne and her friends had ever seen!</p><p>“BUBBLES” then made a BIRTHDAY CROWN for Jamie Lynne. It was made of  gold balloons and decorated with shiny gold sprinkles. Jamie Lynne LOVED it. She gave “BUBBLES THE CLOWN” a great big hug to thank her for everything she did.</p><p>Then the time came for “BUBBLES” to leave, and for all of Jamie Lynne’s friends to go home.</p><p>“Jamie Lynne, THIS was the COOLEST party EVER! WOW, “BUBBLES THE CLOWN” came to YOUR HOUSE for your BIRTHDAY. That’s AWESOME!!! Bye now.See you Monday in school.”</p><p>And so, Jamie Lynne’s birthday party was over. But thanks to “BUBBLES”, and her parents, Jamie Lynne had the BEST BIRTHDAY she ever had!</p>"}