{"title": "The Wooden Horse", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Christmas,Classic,Fantasy,Illustrated,Original,", "tag": "Horse,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/illus-074.jpg'></img><h2><a id=\"THE_WOODEN_HORSE\" name=\"THE_WOODEN_HORSE\"></a>THE WOODEN HORSE</h2><p>Santa Claus left a whole lot of toys.</p><p>A wooden horse, covered with cotton and touched lightly with a paint brush dipped in black paint to give him a dappled gray appearance, was one of the presents.</p><img src='https://xcx.mdavid.cn/img/illus-073.jpg'></img><p>With the wooden horse came a beautiful red wagon with four yellow wheels. My! The paint was pretty and shiny.</p><p>The wooden horse was hitched to the wagon with a leather harness; and he, himself, stood proudly on a red base running on four little wheels.</p><p>It was true that the wooden horse’s eyes were as far apart as a camel’s and made him look quite like one when viewed from in front, but he had soft leather ears and a silky mane and tail.</p><p>He was nice to look at, was the wooden horse. All the dolls patted him and smoothed his silky mane and felt his shiny leather harness the first night they were alone with him in the nursery.</p><p>The wooden horse had a funny voice; the dolls could hardly understand him at first, but when his shyness wore off, he talked quite plainly.</p><p>“It is the first time I have ever tried to talk,” he explained when he got to know them, “and I guess I was talking down in my stomach instead of my head!”</p><p>“You will like it here in the nursery very much!” said Raggedy Andy. “We have such fun times and love each other so much I know you will enjoy your new home!”</p><p>“I am sure I will!” the wooden horse answered. “Where I came from, we—the other horses and myself—just stood silently on the shelves and looked and looked straight ahead, and never so much as moved our tails.”</p><img src='https://xcx.mdavid.cn/img/illus-076.jpg'></img><p>“See if you can move your tail now!” Henny, the Dutch doll, suggested.</p><p>The wooden horse started to roll across the nursery floor and if Raggedy Ann had not been in the way, he might have bumped into the wall. As it was, the wooden horse rolled against Raggedy Ann and upset her but could go no further when his wheels ran against her rag foot.</p><p>When the wooden horse upset Raggedy Ann, he stood still until Uncle Clem and Henny and Raggedy Andy lifted him off Raggedy Ann’s feet. “Did I move my tail?” he asked when Raggedy Ann stood up and smoothed her apron.</p><p>“Try it again!” said Raggedy Ann. “I couldn’t see!” She laughed her cheery rag doll laugh, for Raggedy Ann, no matter what happened, never lost her temper.</p><p>The wooden horse started rolling backward at this and knocked Henny over upon his back, causing him to cry “Mama!” in his squeaky voice.</p><p>Uncle Clem, Raggedy Ann, and the tin soldier all held to the wooden horse and managed to stop him just as he was backing out of the nursery door towards the head of the stairs.</p><p>Then the dolls pulled the wooden horse back to the center of the room. “It’s funny” he said, “that I start moving backward or forward when I try to move my tail!”</p><p>“I believe it is because you have stood so long upon the shelf without moving,” Raggedy Andy suggested. “Suppose you try moving forward!”</p><p>Uncle Clem, who was standing in front of the wooden horse, jumped to one side so hastily his feet slipped out from under him, just as if he had been sliding upon slippery ice.</p><p> </p><img src='https://xcx.mdavid.cn/img/illus-077.jpg'></img><p>The wooden horse did not start moving forward as Uncle Clem had expected; instead, his silky tail moved up over his back.</p><p>“Whee! There, you moved your tail!” cried all the dolls as joyfully as if the wooden horse had done something truly wonderful.</p><p>“It’s easy now!” said the wooden horse. “When I wish to go forward or backward I’ll try to move my tail and then I’ll roll along on my shiny wheels; then when I wish to move my tail I’ll try to roll forward or backward, like this!” But instead of rolling forward, the wooden horse moved his tail. “I wanted to move my tail then!” he said in surprise. “Now I’ll roll forward!” And sure enough, the wooden horse rolled across the nursery floor.</p><img src='https://xcx.mdavid.cn/img/illus-078.jpg'></img><p>When he started rolling upon his shiny wheels, Raggedy Andy cried, “All aboard!” and, taking a short run, he leaped upon the wooden horse’s back. Uncle Clem, Raggedy Ann, Henny, the Dutch doll and Susan, the doll without a head, all scrambled up into the pretty red wagon.</p><p>The wooden horse thought this was great fun and round and round the nursery he circled. His shiny wheels and the pretty yellow wheels of the red wagon creaked so loudly none of the dolls heard the cries of the tiny penny dolls who were too small to climb aboard. Finally, as the wagon load of dolls passed the penny dolls, Raggedy Andy noticed the two little midgets standing together and missing the fun; so, leaning ‘way over to one side as the horse swept by them, Raggedy Andy caught both the penny dolls in his strong rag arms and lifted them to a seat upon the broad back of the wooden horse.</p><p>“Hooray!” cried all the dolls when they saw Raggedy Andy’s feat. “It was just like a Wild West Show!”</p><p>“We must all have all the fun we can together!” said Raggedy Andy.</p><p>“Good for you!” cried Uncle Clem. “The more fun we can give each other, the more fun each one of us will have!”</p><p>The wooden horse made the circle of the nursery a great many times, for it pleased him very much to hear the happy laughter of the dolls and he thought to himself, “How happy I will be, living with such a fun crowd.”</p><img src='https://xcx.mdavid.cn/img/illus-079.jpg'></img><p>But just as he was about to pass the door, there was a noise upon the stairs and the wooden horse, hearing it, stopped so suddenly Raggedy Andy and the penny dolls went clear over his head and the dolls in the front of the wagon took Raggedy Andy’s seat upon the horse’s back.</p><p>They lay just as they fell, for they did not wish anyone to suspect that they could move or talk.</p><p>“Ha! Ha! Ha! I knew you were having a lot of fun!” cried a cheery voice.</p><p>At this, all the dolls immediately scrambled back into their former places, for they recognized the voice of the French doll.</p><p>But what was their surprise to see her dressed in a lovely fairy costume, her lovely curls flying out behind, as she ran towards them.</p><img src='https://xcx.mdavid.cn/img/illus-080.jpg'></img><p>Raggedy Andy was just about to climb upon the horse’s back again when the French doll leaped there herself and, balancing lightly upon one foot, stood in this position while the wooden horse rolled around the nursery as fast as he could go.</p><p>Raggedy Andy and the two penny dolls ran after the wagon and, with the assistance of Uncle Clem and Raggedy Ann, climbed up in back.</p><p>When the wooden horse finally stopped the dolls all said, “This is the most fun we have had for a long time!”</p><p>The wooden horse, a thrill of happiness running through his wooden body, cried, “It is the most fun I have ever had!”</p><p>And the dolls, while they did not tell him so, knew that he had had the most fun because he had given them the most pleasure.</p><p>For, as you must surely know, they who are the most unselfish are the ones who gain the greatest joy; because they give happiness to others.</p>"}