{"title": "The Silver Tree", "author": "Pat St. Pierre", "level": "3 to 5,6 to 8,9 to12,", "category": "Christmas,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>It was two weeks until Christmas. Trisha pressed her freckled nose against the living room window. No snow – only straw-colored ground.</p><p>“Is it snowing yet?” asked her sister, Amy.</p><p>“No,” replied Trisha. “Don’t you think if it were I’d tell everyone?”</p><p>“Get your coats, girls. We’re going to get our Christmas tree,” said their dad.</p><p>“Oh, goody,” replied Trisha.</p><p>“Somebody help me find my coat,” yelled Amy.</p><p>“Just hurry up,” said Trisha. Every year at Christmastime, Trisha, Amy, and their mom and dad went to a tree farm. It was a family tradition.</p><p>“Before we get our tree I thought we’d do some Christmas shopping,” said their mother.</p><p>“Great idea,” answered their dad.</p><p>Amy’s dark eyes beamed, “Maybe we can get some candy canes.”</p><p>When they arrived at the mall, Christmas was everywhere. Frosty the Snowman was playing on the loud speaker; candy canes and Christmas ornaments were hanging all around.</p><p>“Can we look in the toy department for a while?” asked Trisha.</p><p>“If you girls promise to stay there and wait for us,” answered Dad. Trisha and Amy took off and went from toy to toy. Overhead a sparkling vision caught Trisha’s eye.</p><p>“Oh, Amy,” she squealed as her blond ponytail dangled, “look at the beautiful, silver tree.” The bubbling Christmas lights gave the silver tree a magical look. “How it sparkles,” Trisha announced. “I wonder if we can buy it?”</p><p>“We don’t want a silver tree,” Amy said. Just then Trisha saw her parents. She ran toward them and shouted “Mom, Dad, look up here. Isn’t it beautiful?”</p><p>“Our pine tree will be beautiful also,” said Mom.</p><p>“It’s prettier than any green one. Can we buy it, please?” asked Trisha.</p><p>Dad looked at Mom, “Well,” he said and his voice trailed off.</p><p>“Trisha, dear, we always get a pine tree,” replied her mom.</p><p>“Please, can’t we buy this silver one instead,” begged Trisha.</p><p>“Trisha, our Christmas tradition is that we get a live tree,” said her dad and he turned and walked toward the cash register. As they left the department store, Trisha felt a lump in her throat. No silver tree and no snow.</p><p>When they arrived at the tree farm, Trisha didn’t want to walk around. Her father talked to her about Christmas spirit. He put his arm around her narrow shoulders, “We’ll have to hurry,” he said as he put on his gloves. “It looks like it might snow.”</p><p>When they found just the right tree, their dad cut it and tied it to the top of their car. “The smell of pine is awful. I think I’m going to get sick,” said Trisha.</p><p>“You can’t smell it inside the car,” answered Amy.</p><p>“Oh, yes, I can,” replied Trisha. When they arrived home, Trisha said grumpily, “I’m going to my room.” She lay down on her bed. She wondered how she could get her mom and dad to change their minds. A little later when their dad walked passed Trisha’s bedroom he found a piece of notepaper on the floor. He picked it up and read: Today I saw the most beautiful silver tree. I made a wish that we could get it for Christmas. </p><p>The following day Trisha and her Girl Scout troop went to help the seniors in the nursing home decorate a Christmas tree and wrap presents. After that they sang Christmas carols.</p><p>Trisha couldn’t help but notice the smiles when she handed out ornaments to a woman in a wheelchair. She thought about the silver tree. I guess Dad’s right, she thought. Christmas is really sharing. It doesn’t matter what kind of tree you have. It’s what’s in your heart that counts</p><p>The next evening after dinner their dad called out, “Girls, it’s time to decorate the tree. “I’ve already put on the new lights. Let’s get the ornaments and start decorating.”</p><p>When Trisha walked into the living room, her eyes opened wide. Instead of a green pine tree there stood a handsome silver tree. Trisha ran past a can of silver spray paint. “Oh, daddy,” she said, “a silver pine tree. It’s beautiful.” Outside a soft dusting of white snow could be seen. Maybe wishes really came true after all.</p>"}