{"title": "The Lost Cygnets", "author": "Patricia Kings", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Swan,", "length": "01 - 05 mins,", "body": "<p> The two swans glided across the placid lake, dipping their heads snatching insects that flew over the surface.  The sun shone through the trees making dancing patterns on the murky green water as little black water boatman swam about.</p><p>“What shall we do today Cedric?” hissed Sissy.</p><p>“Shall we take the children to the big river to watch the salmon play?” replied Cedric.</p><p>“Oh no it’s too far, where are they anyway?” She looked about craning her long neck. They had gone. “We will have to go and look for them, Cedric.”</p><p>They swam along the lake until they met Malic, a mallard.</p><p>“Have you seen Ciggy and Zola?” she asked.</p><p>“No,” he squawked, ruffling his green feathers, “are they lost?”</p><p>“Oh my, I hope they haven’t gone to the big river, anything could happen to them.” Sissy looked worried.</p><p>Freddy frog stretched out in the sun on the bank his green leathery skin sparkling.</p><p>“Have you seen Ziggy and Zola?”</p><p>“No,” he croaked, closing his big green eyes, “sorry I’m, sleeping,”</p><p>You’re not much help, she thought.  They glided to the mouth of the river, which became muddy. Reeds and tall grasses covered the surface, nothing like their lake. Shoals of silvery fish darted this way and that, their mouths agape.</p><p>“Have you seen two cygnets?” they asked the fish.</p><p>“No,” they bubbled.</p><p>In the fields cows were munching on the grass.</p><p>“Have you seen two cygnets?” asked Sissy.</p><p>“No,” mooed Maisy, a big nosed black and white cow. ”I’m too busy eating.”</p><p>Sissy backed away not liking these big creatures.  “Cedric what shall we do?” she asked him.</p><p>He hissed quietly trying to calm her.</p><p>They saw some sheep in the field.  “Have you seen some cygnets?” she asked.</p><p>“No, baa, we haven’t,” they replied.</p><p>A big black horse slurped noisily at the river bank.</p><p>“Have you seen two cygnets?” asked Sissy.</p><p>“Yes,” he neighed, shaking his head spraying water everywhere.  “They went that way,” he said, as he pointed his hoof along the river.</p><p>“There are some humans throwing bread, Sissy,” said Cedric.</p><p>“Shall we feed the swans mum?” asked  Tommy, one of the humans by the bank.</p><p>“Be careful, they look fierce,”  replied another human.</p><p>Sissy and Cedric gobbled hungrily, scattering the ducks.</p><p>A family of black moorhens with red beaks came to get a look in squeaking noisily.  The swans swam further on until they came to a boathouse with fishermen; they gave them a wide berth, not wanting to get hooked in their lines.</p><p>“Look Cedric, it must be the leaping salmon,” said Sissy.</p><p>The waterfall crashed loudly near to them, green and pink silvery fish were leaping over it. Their shiny bodies glinted in the sun.</p><p>“Oh dear I hope they haven’t gone over,” cried Sissy.</p><p>It was getting dusk now; the sun going down, cast a red glow on the water.</p><p>Ahead they saw a flash of grey and on the bank were two lads throwing stones at something.  Sissy saw it was Ziggy and Zola, two very frightened little cygnets.</p><p>“I’ll teach those two boys a lesson,” she hissed, fluming her wings and rushed up the bank menacingly.  The boys took one look and ran for their lives with Sissy on their heels.</p><p>“Come on, they won’t come back,” Cedric told the naughty cygnets.  They climbed on his back and made their way back to the lake.</p><p>They were soon fast asleep worn out by the adventure.</p>"}