{"title": "The Pig Farmer", "author": "M E Ryan", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,Folk Tale,Funny,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/The-Pig-Farmer-opt.jpg'></img><p> </p><p> There once was a poor boy named Philip who had nothing in this great big world other than a tiny plot of grass, five stinky pigs, an old, falling down shack, and a rickety fence surrounding it all.</p><p>Every morning Philip would feed the pigs then spend the rest of his day dreaming of a better life, where he was a prince who ruled over a kingdom.</p><p>Day after day he fed the pigs and dreamed, but his life never improved.  In fact, as time passed his grass turned brown, his pigs became even more stinky, and the shack finally did fall down.  The only thing he had going for him in this great big world was that the fence surrounding it all was still standing.</p><p>When Philip gathered together the tools he needed to fix the fallen down shack, he also took an inventory of what he had that might help him reach his dream of becoming a prince.</p><p>In his toolbox he had a saw, a hammer, and some old, rusty nails.  In his life all he had was his imagination, if you didn’t count the brown grass, stinky pigs, fallen down shack and the fence surrounding it all.</p><p>So with his imagination, Philip went to work.</p><p>Instead of repairing the shack, he built it better and stronger than before.  And he built it to look like a tiny castle.</p><p>When he finished with his castle he dug a tiny moat and filled it with water, which he used to water the grass and wash his stinky pigs.</p><p>He even repaired the fence that didn’t need repairing, so it would look more like the gates of the faraway kingdom, where the King lived with the Queen and their beautiful daughter, Princess Petunia.</p><p>Ahhh… Princess Petunia.  The most beautiful princess in the world.  Philip often dreamed of sharing his tiny kingdom with someone who made his heart sing and his soul dance.  And since he was now in the habit of making his dreams come true, he resolved to marry Princess Petunia.</p><p>Philip took inventory again.  The only things he had in his tiny kingdom that would impress a beautiful princess were a beautiful rose that grew under a tree on a nearby hill, and a nightingale who sang the most beautiful songs from a branch on that tree.</p><p>So Philip built two beautiful cages and set off that day for the faraway kingdom.</p><p>When he arrived, Philip presented the rose and the nightingale to the King, the Queen, and the Princess.</p><p>“I am Prince Philip,” he said.  “And I have come to–”</p><p>“From what kingdom?” asked the Queen.</p><p>“Um…” Philip said, for he had never actually thought of giving his tiny kingdom a name before.</p><p>“I am from the kingdom of Pigadelphia,” he said, although he was pretty sure that he was going to have to think of a better name.</p><p>Philip approached Princess Petunia and laid his two gifts at her feet.</p><p>“That is the most beautiful rose I have ever seen!”  shouted the Queen.</p><p>“That nightingale sings the most beautiful songs I have ever heard!” cried the King.</p><p>But Princess Petunia remained unimpressed.  “Hmmph,” she hmmphed in a way that did not make Philip’s heart sing or his soul dance.</p><p>“Put them with the others,” she said, waving her hand.</p><p>Philips turned in the direction of her wave and saw, stacked in the corner of the great hall, gifts of all shapes and sizes, and a long line of other princes who also wanted Princess Petunia’s hand in marriage.</p><p>“I haven’t made up my mind,” Princess Petunia said to her father as she looked out at the large assortment of gifts she had collected, “although I doubt I could ever marry a pig farmer.”</p><p>“I prefer the name Swineherd,” Philip said, correcting the princess, which was not often done by commoners.</p><p>Philip was invited to stay in the kingdom while Princess Petunia made up her mind.  But because so many others were competing for her attention, all they could provide him was a small room in the pig sty next to the castle.</p><p>His room was in even worse condition than his falling down shack had been.  And, if it was possible, the pigs next to his room were even stinkier.  But rather than sitting around and waiting, Philip began to repair the room and clean the stinky pigs and tend to the parts of his world that were in his control.</p><p>The next day one of the princess’s maidens, whose name was Persephone, came to tell Philip that the princess had still not made up her mind.</p><p>Every day, for weeks on end, Persephone would stop by to tell Philip that the princess had still not made up her mind.  And each day she would stay a little longer, walking with Philip, talking with Philip, and marveling at all that Philip had accomplished.</p><p>While he had been waiting, Philip had brought his own pigs to live with him in the sty.  He had opened up a little shop to sell his wares.  And he had begun making all sorts of the most wonderful inventions.</p><p>He created a large, metal pot with tiny, silver bells along the rim.  And whenever water was boiled in the pot, one could smell whatever was being cooked in any other pot in the kingdom.  Soups and breads, cakes and pies.  The most delicious of smells poured out of the pot.</p><p>He crafted a rattle, and whenever it was swung around it would play any song the holder of the rattle desired.</p><p>And he compiled a large assortment of figurines, assembled of wood and string and baling wire.  When they were would up they would set about any chore that Philip asked of them.</p><p>People came from far and wide to see Philip and his magical inventions, but not visitor was more important to him than Persephone.</p><p>One day, word of Philip’s accomplishments made their way to the King and Queen and Princess Petunia.  And after seeing all that Philip had done the King said, “Petunia, this is the boy you should choose to marry.  Look at how he has transformed a simple sty into a stable fit for a prince.”</p><p>Petunia just lifted her nose high into the air.</p><p>“It smells like chocolate chip cookies and waffles,” said the queen.  “And listen to the wonderful music!  This is the boy you should choose to marry.”</p><p>“I don’t think I could ever marry a pig farmer,” Petunia said.</p><p>“I prefer the name Swineherd,” Philip corrected.</p><p>“Hmmph,” Petunia hmmphed, standing on a stool so she could lift her nose even higher into the air.</p><p>And that was when she saw all of the mechanical marvels outside the shop, cleaning and building and doing chores.</p><p>“With servants like these,” Petunia said, “I would never have to lift a finger for the rest of my life!”</p><p>“But you don’t lift a finger now,” the King corrected.</p><p>“Hmmph!” said Petunia.</p><p>“So you have finally made up your mind?” asked the queen.</p><p>“Yes,” Petunia said, stepping down from her stool.</p><p>“Then I declare,” declared the king, “that tomorrow at noon there shall be a magnificent parade through all the streets of the kingdom.  And at the parade’s end, Princess Petunia will name the prince she wishes to marry!”</p><p>A great cheer went up from the crowd, for they truly and dearly loved parades.</p><p>When the King, Queen, and Princess left, Philip saw Persephone walking away, crying.</p><p>“Where are you going?” Philip asked.  “And why are you so sad?”</p><p>“Because you are to marry the princess.  She will undoubtedly choose you.”</p><p>“Well,” Philip told her. “The princess may have made up her mind today, but I made up my mind weeks ago.  Meet me here tomorrow, an hour before the parade.</p><p>The next morning, when Persephone arrived, Philip and his pigs and all of his magical inventions were packed up, wound up, and pointed towards the castle gates.</p><p>“Where are you going?”  Persephone asked.</p><p>“Back to my own kingdom, to marry a princess whom I choose, who makes my heart sing and my soul dance.”</p><p>Persephone blushed, for she knew that Philip meant her.</p><p>He helped her onto one of the pigs and together they travelled towards the gate.</p><p>Philip was so loved by the people that everyone came out of their houses to see where he was going.  And in short order Philip had started his own parade, out past the castle walls and all the way back to the tiny kingdom of Pigadelphia.</p><p>From that day on, from her cold, empty castle in a faraway land, Petunia sat in her tower, looking off into the distance, dreaming about a better life.</p><p>And from his small, perfect kingdom, Philip and Persephone spent their days making their dreams come true.</p>"}