{"title": "The Puzzle Maker", "author": "Nathan Oser", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,10 - 15 mins,", "body": "<p> It was spring, and everything was growing up. Karen didn’t let a thing pass unseen on the long walk to school–not the neighborhood cats grown fat from winter mice, nor the splashy colors of flowers in the once drab and icy pots and planters, nor the trees turned shady again. She skipped over dandelions wiggling free from cracks in the pavement and pricked her ears at crickets chirping in the hedges and buzzing bumblebees busy relearning how to make honey.</p><p>It wasn’t her first time walking the maze of narrow streets, but it was her first time as a third-grader.</p><p>In Karen’s town the new school year began in April–that month where the ground is always wet from morning showers and when everyone carries with them an umbrella, knowing if it’s not raining now it will be on the way home.</p><p>Karen had forgotten her umbrella this morning. It was easy to overlook things in the rush and excitement of the first day. Did she remember her name tag? There it was, pinned on her shirt. And her thermos of tea? Strapped to the outside of her backpack with her good luck charms. There were also her school shoes and all her new books. She had enough to carry without the umbrella.</p><p>At the corner she sniffed fresh-cut grass and ashy incense in the air. From between the houses she could see the cemetery on the hill, bright under the sun yet darkened by gray slabs of stone. She sped up past the small open gate. There’s nothing wrong with taking the long way around, she thought.</p><p>A half an hour later she spotted all her teachers from last year and a few new ones standing in a line at the school entrance. “Good morning,” they greeted the children. “Fine weather so far,” they said to neighbors passing by.</p><p>Karen waved at her friends as they changed into their school shoes in the front hallway. They waved back and called out, “Hurry up, Karen!” But before going through the gate Karen’s keen eyes spied a shimmer of light on the side of the road. It was a coin with the number 1 etched in the middle. She stopped and looked around at the other kids. Either they had all missed it or passed it up. I guess not many people take the time to pick up such a small amount of money, she thought. But I do! She gave the coin a quick polish on her denim skirt and dropped it in her pocket. She would add it to her savings.</p><p>Karen wasn’t hoping to buy anything in particular, so it was less of a savings and more of a collection. She didn’t have a piggy bank, besides. But she had stacks and stacks of the coins hidden away. She was proud of her hiding spot. What better place than the very top of the bookshelf where no one ever puts any books? She had to use the piano bench to reach, and so it never occurred to her that anyone else, like her parents, knew the coins were there.</p><p>Before the bell rang she stepped into her new classroom where all the same kids from the year before were busy doing all the same things they always did. The girls read romance comics and drew hearts or ice cream cones or baby chicks or stars (their personal symbols) next to their names on their notebooks. The boys played tag between the desks and went to feed the class beetle and the goldfish.</p><p>The first day was her favorite. Besides being able to see all her friends again, there were orientations, and teachers talked about spring break, and there was never any homework. The day flew by.</p><p>At the end of sixth period everyone raced to change back into their dirty sneakers and pull their umbrellas from the rack. Sometime after recess, huge gray pillows of rainclouds had blown in overhead, and it began to sprinkle.</p><p>“Do you need to borrow an umbrella?” Karen’s teacher asked.</p><p>“No, thank you.”</p><p>The teacher held out her palm and caught a couple of raindrops. “I don’t want you coming in with a cold tomorrow. I’d feel better if you used one of ours.”</p><p>“It’s just a drizzle. I don’t mind.”</p><p>“Okay, but be careful,” said the teacher with a smile, because she also knew it was fun sometimes to play in the rain.</p><p>Karen smiled back and was on her way.</p><p>Down the street she listened to the plip-plop of rain on the other kids’ umbrellas. She watched the little drops scatter here and there on the road, soaking into the concrete like a field of polka dots.</p><p>When everyone had turned down different paths, and Karen had turned down hers, she held out her arms and twirled on her toes. The rain felt cool on her skin. Again and again she looked up to the sky, so low she might have touched it if she jumped.</p><p>She wiped her face on her arm and glanced at the hill where the trees shook in the wind and the leaves danced. The grass between the gravestones rolled in waves. Then, in a flash and a boom, thunder cracked the clouds like eggshells, and out came the downpour.</p><p>Karen’s heart took a leap. It was as if she’d just clanked her way up the first rise of a roller coaster and was all at once free-falling down the other side.</p><p>Before she knew it she was soaked to the bone and still a long way from home. With a big gulp she ran between the houses to a small swinging gate and started up the lonely cemetery trail.</p><p>The straps on her backpack clapped up and down, and the tin pen case inside rattled like bones. She ran with her eyes clenched shut, splashed through puddles, and squeaked her shoes over wet grass. Another thunderbolt shook the sky and pulled open her eyes. She was surrounded by slabs of dark granite. There were so many tall gravestones written up and down with names and words that she couldn’t read. Some were polished and new and glistened under the rainwater. Others were ancient and worn down round as river stones.</p><p>The wind howled through the trees, and rain crackled in the leaves as she headed down the other side of the hill. She burst out of the gate and stopped to catch her breath. That wasn’t so scary! she thought once she’d made it through. And she smiled because she knew she could take the short cut any time she wanted now.</p><p>Karen didn’t recognize exactly where she was, but she saw her neighbor’s cat and knew her house was nearby if she took the right path. As she started down the street her eyes landed on a small house with a storefront in the first floor. The sign above the door read:</p><p>KEN’S WOODEN PUZZLES</p><p>There was a dry patch of street under the awning. She stood there with her hands on the glass, staring in at the wonderful displays of hand-painted, hand-carved standing puzzles.</p><p>She’d never seen anything like them and was surprised to find a place like this so close to her house. The puzzles were made of thick, wooden jigsaw pieces stacked up one upon the other. Painted on the face of each piece was a person or part of a picture.</p><p>On the top shelf she saw designs of kids on Field Day. They made human pyramids, played tug-of-war, walked blindfolded and carrying sticks to hit a giant watermelon as if it were a piñata, jumped rope ten people at a time, or stood behind snow cone stands. On the next shelf were long locomotives, old biplanes with three or four layers of striped wings, and hot air balloons drifting over hills and mountains. Then on the lowest shelf there were farm animals and safari animals and mythical dragons, all stretching out into the air yet held up by their own pieces.</p><p>But it was on the inside of the store that she spotted the neatest puzzle of all. It was a picture of a girl dressed up for a festival, carrying a sparkler in one hand and a skewer of pink, white, and green sweet dumplings in the other.</p><p>Karen slowly opened the door and entered the shop. There was a tinkling of a bell, and a man walked in from the back room. He took off his work gloves, brushed the wood shavings from his shirt, and said, “Hi, there.”</p><p>“Hi,” Karen said back.</p><p>“Do you like puzzles?”</p><p>“Yeah, but I’ve never seen puzzles like this before. I mean, I’ve seen 3D puzzles, but not quite like this.” Karen walked around, glancing at the different designs and the price tags. They all looked pretty expensive.</p><p>“Each one is hand-built,” said the man.</p><p>“I bet it takes a long time to make one.”</p><p>“Sure does. The more details, the more time it takes. But, you know, the more time it takes, the better you feel about it when it’s done. My name’s Ken, by the way.”</p><p>“Karen.” She smiled at the man and then walked up to the puzzle that had caught her eye. She saw it was missing a piece. The painted girl was looking up at something, but Karen didn’t know what. There was only an empty space in the sky above her.</p><p>“You like that one? Want me to wrap it up for you so it doesn’t get wet on the way home?”</p><p>“No, thank you. I don’t have enough money.”</p><p>The man leaned forward for a look at the price and mumbled, “How much is that one, again? 1,000?” He scratched his chin. “Well, it is missing a piece. What do you say we make it 700? No, 600? I’ll even hold it for you if you wanna come back later with your parents.”</p><p>“600?” Karen thought about her savings. “I’ll be right back!” she said, and burst out into the rain. She raced down the street and around the bend and past the hedges until she recognized some of the houses. She was home in no time.</p><p>She flung open the door, kicked off her shoes, and ran into the living room. Her mother called down from upstairs, “How was the first day of school, deary?”</p><p>“Great! I’ll be back!”</p><p>Leaving wet sock-prints on the piano bench and all the way back down the hall, Karen landed in her shoes and was fast on her way back to the wooden puzzle shop. This time she remembered her umbrella but couldn’t grab it with her hands so full.</p><p>Ken was still hanging around the front of the shop when Karen came back in and dropped a shirt-tail full of paper-thin coins down on the glass counter.</p><p>“That was quick,” the shop owner said. But when he saw the coins he folded his arms and titled his head. “Don’t think I can lower the price any more. And that’s the cheapest puzzle I got. Hmmm…”</p><p>“Wait. Lemme count it all up first!” Karen said.</p><p>“Guess it won’t hurt. You never know, huh.” And bit by bit, four index fingers counted out the small coins.</p><p>A few minutes later the man looked up and said, “I counted 282.”</p><p>Karen finished pushing the rest of the coins into her pile and said, “317. That’s…599.” When she looked up Ken was biting his lip, and she was sure he was about to say, “I’m sorry, but–”</p><p>Then she remembered! She reached way down into her pocket and pulled up the last coin–the one she’d found earlier. And how it sparkled! “600!”</p><p>“Well, how ‘bout that!”</p><p>Karen carried the puzzle home. When she’d changed out of her wet clothes and finished dinner, she laid all the pieces out on the living room rug. She stacked up the blocks and stared at the hole in the center of the puzzle. Just what was that little girl looking at?</p><p>“It could be anything,” she thought aloud. Then she remembered the scraps of wood her dad kept in the garage and the set of paints up in her room. “I could make anything!” And Karen The Puzzle Maker smiled a big smile and shouted, “I know what it is!”</p><img src='https://xcx.mdavid.cn/img/The-Puzzle-Maker-Illustration-opt.jpg'></img><p>THE END  Did you know?</p><p>Karen’s name is actually pronounced kärĕn, like “Caa-len,” and is written as かれん.</p><p>Ken is short for Kentaro. It is pronounced kĕntärō, like “Ken-tah-row,” and is written as 健太郎.</p><p>The coin Karen finds is a 1 yen coin.</p><p>How is Karen’s country different from where you live? What hints were you able to find?</p><p>What would you add to the puzzle if you were The Puzzle Maker?</p>"}