{"title": "The Shell Shocked Turtle", "author": "Artie Knapp", "level": "3 to 5,6 to 8,9 to12,", "category": "Instructional,Modern,Original,", "tag": "Turtle,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/The-Shell-Shocked-Turtle-opt-197x300.jpg'></img><p>“Owen, you’ve got to come out so we can get a move on!”</p><p>Even though Owen knew his sister was right, he was still too scared to come out of his shell. You see, Owen was a baby turtle who had recently experienced his first thunderstorm.  And ever since then Owen was afraid of everything! And when I say everything, I mean everything: chirping crickets, little field mice, the moonlight. Even the slightest bit of wind rattled Owen’s shell.</p><p>The lightning bolts and thunder from the storm still haunted his dreams.  Just thinking about them made Owen tremble.</p><p>“Of all the eggs that mamma laid, we’re still the only two who haven’t reached water yet,” said Owen’s Sister Shany.</p><p>“I’m sorry, but I just can’t do it,” said Owen.</p><p>“Come on, Owen! You can too. This is just something you have to face. There’s going to be tougher things in life to deal with than just a little storm.”</p><p>“Just a little storm – you call that a little storm?  The lightning bounced off my shell for crying out loud!”</p><p>“Well, I must admit it was amazing to see, but it did bounce off of you, Owen. Why are you so afraid now?”</p><p>“Where there’s one there’s bound to be another,” said Owen. “Maybe next time the lightning bolt doesn’t bounce off me!  Then I’m a goner!”</p><p>“Look, Owen, if we don’t find a pond soon we’re both going to be goners.  And besides, the chances of you getting struck by lightning again are probably one in a million.”</p><p>“Yeah, which means it could happen,” said Owen.</p><p>“Right, and I am going to win the Miss Turtle Universe Beauty Pageant,” said Shany.  “You’re going to have to trust me, Owen.  Since you were the last egg to hatch, I have to look after you. That’s the rule! You’re after all, my baby brother.”</p><p>“You hatched forty seconds before I did,” said Owen. “What makes you so grown up?”</p><p>“I’m not all grown up.  But like it or not, I am still your older sister.  And unlike you, I’m not afraid of everything under the sun.”</p><p>Shany laughed, and laughed, and laughed some more. She laughed so hard her shell nearly fell off. But even Shany’s laughter wasn’t enough to get Owen out of his shell.</p><p>“Nice try.  But I’m still not risking it,” said Owen.</p><p>As Owen made his stance clear to Shany, a little turtle named Roxie walked up to ask for directions.</p><p>“I hope I’m not disturbing you, but could you please tell me where to find Pike Lake?”</p><p>Owen had experienced lightning first hand, but he had never felt electricity like this before.</p><p>To Owen, Roxie was the most beautiful thing he had ever seen. And for the first time since the big storm, Owen didn’t feel afraid.</p><p>Without hesitation, Owen popped out of his shell to offer Roxie assistance, but then felt too shy to say anything to her.  Shany pointed to where she believed Pike Lake to be and asked Roxie if she wanted help finding it.  Roxie appreciated Shany’s offer, but said she was battling a cold and didn’t want to get them sick, too.</p><p>“It shouldn’t be too hard to find,” said Roxie. “Thanks for your help and I hope we’ll meet again someday.”</p><p>As Roxie walked away, Owen felt empty.  Even though Owen hadn’t said a single word to Roxie, he knew he had to see her again.  And that thought alone turned Owen’s emptiness into joy.</p><p>“You see, Shany, I’m not afraid.  I’m out of my shell and nothing will ever scare me again,” said Owen gleefully.</p><p>But before Owen could utter another word he jumped right into Shanty’s arms. He had heard a loud thump!</p><p>“What is it now, Owen?” asked Shany.</p><p>“Oh, I just heard the most awful sound in the world.  The sound of thunder! Another storm must be on the way.”</p><p>A couple of giggles followed by a loud ornery laugh could be heard close by. It wasn’t thunder that had frightened Owen. A little squirrel pounding rocks against a tree was what had scared him.</p><p>“Kid, are you sure you’re a turtle and not a chicken?” asked the squirrel.</p><p>“Don’t tease my little brother,” said Shany. “There’s nothing wrong with being afraid.”</p><p>“What? I heard you laughing at him earlier too,” said the squirrel.</p><p>“Yeah, but I only tried to get him out of his shell,” said Shany. “I didn’t try to scare him.”</p><p>“Well, I’m not afraid of storms and all I have is a bushy little tail,” said the squirrel.  “Why, if I had a shell like his I wouldn’t be afraid of anything.”</p><p>“I saw you running away from a stray cat yesterday,” said Shany.</p><p>“Yeah, so what,” said the squirrel.</p><p>“You were scared to death of that cat, but that cat didn’t scare me.”</p><p>“What are you saying?” asked the squirrel.</p><p>“Everybody gets scared sometimes. Why is my brother being afraid of thunderstorms any different from your being afraid of a cat?”</p><p>The squirrel knew that Shany had made a good point, so he just shook his head and darted out of sight.</p><p>“Wow.  Thank you,” said Owen.  “You really are a great older sister.”</p><p>“As I said before, Owen, that’s my job.”</p><p>“You know, sis, I’ve learned something today. I may not like thunderstorms, but being afraid of them isn’t something to be ashamed of.”</p><p>“That’s right, little brother.  And it takes courage to know that.”</p><p>As Owen and Shany journeyed to find Pike Lake, Owen felt proud about having gained the courage to finally leave his shell.</p><p>Throughout his life Owen would encounter many thunderstorms to be sure, but none were as scary as the first one. That’s because Owen never looked at them the same way again.</p><p>And oh how he loved telling his grandchildren about the summer lightning bounced off his shell. But don’t take my word for it – just ask Roxie.</p>"}