{"title": "The Singing Shell", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Fantasy,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/illus-090.jpg'></img><h2><a id=\"THE_SINGING_SHELL\" name=\"THE_SINGING_SHELL\"></a>THE SINGING SHELL</h2><p>For years and years the beautiful shell had been upon the floor in Gran’ma’s front room. It was a large shell with many points upon it. These were coarse and rough, but the shell was most beautiful inside.</p><img src='https://xcx.mdavid.cn/img/illus-089.jpg'></img><p>Marcella had seen the shell time and time again and often admired its lovely coloring, which could be seen when one looked inside the shell.</p><p>So one day, Gran’ma gave the beautiful shell to Marcella to have for her very own, up in the nursery.</p><p>“It will be nice to place before the nursery door so the wind will not blow the door and pinch anyone’s fingers!” Gran’ma laughed.</p><p>So Marcella brought the shell home and placed it in front of the nursery door. Here the dolls saw it that night, when all the house was still, and stood about it wondering what kind of toy it might be.</p><p>“It seems to be nearly all mouth!” said Henny, the Dutch doll. “Perhaps it can talk.”</p><p>“It has teeth!” the French doll pointed out. “It may bite!”</p><p>“I do not believe it will bite,” Raggedy Andy mused, as he got down upon his hands and knees and looked up into the shell. “Marcella would not have it up here if it would bite!” And, saying this, Raggedy Andy put his rag arm into the lovely shell’s mouth.</p><p>“It doesn’t bite! I knew it wouldn’t!” he cried. “Just feel how smooth it is inside!”</p><p>All the dolls felt and were surprised to find it polished so highly inside, while the outside was so coarse and rough. With the help of Uncle Clem and Henny, Raggedy Andy turned the shell upon its back, so that all the dolls might look in.</p><p>The coloring consisted of dainty pinks, creamy whites and pale blues, all running together just as the coloring in an opal runs from one shade into another. Raggedy Andy, stooping over to look further up inside the pretty shell, heard something.</p><p>“It’s whispering!” he said, as he raised up in surprise.</p><p>All the dolls took turns putting their ears to the mouth of the beautiful shell. Yes, truly it whispered, but they could not catch just what it said.</p><img src='https://xcx.mdavid.cn/img/illus-092.jpg'></img><p>Finally Raggedy Andy suggested that all the dolls lie down upon the floor directly before the shell and keep very quiet.</p><p>“If we don’t make a sound we may be able to hear what it says!” he explained.</p><p>So the dolls lay down, placing themselves flat upon the floor directly in front of the shell and where they could see and admire its beautiful coloring.</p><p>Now the dolls could be very, very quiet when they really wished to be, and it was easy for them to hear the faint whispering of the shell.</p><p>This is the story the shell told the dolls in the nursery that night:</p><p>“A long, long time ago, I lived upon the yellow sand, deep down beneath the blue, blue waters of the ocean. Pretty silken sea weeds grew around my home and reached their waving branches up, up towards the top of the water.</p><p>“Through the pretty sea weeds, fishes of pretty colors and shapes darted here and there, playing at their games.</p><p>“It was still and quiet ‘way down where I lived, for even if the ocean roared and pounded itself into an angry mass of tumbling waves up above, this never disturbed the calm waters down where I lived.</p><p>“Many times, little fishes or other tiny sea people came and hid within my pretty house when they were being pursued by larger sea creatures. And it always made me very happy to give them this protection.</p><p>“They would stay inside until I whispered that the larger creature had gone, then they would leave me and return to their play.</p><p>“Pretty little sea horses with slender, curving bodies often went sailing above me, or would come to rest upon my back. It was nice to lie and watch the tiny things curl their little tails about the sea weed and talk together, for the sea horses like one another and are gentle and kind to each other, sharing their food happily and smoothing their little ones with their cunning noses.</p><p>“But one day a diver leaped over the side of a boat and came swimming head-first down, down to where I lay. My! How the tiny sea creatures scurried to hide from him. He took me within his hand and, giving his feet a thump upon the yellow sand, rose with me to the surface.</p><p>“He poured the water from me, and out came all the little creatures who had been hiding there!”</p><p>Raggedy Andy wiggled upon the floor, he was so interested.</p><p>“Did the tiny creatures get back into the water safely?” he asked the beautiful shell.</p><p>“Oh, yes!” the shell whispered in reply. “The man held me over the side of the boat, so the tiny creatures went safely back into the water!”</p><p>“I am so glad!” Raggedy Andy said, with a sigh of relief. “He must have been a kindly man!”</p><p>“Yes, indeed!” the beautiful shell replied. “So I was placed along with a lot of other shells in the bottom of the boat and every once in a while another shell was placed amongst us. We whispered together and wondered where we were going. We were finally sold to different people and I have been at Gran’ma’s house for a long, long time.”</p><p>“You lived there when Gran’ma was a little girl, didn’t you?” Raggedy Ann asked.</p><p>“Yes,” replied the shell, “I have lived there ever since Gran’ma was a little girl. She often used to play with me and listen to me sing.”</p><p>“Raggedy Ann can play ‘Peter, Peter, Pumpkin Eater’ on the piano, with one hand,” said Uncle Clem, “but none of us can sing. Will you sing for us?” he asked the shell.</p><p>“I sing all the time,” the shell replied, “for I cannot help singing, but my singing is a secret and so is very soft and low. Put your head close to the opening in my shell and listen!”</p><p>The dolls took turns doing this, and heard the shell sing softly and very sweetly.</p><p>“How strange and far away it sounds!” exclaimed the French doll. “Like fairies singing in the distance! The shell must be singing the songs of the mermaids and the water-fairies!”</p><p>“It is queer that anything so rough on the outside could be so pretty within!” said Raggedy Andy. “It must be a great pleasure to be able to sing so sweetly!”</p><p>“Indeed it is,” replied the beautiful shell, “and I get a great happiness from singing all the time.”</p><p>“And you will bring lots of pleasure to us, by being so happy!” said Raggedy Andy. “For although you may not enter into our games, we will always know that you are happily singing, and that will make us all happy!”</p><p>“I will tell you the secret of my singing,” said the shell. “When anyone puts his ear to me and listens, he hears the reflection of his own heart’s music, singing; so, you see, while I say that I am singing all the time, in reality I sing only when someone full of happiness hears his own singing as if it were mine.”</p><p>“How unselfish you are to say this!” said Raggedy Andy. “Now we are ever so much more glad to have you with us. Aren’t we?” he asked, turning to the rest of the dolls.</p><p>“Yes, indeed!” came the answer from all the dolls, even the tiny penny dolls.</p><p>“That is why the shell is so beautiful inside!” said Raggedy Ann. “Those who are unselfish may wear rough clothes, but inside they are always beautiful, just like the shell, and reflect to others the happiness and sunny music within their hearts!”</p><img src='https://xcx.mdavid.cn/img/illus-095.jpg'></img>"}