{"title": "The Fisherman and his Wife", "author": "Brothers Grimm", "level": "6 to 8,9 to12,", "category": "Classic,Fairy Tale,German,", "tag": "Fish,Flounder,", "length": "10 - 15 mins,15 - 20 mins,", "body": "<p>THERE was once a fisherman who lived with his wife in a miserable little hovel close to the sea. He went to fish every day, and he fished and fished, and at last one day, when he was sitting looking deep down into the shining water, he felt something on his line. When he hauled it up there was a great flounder on the end of the line. The flounder said to him: “Look here, fisherman, don’t you kill me; I am no common flounder, I am an enchanted prince! What good will it do you to kill me? I shan’t be good to eat; put me back into the water, and leave me to swim about.”</p><p>“Well,” said the fisherman, “you need not make so many words about it. I am quite ready to put back a flounder that can talk.” And so saying, he put back the flounder into the shining water, and it sank down to the bottom, leaving a streak of blood behind it.</p><p>Then the fisherman got up and went back to his wife in the hovel. “Husband,” she said, “have you caught nothing to-day?”</p><p>“No,” said the man; “all I caught was one flounder, and he said he was an enchanted prince, so I let him go swim again.”</p><p>“Did you not wish for anything then?” asked the good wife.</p><p>“No,” said the man; “what was there to wish for?”</p><p>“Alas!” said his wife; “isn’t it bad enough always to live in this wretched hovel? You might at least have wished for a nice clean cottage. Go back and call him; tell him I want a pretty cottage; he will surely give us that!”</p><p>“Alas,” said the man, “what am I to go back there for?”</p><p>“Well,” said the woman, “it was thou who caught him and let him go again; for certain he will do that for you. Be off now!”</p><p>The man was still not very willing to go, but he did not want to annoy his wife, and at last he went back to the sea.</p><p>He found the sea no longer bright and shining, but dull and green. He stood by it and said:</p><p>The flounder came swimming up, and said: “Well, what do you want?”</p><p>“Alas!” said the man; “I had to call you, for my wife said I ought to have wished for something, as I caught you. She doesn’t want to live in our miserable hovel any longer; she wants a pretty cottage.”</p><p>“Go home again, then,” said the flounder; “she has her wish fully.”</p><p>The man went home and found his wife no longer in the old hut, but a pretty little cottage stood in its place, and his wife was sitting on a bench by the door.</p><p>She took him by the hand, and said: “Come and look in here—isn’t this much better?”</p><p>They went inside and found a pretty sitting-room, and a bedroom with a bed in it, a kitchen, and a larder furnished with everything of the best in tin and brass, and every possible requisite. Outside there was a little yard with chickens and ducks, and a little garden full of vegetables and fruit.</p><p>“Look!” said the woman, “is not this nice?”</p><p>“Yes,” said the man; “and so let it remain. We can live here very happily.”</p><p>“We will see about that,” said the woman, and with that they ate something and went to bed.</p><p>Everything went well for a week or more, and then said the wife: “Listen, husband; this cottage is too cramped, and the garden is too small. The flounder might have given us a bigger house. I want to live in a big stone castle. Go to the flounder, and tell him to give us a castle.”</p><p>“Alas, wife!” said the man; “the cottage is good enough for us; what should we do with a castle?”</p><p>“Never mind,” said his wife; “go to the flounder, and he will manage it.”</p><p>“Nay, wife,” said the man; “the flounder gave us the cottage. I don’t want to go back; as likely as not he’ll be angry.”</p><p>“Go, all the same,” said the woman. “He can do it easily enough, and willingly into the bargain. Just go!”</p><p>The man’s heart was heavy, and he was very unwilling to go. He said to himself: “It’s not right.” But at last he went.</p><p>He found the sea was no longer green; it was still calm, but dark violet and gray. He stood by it and said:</p><p>“Now, what do you want?” said the flounder.</p><p>“Alas,” said the man, half scared, “my wife wants a big stone castle.”</p><p>“Go home again,” said the flounder; “she is standing at the door of it.”</p><p>Then the man went away, thinking he would find no house, but when he got back he found a great stone palace, and his wife standing at the top of the steps, waiting to go in.</p><p>She took him by the hand and said, “Come in with me.”</p><p>With that they went in and found a great hall paved with marble slabs, and numbers of servants in attendance, who opened the great doors for them. The walls were hung with beautiful tapestries, and the rooms were furnished with golden chairs and tables, while rich carpets covered the floors, and crystal chandeliers hung from the ceilings. The tables groaned under every kind of delicate food and the most costly wines. Outside the house there was a great courtyard, with stabling for horses, and cows, and many fine carriages. Beyond this there was a great garden filled with the loveliest flowers, and fine fruit trees. There was also a park, half a mile long, and in it were stags and deer, and hares, and everything of the kind one could wish for.</p><p>“Now,” said the woman, “is not this worth having?”</p><p>“Oh, yes,” said the man; “and so let it remain. We will live in this beautiful palace and be content.”</p><p>“We will think about that,” said his wife, “and sleep upon it.”</p><p>With that they went to bed.</p><p>Next morning the wife woke up first; day was just dawning, and from her bed she could see the beautiful country around her. Her husband was still asleep, but she pushed him with her elbow, and said, “Husband, get up and peep out of the window. See here, now, could we not be king over all this land? Go to the flounder. We will be king.”</p><p>“Alas, wife,” said the man, “what should we be king for? I don’t want to be king.”</p><p>“Ah,” said his wife, “if you will not be king, I will. Go to the flounder. I will be king.”</p><p>“Alas, wife,” said the man, “whatever do you want to be king for? I don’t like to tell him.”</p><p>“Why not?” said the woman. “Go you must. I will be king.”</p><p>So the man went; but he was quite sad because his wife would be king.</p><p>“It is not right,” he said; “it is not right.”</p><p>When he reached the sea, he found it dark, gray, and rough, and evil-smelling. He stood there and said:</p><p>“Now, what does she want?” said the flounder.</p><p>“Alas,” said the man, “she wants to be king now.”</p><p>“Go back. She is king already,” said the flounder.</p><p>So the man went back, and when he reached the palace he found that it had grown much larger, and a great tower had been added, with handsome decorations. There was a sentry at the door, and numbers of soldiers were playing drums and trumpets. As soon as he got inside the house, he found everything was marble and gold; and the hangings were of velvet, with great golden tassels. The doors of the saloon were thrown wide open and he saw the whole court assembled. His wife was sitting on a lofty throne of gold and diamonds; she wore a golden crown, and carried in one hand a scepter of pure gold. On each side of her stood her ladies in a long row, each one a head shorter than the next.</p><p>He stood before her, and said, “Alas, wife, are you now king?”</p><p>“Yes,” she said; “now I am king.”</p><p>He stood looking at her for some time, and then he said, “Ah, wife, it is a fine thing for you to be king; now we will not wish to be anything more.”</p><p>“Nay, husband,” she answered, quite uneasily, “I find the time hangs very heavy on my hands. I can’t bear it any longer. Go back to the flounder. King I am, but I must also be emperor.”</p><p>“Alas, wife,” said the man, “why do you now want to be emperor?”</p><p>“Husband,” she answered, “go to the flounder. Emperor I will be.”</p><p>“Alas, wife,” said the man, “emperor he can’t make you, and I won’t ask him. There is only one emperor in the country; and emperor the flounder cannot make you, that he can’t.”</p><p>“What?” said the woman. “I am king, and you are only my husband. To him you must go, and that right quickly. If he can make a king, he can also make an emperor. Emperor I will be, so quickly go.”</p><p>He had to go, but he was quite frightened. And as he went, he thought, “This won’t end well; emperor is too shameless. The flounder will make an end of the whole thing.”</p><p>With that he came to the sea, but now he found it quite black, and heaving up from below in great waves. It tossed to and fro, and a sharp wind blew over it, and the man trembled. So he stood there, and said:</p><p>“What does she want now?” said the flounder.</p><p>“Alas, flounder,” he said, “my wife wants to be emperor.”</p><p>“Go back,” said the flounder. “She is emperor.”</p><p>So the man went back, and when he got to the door, he found that the whole palace was made of polished marble, with alabaster figures and golden decorations. Soldiers marched up and down before the doors, blowing their trumpets and beating their drums. Inside the palace, counts, barons, and dukes walked about as attendants, and they opened to him the doors, which were of pure gold.</p><p>He went in, and saw his wife sitting on a huge throne made of solid gold. It was at least two miles high. She had on her head a great golden crown, set with diamonds, three yards high. In one hand she held the scepter, and in the other the ball of empire. On each side of her stood the gentlemen-at-arms in two rows, each one a little smaller than the other, from giants two miles high, down to the tiniest dwarf no bigger than my little finger. She was surrounded by princes and dukes.</p><p>Her husband stood still, and said, “Wife, are you now emperor?”</p><p>“Yes,” said she; “now I am emperor.”</p><p>Then he looked at her for some time, and said, “Alas, wife, how much better off are you for being emperor?”</p><p>“Husband,” she said, “what are you standing there for? Now I am emperor, I mean to be pope! Go back to the flounder.”</p><p>“Alas, wife,” said the man, “what will you not want? Pope you cannot be. There is only one pope in the world. That’s more than the flounder can do.”</p><p>“Husband,” she said, “pope I will be; so go at once. I must be pope this very day.”</p><p>“No, wife,” he said, “I dare not tell him. It’s no good; it’s too monstrous altogether. The flounder cannot make you pope.”</p><p>“Husband,” said the woman, “don’t talk nonsense. If he can make an emperor, he can make a pope. Go immediately. I am emperor, and you are only my husband, and you must obey.”</p><p>So he was frightened, and went; but he was quite dazed. He shivered and shook, and his knees trembled.</p><p>A great wind arose over the land, the clouds flew across the sky, and it grew as dark as night; the leaves fell from the trees, and the water foamed and dashed upon the shore. In the distance the ships were being tossed to and fro on the waves, and he heard them firing signals of distress. There was still a little patch of blue in the sky among the dark clouds, but toward the south they were red and heavy, as in a bad storm. In despair, he stood and said;</p><p>“Now, what does she want?” said the flounder.</p><p>“Alas” said the man, “she wants to be pope.”</p><p>“Go back. Pope she is,” said the flounder.</p><p>So back he went, and he found a great church, surrounded with palaces. He pressed through the crowd, and inside he found thousands and thousand of lights, and his wife, entirely clad in gold, was sitting on a still higher throne, with three golden crowns upon her head, and she was surrounded with priestly state. On each side of her were two rows of candles, the biggest as thick as a tower, down to the tiniest little taper. Kings and emperors were on their knees before her, kissing her shoe.</p><p>“Wife,” said the man, looking at her, “are you now pope?”</p><p>“Yes,” said she; “now I am pope.”</p><p>So there he stood gazing at her, and it was like looking at a shining sun.</p><p>“Alas, wife,” he said, “are you better off for being pope?” At first she sat as stiff as a post, without stirring. Then he said, “Now, wife, be content with being pope; higher you cannot go.”</p><p>“I will think about that,” said the woman, and with that they both went to bed. Still she was not content, and could not sleep for her inordinate desires. The man slept well and soundly, for he had walked about a great deal in the day; but his wife could think of nothing but what further grandeur she could demand. When the dawn reddened the sky, she raised herself up in bed and looked out of the window, and when she saw the sun rise she said:</p><p>“Ha! can I not cause the sun and the moon to rise? Husband!” she cried, digging her elbow into his side, “wake up and go to the flounder. I will be lord of the universe.”</p><p>Her husband, who was still more than half asleep, was so shocked that he fell out of bed. He thought he must have heard wrong. He rubbed his eyes and said:</p><p>“Alas, wife, what did you say?”</p><p>“Husband,” she said, “if I cannot be lord of the universe, and cause the sun and moon to set and rise, I shall not be able to bear it. I shall never have another happy moment.”</p><p>She looked at him so wildly that it caused a shudder to run through him.</p><p>“Alas, wife,” he said, falling on his knees before her, “the flounder can’t do that. Emperor and pope he can make, but that is indeed beyond him. I pray to you, control yourself and remain pope.”</p><p>Then she flew into a terrible rage. Her hair stood on end; she panted for breath, and screamed:</p><p>“I won’t bear it any longer; will you go?”</p><p>Then he pulled on his trousers and tore away like a madman. Such a storm was raging that he could hardly keep his feet; houses and trees quivered and swayed, mountains trembled, and the rocks rolled into the sea. The sky was pitchy black; it thundered and lightened, and the sea ran in black waves, mountains high, crested with white foam. He shrieked out, but could hardly make himself heard:</p><p>“Flounder, flounder in the sea,</p><p>Pray, listen to me:</p><p>My wife, Ilsebil, will have her own way</p><p>Whatever I wish, whatever I say.”</p><p>“Now, what does she want?” asked the flounder.</p><p>“Alas,” he said, “she wants to be Lord of the Universe.”</p><p>“Now she must go back to her old hovel,” said the flounder, “and there you will find her.”</p><p>And there they are to this very day!</p>"}