{"title": "The Spring Break", "author": "Nathan Oser", "level": "6 to 8,9 to12,", "category": "Illustrated,Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Bad things always happen at the worst times.</p><p>I lost my two front teeth on the morning of my seventh birthday.  My mom had baked a special cake shaped like a snowman and all done up in frosty, colored icing.  All I could do was look at it.</p><p>A couple years after that it was the chicken pox.  Not so bad when you get to miss school, unless it’s only one day and it’s the last day before summer vacation.  All I missed out on were water fights in the halls.  As if that isn’t bad enough, I had to spend half my summer shut inside the house too.</p><p>That’s the kind of stuff that could drive a kid bonkers, you know.</p><p>From atop my comforter I looked up at the hotrod calendar on my wall then down at my leg wrapped tight in an itchy, white cast.  The first day of Spring Break.  And me with a broken leg.</p><img src='https://xcx.mdavid.cn/img/Spring-Break-Image-1-1024x768.png'></img><p>Here we go again.  Bonkers!</p><p>Propped up on my bed, the cast looked like some huge, stringy cocoon about to sprout Mothra.  If it did, that would’ve been a lot cooler than lying on my back watching TV all day.  It didn’t help that I could hear all my friends down at the baseball field slugging fly balls into the trees and popping fouls into neighbors’ yards.  They were gearing up for the first game of the season, only a couple practices away.</p><p>Ding!  There goes another one, I thought.</p><p>Halfway through the Godzilla movie marathon I clicked off the tube and tossed the remote into the hamper with the dirty clothes.  “Yes!  2 points!”  My excitement fizzled away though when I realized that was another thing I was missing out on.  Basketball.</p><p>Around noon my dad brought up a plate of hotdogs, a bag of chips, and a tall glass of grape juice.  “How you doing, champ?”  He set the tray on the side table and planted himself on the foot of my bed.  “I remember when I got a broken leg.  No fun.”</p><p>“Did anyone come to sign your cast?” I asked.</p><p>“Sure.  Everyone in town.”</p><p>“You think people will come to sign my cast?”</p><p>“They’ll come.  And when it’s time to get that thing off, why, it’ll be so covered in signatures you won’t be able to see a speck of white anywhere, even with a microscope.”  There was a smile playing in his eyes.  “Who knows, you might not even want to take it off!”</p><p>“Not a chance,” I said.  “Maybe I could hang it on my wall, though.”</p><p>“An even better idea.”</p><p>“But what if they don’t come?  They’re all too busy playing ball without me.”</p><p>Just then a roaring cheer broke out amongst the boys down at the field.  “Pickle!  Pickle!  Get him!”</p><p>I rolled my head and let out a sigh.  “Pickle?  That hardly ever happens!  And I’m missing it!”</p><p>“Well, that’s a pickle right there, champ.”  My dad laughed, and I tried to cover my smile with a pout.</p><p>“Come on, Dad, I’m serious.”</p><p>“Cheer up.  Before you know it your leg’ll be as good as new.  Better even.  Bet after it heals you’ll be able to run so fast people will give you the nickname ‘House Burglar.’”</p><p>“‘House Burglar’?  Why’s that?”</p><p>“Because you’ll be able to steal home easier than chewing gum!”</p><p>“Steal home?  Yeah, right!  ‘Sides, spring break’ll be long gone by then.”</p><p>“Hey, it couldn’t be as bad as that time you lost your baby teeth on your birthday and had to eat applesauce the whole week and through Christmas.  Or that summer you got the chicken pox.  Remember that?”</p><p>“Don’t remind me.”</p><p>My dad slapped his hands on his knees and walked across the room.  He pulled a big, permanent marker from the desk drawer and came over to sign my cast.</p><p>“Here, I’ll give it the old doctor signature so your friends won’t be able to tell it was your dad.”  He raised the marker in a swish and a swoop and said, “There!  The first of many.”</p><p>“Thanks.  And I don’t mind if they know.”</p><p>He gave me a wink and headed back downstairs.</p><img src='https://xcx.mdavid.cn/img/Spring-Break-Image-2-justify-left1-768x1024.png'></img><p>After gobbling up lunch I slapped a pillow over my head so I wouldn’t have to listen to all my friends playing ball across the street.  There had to be something I could do up here, I thought, to keep myself busy, to keep the bonkers away.  I shuffled through the stacks of books at my bedside and pulled up an old paper-airplane manual.  In no time at all I ripped straight through an entire notebook, cover to cover, and turned my bed into an aircraft carrier.</p><p>With the backscratcher I kept for emergency itches under my cast I was able to pop open the window screen and send one of my constructions out for a test flight.  It quickly turned into a game, and the goal was to find the right design and aerodynamics to get as many planes into the sandlot as I could.  Maybe someone might notice and come up to see me.</p><p>A bit later, just when I started to think none of my airplanes had made it past the yard, there came the muffled ring of the doorbell.  I sat up when I heard a tumbling-thumping of sock-feet in the hallway.</p><img src='https://xcx.mdavid.cn/img/Spring-Break-Image-3-justify-right-768x1024.png'></img><p>My bedroom door burst open and Dustin appeared.  He froze, wide-eyed, and whistled like a slide whistle.  “Man!” he said.  “You gonna be okay?”</p><p>Casey popped in behind him.  “Yeah, your leg looks like one of those rockets they strap to the bottom of the space shuttle.”</p><p>“Ain’t as bad as it looks,” I said with a shrug.</p><p>“Saw your airplanes,” Dustin smiled.  “Caught one with my mitt.”</p><p>Casey chuckled.  “Figured you had to be bored out of your mind to make that many.”</p><p>“Nah.  Was just practicing my pitching arm, you know.  So, you guys wanna sign my cast?”</p><p>“Really?  You’re gonna let us sign your cast?”  Dustin picked up the marker.</p><p>“I can practice my autograph,” jumped Casey, who was always practicing his autograph.  “I gotta perfect it for when I become the best shortstop in the history of the majors.”</p><p>“Better than Barry Larkin?”</p><p>“Of course.  My autograph could beat Larkin’s any old day of the week!”</p><p>Dustin and I grabbed our stomachs and broke out laughing.  Then Dustin said, “He might be right, though.  You seen his trading card collection?”</p><p>“Every last one signed, right?”</p><p>“Yep.  But if you look close, all the signatures are the same.  They all read ‘Casey Albright!’”</p><p>This time Casey laughed with us.  “It looks more genuine to sign a baseball card than it does to sign your math notebook.  I can’t help that they haven’t made any cards with me on them yet.”</p><p>Dustin squiggled in his name on the top of my foot.  Casey streaked his across my shin, above my dad’s name.  I leaned forward for a closer look.  “Thanks, guys.”</p><p>Recapping the pen, Casey said, “Keep that thing and you’ll be rich one day.”</p><p>Dustin smiled.  “Yeah, cause of my name!”</p><p>“Hey, you guys think you could get ahold of the rest of the gang?  Maybe we could even get the whole town to come sign my cast.”</p><p>“Not a bad idea!  You might have to break your other leg, though, just to fit all those names.”</p><p>“Bet we could at least get all the kids from school over here.”</p><p>“Yeah.  Everyone’ll be glad to see that you’re doing alright, too.”</p><p>Dustin and Casey didn’t stay long that night, but I didn’t mind.  They came back the next day, and they brought Jimmy and Ralph and Nick too.  Then more people came after that.  Doug and Julie and Lance and Joseph and Kristen.  And still more came, day after day.</p><p>In between visits I thought about when I lost my front teeth.  I realized it wasn’t all bad.  I was the only kid in the school recital who didn’t have to hide his buck teeth with shoe polish to sing “All I Want for Christmas is My Two Front Teeth.”  And thinking about my summer with the chicken pox I remembered passing the itchy bumps on to Johnny Fairfield when my mom had that pox party.  He was the clean-up batter and star player for the little league team across town.  If he hadn’t been stuck in the house after I got better we might not have won the Series that year.  But who knows?</p><p>All I know is sometimes bad things happen at the best times.</p><p>The last few afternoons of the break everyone came to help me down to the dugout where I could watch some of the practices.  It was really cool, too, when they set up a stool behind home plate and let me play catcher a couple times.  I had never played catcher before, but I liked it a lot and was pretty good at it too.</p><img src='https://xcx.mdavid.cn/img/Spring-Break-Image-4-1024x768.png'></img><p>By the time school started back up I decided to change positions, and when I asked, they even let me field the first inning of the very first game.  They had to substitute me when we went to bat, but catching those strikes was the best feeling ever!  I was so excited I stood on my crutches and cheered the team on for the rest of the game.  My leg didn’t hurt at all anymore, and my cast no longer looked like a giant moth cocoon or a space shuttle rocket–it looked like a hundred different trading cards, autographed by the best players around:  my friends.  That was the greatest spring break ever.</p>"}