{"title": "The Outcast Brigade", "author": "Grant Fieldgrove", "level": "6 to 8,9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "10 - 15 mins,", "body": "<p>He first appeared the night before Alex was to begin sixth grade. Alexander was sitting on his bedroom floor, carefully aligning his Star Wars action figures along the top of his skateboard when he heard a voice.</p><p>“What’s up, little dude?” the voice said.</p><p>Alexander looked up to see a man he had seen on countless videos and whose name he had scrolled across several of his very own t-­‐shirts. Professional skateboarder and leader of the Skull Brigade, Willy Willis!</p><p>“Nothing,” Alexander said without even opening his mouth. “What about you?”</p><p>“Just chillin,” Willy said. Alexander smiled. He knew something was wrong. This couldn’t have been real. Willy knelt down. “Why are you lining up your toys like that?”</p><p>Alexander shrugged. “I don’t know,” he said. “Just seems like the right thing to do.”</p><p>After a knock on the door, Alexander’s father peeked his head in. “You okay, pal?” he said. “I heard ya making some noise.”</p><p>Alexander kept his head down and nodded quickly. His parents had just had another fight. It was the same fight Alexander had heard several times before. Sometimes it was dad who was mad at him and mom defended him. Other times it was the opposite. But it was always about the same thing. Something Alexander did wrong. Today, Alexander had broken one of his mom’s things. He didn’t even know what it was, but it was shiny and heavy. And it had broken easily. It seemed like everything Alexander did was wrong.</p><p>Alexander went to a regular school but was in an irregular class. His room, along with four others, were in bungalows pushed off into the far corner of the campus. Even Alexander’s playground was separated from the other kids’ by a chain link fence.</p><p>Alexander’s mom and dad walked him to the door. “Good luck, pal,” his dad said.</p><p>“We love you,” his mom said.</p><p>Alexander kept his head down and walked slowly and silently into the classroom, taking a seat in the back row.</p><p>The small classroom slowly started to fill up with kids and teacher’s aids. Alexander was excited. He liked school and the people in the class had been with him since first grade, so it wasn’t overwhelming to him like a trip to the supermarket could be.</p><p>He began to flap his arms and laugh. He loved being here.</p><p>At recess, when all the other kids in his class were playing on the swings, Alexander wandered to the far side of the yard and grabbed hold of the chain link fence. There, he watched the so-­‐ called normal kids play. He searched through the sea of children before finally finding her. Nikki Woodale. The girl Alexander had a crush on since second grade.</p><p>He first saw her on a field trip nearly four years ago, but that was all it took. Once glance at her slightly crooked smile had changed his life forever. He never said a word, though. Not in four long years. Once, while attending an assembly in third grade, Nikki had taken a seat next to Alexander. With a big gorgeous smile of hers, she said, “Hi Alexander.”</p><p>Alexander froze. His mouth went dry like he had been gargling with cotton balls. Bumps broke out on his arms and there was a slight, annoying tingle on the back of his neck. He remained frozen until class was over.</p><p>Now, surrounded by a small group of girls, Nikki spotted him, his face pressed against the fence, and she waved. Again, Alexander froze.</p><p>After lunch, the principal entered the classroom with a new student. His name was Tyler and Principal Sanford informed the class that he and his family just moved into the neighborhood and he would be attending this school. He then said that Tyler was deaf and quickly taught the class how to say hello in sign language. Alexander wasn’t paying any attention.</p><p>Alexander made it through the entire first week without saying a single word, which wasn’t unusual for him. He tried to participate in the class’s projects but quickly grew bored with them and would often get frustrated, sometimes resulting in a bit of a fit. But he made it. And every recess he would get his wave from Nikki.</p><p>It wasn’t until the second week that Alexander had the unfortunate luck of running into Johnny Smullins, the boy who had picked on him and called him horrible names for years. The meeting began when a crushed soda can struck him in the back of the head. Alexander didn’t even see it coming. He didn’t cry and he didn’t run away, though. He just stood there, taking more abuse until Alexander’s aid saw what was happening and rushed to his defense, promptly sending Johnny to the principal’s office.</p><p>Alexander had worried all summer long about running into Johnny and after the first week of school, he had hoped Johnny was gone for good. No such luck.</p><p>Alexander went straight home that day and cried. “What’s wrong, little dude?” Willy asked.</p><p>“Everything,” Alexander said silently to his imaginary guest.</p><p>“I hate being alone and I hate the way I am. I hate that my parents argue and I hate that it’s always my fault. Today I heard my dad tell my mom that he didn’t think I even liked him, let alone loved him.” Alexander sniffed back some more tears and said, “I do, though. I just don’t know how to show it.”</p><p>“He knows it, little dude. Sometimes parents get frustrated, too. You know what I do when I’m sad?”</p><p>Alexander wiped his nose with the back of his hand and said, “What?”</p><p>Willy smiled and said, “I hop on my board and shred some asphalt.”</p><p>“I’m not allowed to go in the front yard without an adult.” “Well, you’ve got a backyard. And I see a patio out there just begging to be used.”</p><p>Alexander picked up his bored, smiled, then headed out back.</p><p>School wasn’t going very well for Tyler, either. He wasn’t good at reading lips and no one else could do sign language. Most of his days were spent in the corner with his interpreter as he watched the clock tick by slowly. When the teacher gave him a folded piece of paper and instructions to take it to the principal, Tyler was happy to make his escape from the class. That was when he had his first run in with Johnny Smullins.</p><p>Bam! A soda can collided with the back of Tyler’s head. He turned to look and saw Johnny laughing. He didn’t need to know how to read lips to know the horrible things Johnny was saying. Tyler had never felt more alone, embarrassed and ashamed.</p><p>The attacks on both children continued, and it seemed to become a near-­‐daily event. Johnny was clever and never allowed his bullying to be seen by the adults. And with such easy targets as Alexander and Tyler, Johnny’s horribleness flourished.</p><p>“I just want a friend,” Alexander said to Willy, after another long night of hearing his parents argue.</p><p>“So go make a friend. What about Tyler?” Willy suggested. “How do you know about Tyler?” Alexander said. “Because, little dude, I know everything you know.”</p><p>Alexander sat quietly in thought. He had watched Tyler in class from time to time and seen the way he talked with his hands. Alexander had an idea.</p><p>He went to his bookshelf and looked through all the books until finding the one he wanted. He had been given it a few years back by his grandma, but never paid any attention to it. Now, he hoped, it would come in handy. He read the cover. American Sign Language for Children.</p><p>He read and read, and studied and studied. He missed dinner that night and when it was bedtime, he hid under the covers with a small flashlight. When he heard his parents going to bed, he had another idea. He jumped out of bed and ran to his parents’ room. He finally knew a way to tell his parents how he felt.</p><p>He burst into their room just as they were both climbing into bed, extended his right hand, struggled to get his fingers do to what he wanted them to, then eventually held up the I Love You sign.</p><p>Tears and hugs followed.</p><p>The next day it was time for Alexander to test what he had learned. Tyler was sitting in the corner and Alexander was trying to catch his eye. When he did, Alexander signed Hello. Tyler signed Hello back. Alexander signed, “My name is A-­‐L-­‐E-­‐X.” Tyler signed back with his name. He had a bright smiled across his face.</p><p>That night Alexander learned more, and every day Tyler and Alexander’s conversations would get a little bit longer. By the end of the second week, Tyler joined Alexander at the chain link fence at recess. Tyler could tell whom Alexander was watching without having to be told. When they returned to class that day, Tyler moved his desk out of the corner.</p><p>Delighted at the news of Alexander having a friend, Alexander’s parents invited Tyler’s family over for dinner. Alexander’s father was a little nervous, for Tyler’s father was also deaf, and he was afraid he wouldn’t know how to communicate. But, as it turns out, Alexander’s dad’s fears were unwarranted as Tyler’s mom was easily able to translate back and forth.</p><p>To Alexander’s joy, Tyler had brought over a skateboard. While the parents talked about boring adult things, the boys skated around on the back patio. As the sun began to fall behind the trees, Alexander’s dad came out to check on them, discovering that the boys did not have very much room out there.</p><p>That big dumb pool that no one used was taking up way too much space.</p><p>By the end of that same week, much to the dismay of Alexander’s mother, his father had drained the pool and set it up for Alexander and Tyler to skate in. Alexander’s mom yelled, “They are going to crack their heads open!”</p><p>Alexander’s dad shrugged, and said, as if it was the most obvious answer in the world, simply, “Helmets.”</p><p>Every day for a month, after being harassed by Johnny at school, the boys would meet in Alexander’s backyard and skate. They called themselves The Outcast Brigade, a name Willy Willis had suggested. Day in and day out, they skated, until one Saturday when Alexander had an idea. Perhaps the Brigade should recruit a few new members.</p><p>During lunch, Alexander and Tyler would approach a new kid every day. The first day they picked a little boy from the classroom next to theirs named Howie. He was sitting alone and Tyler passed him a note. The following day, they passed a note to a little girl in a wheelchair named Sofia. The day after that, a kid with a disease they thought was called downed syndrome got a note. His name was Jeff. Thursday, they managed to cheer up a kid similar to Alexander named Oliver, after he was verbally assaulted by their arch nemesis Johnny Smullins. By Friday afternoon, their Brigade had grown from two members to seven, with the final member of the team, a boy with a sever stutter named Mason joined up.</p><p>That Saturday afternoon was spent in Alexander’s emptied pool. Even Sofia, in her chair, was doing some pretty gnarly moves!</p><p>Being around his new friends made Alexander feel good. Perhaps, the best he had ever felt. His parents had always called him a super hero and told him that if Alexander believed in himself, he could accomplish anything. The weeks went by and the group of outcasts formed a bond that could never be broken. For the first time in his life, Alexander believed in himself and one rainy Monday at school, Alexander returned a wave to Nikki. He could see her smile even from across the playground. Alexander thought he was going to cry from happiness, but the feeling quickly passed when Johnny appeared before him and kicked the fence, causing the metal squares to hit Alexander in the face. It hurt. It hurt badly. And even worse, Nikki saw it. Alexander turned and ran away, his self-­‐confidence back at its usual basement level. That night he cried himself to sleep.</p><p>Tyler had an idea on how to get back at Jimmy. On Friday night, The Outcast Brigade each snuck into their parent’s refrigerators and stole a few eggs. It was time to cause a little mischief. It was time to get a little revenge.</p><p>They met on the end of Oliver’s street and road their skateboards (except for Sofia, who was being pushed in her chair by Oliver) around the corner to Johnny’s house. It was the first time Alexander had been allowed in the front of the house without an adult.</p><p>Secretly, from behind some bushes, Alexander’s mom watched to make sure he met up safely with his friends.</p><p>The kids snuck up to Johnny’s house, careful to remain totally silent. When the first egg was about to be thrown, they heard a boisterous yell. A man’s voice. They had been caught. Everyone froze in fear.</p><p>Only the yell wasn’t directed at them.</p><p>Alexander peeked in the window and saw Johnny’s dad. His face was red with anger and he was yelling horrible things at Johnny. Alexander saw tears stream down Johnny’s face and he felt his hatred for the bully slide away.</p><p>A crash snapped Alexander from his daze. Oliver had accidentally broken a potted plant on the windowsill. Alexander quickly ducked down, trying not to be seen, but it was too late. The door flung open and there stood Johnny. His eyes swollen. “What do you want?” the bully yelled. Alexander stood silently. His friends were behind him, too scared to move.</p><p>Alexander’s mother and father had always taught him kindness. They told him that the world could be a scary place and sometimes a little bit of kindness could go a very long way.</p><p>Without knowing what else to do, Alexander bent down, grabbed his skateboard and held it out for Johnny to take. “What’s this for?” Johnny said. Mason took two steps forward and with that stutter that had always been on the receiving end of Johnny’s cruel taunts, said, “We-­‐ We w-­‐w-­‐want you to-­‐to join our bri-­‐bri-­‐brigade.”</p><p>Johnny’s eyes narrowed, leery of the invitation. No one had ever been nice to him. Was this a trick? He couldn’t decide. From inside the house, Johnny’s father’s voice boomed. “Close the door!” he yelled. “Get back in here and get what’s coming to you!”</p><p>Tears welled up in Johnny’s eyes again. He nodded to Alexander, took the skateboard from his hands and began running away. The Brigade followed him, eventually catching up, but not before the unloaded their barrage of eggs at the mean man. As they got farther and father away they could still hear Johnny’s father yelling behind them but they didn’t care. They continued on, past Oliver’s street, past Tyler’s street, and turned onto Alexander’s street, taking refuge in the backyard.</p><p>Later on, Johnny went to live with his grandmother and transferred schools. He would still visit a couple times a month and was getting better at riding his gifted skateboard.</p><p>Alexander felt great. He was filled with confidence and during the last week of school, after the Brigade had become infamous around campus and had a membership of nearly thirty kids, Alexander stood at the fence and waited for Nikki’s wave. When it came, Alexander didn’t wave back. Instead, he hooked his hands in the metal squares of the fence and began climbing. When he reached the top, he jumped to the ground on the other side and dusted off his knees.</p><p>Nikki was sitting on a bench tying her shoe. Alexander cut across the playground.</p><p>He was a super hero. He could accomplish anything he set his mind to. Willy had said, before disappearing forever nearly three months ago, that disabilities didn’t make people lesser, just different. And maybe Alexander liked being different.</p><p>Nikki looked up and saw Alexander heading towards her. She didn’t know what to expect. I’m a super hero, Alexander thought.</p><p>I’m a super hero.</p><p>He reached the bench and took a seat next to the girl of his dreams. He remained silent, gathered up all the courage in his body and slowly placed his hand on top of hers.</p><p>Nikki smiled.</p>"}