{"title": "The Flying Saucers", "author": "Veena Adige", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Dimpi and her mother were preparing sandwiches for lunch when she looked out of the window and saw something startling.</p><p>‘Look, Ma’, said Dimpi excitedly, ‘A Flying saucer,’ and they both looked out of the window.</p><p>Yes, there was a flying saucer sailing across their garden. It first sat on the flowering bush, then it took off and sat on the fence and within a minute it drifted away from their eyes.</p><p>Dimpi was upset. She had just read about flying saucers in a book and here it was, right in front of her eyes. But before she could click a picture, it had drifted away.</p><p>‘Close the window, dear,’ her mother advised,’ There is a very strong breeze outside.’</p><p>As Dimpi went to close the window, she saw yet another flying saucer!</p><p>She clapped her hands and called out to her mother.</p><p>‘See, Ma, another one,’ and sure enough, there were two now. Dimpi’s eyes became as round as the saucers themselves and she rubbed them and pinched herself to check whether it was a dream or a real one.</p><p>It was real and that was interesting. As they watched, the flying saucers somersaulted in the wind, sat on different bushes and plants and then flew over their garden into the next one.</p><p>There were some more. One after the other. And both Dimpi and her mother were wonderstruck.</p><p>‘We should inform someone. Should we inform the police?’ asked Dimpi, ‘Or the Mayor or someone? It is unusual, isn’t it? To see so many flying saucers? Do they have little men in green? Like I read in my book.’</p><p>Dimpi went on talking and even Mummy was wondering what to do.</p><p>The flying saucers were multiplying. One after the other. They came within view, flew slowly across the garden, sitting here, there and everywhere as if they couldn’t make up their minds and then just disappearing.</p><p>‘Wow,’ said Dimpi again and again.</p><p>‘Lovely’ she said once she had got used to them. Her nose now pressed against the window pane, Dimpi stared and stared. Was there someone inside the flying saucers guiding them? Or did they have a mind of their own?</p><p>It was interesting. And fascinating.</p><p>Suddenly there was a wail from upstairs. Little Bunty, Dimpi’s two year old brother seemed to have woken up. It was almost nine in the morning and time for him to get up.</p><p>Mummy and Dimpi rushed upstairs to see why he was crying. Normally he woke up with a cheerful smile. But today he was crying.</p><p>There he was, sitting in his cot, his dress disarrayed, his hair on end. He was rubbing his eyes and trying to say something.</p><p>‘What happened, baby? ‘crooned Ma. She went to him, held him closely and hugged him.</p><p>Dimpi also looked at him in wonder. He was such a cheerful baby. Naughty at times, but otherwise nice and good. Why was he so unkempt? Why was he crying? What had upset him?</p><p>And then they looked beside him. There was a huge pile of paper plates, some of them crumpled. He seemed to have picked up a box of paper plates from somewhere.</p><p>‘Ma, aren’t they familiar?’ asked Dimple, looking at them and touching them.</p><p>‘Yes,’ said her mother. She looked puzzled and wondered. Where had she seen them?</p><p>And then they looked at each other and burst out laughing.</p><p>Here were their flying saucers! Nice, white round and sweet! Disposable paper plates thrown out of the window by little Bunty. And they had thought that they were flying saucers. They had been fascinated and wonderstruck. And the strong breeze had certainly helped in creating flying saucers out of paper plates !!!!!</p><p>Moral: All that glitters is not gold and all things that fly are not flying saucers.</p>"}