{"title": "The New Tin Gutter", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Fantasy,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/illus-046.jpg'></img><h2><a id=\"THE_NEW_TIN_GUTTER\" name=\"THE_NEW_TIN_GUTTER\"></a>THE NEW TIN GUTTER</h2><p>All day Saturday the men had worked out upon the eaves of the house and the dolls facing the window could see them.</p><img src='https://xcx.mdavid.cn/img/illus-045.jpg'></img><p>The men made quite a lot of noise with their hammers, for they were putting new gutters around the eaves, and pounding upon tin makes a great deal of noise.</p><p>Marcella had not played with the dolls all that day, for she had gone visiting; so when the men hammered and made a lot of noise, the dolls could talk to each other without fear of anyone hearing or knowing they were really talking to each other.</p><p>“What are they doing now?” Raggedy Andy asked.</p><p>He was lying with his head beneath a little bed quilt, just as Marcella had dropped him when she left the nursery; so he could not see what was going on.</p><p>“We can only see the men’s legs as they pass the window,” answered Uncle Clem. “But they are putting new shingles or something on the roof!”</p><p>After the men had left their work and gone home to supper and the house was quiet, Raggedy Andy cautiously moved his head out from under the little bed quilt and, seeing that the coast was clear, sat up.</p><p>This was a signal for all the dolls to sit up and smooth out the wrinkles in their clothes.</p><img src='https://xcx.mdavid.cn/img/illus-047.jpg'></img><p>The nursery window was open; so Raggedy Andy lifted the penny dolls to the sill and climbed up beside them.</p><p>Leaning out, he could look along the new shiny tin gutter the men had put in place.</p><p>“Here’s a grand place to have a lovely slide!” he said as he gave one of the penny dolls a scoot down the shiny tin gutter.</p><p>“Whee! See her go!” Raggedy Andy cried.</p><p>All the other dolls climbed upon the window sill beside him.</p><p>“Scoot me too!” cried the other little penny doll in her squeeky little voice, and Raggedy Andy took her in his rag hand and gave her a great swing which sent her scooting down the shiny tin gutter, “Kerswish!”</p><p>Then Raggedy Andy climbed into the gutter himself and, taking a few steps, spread out his feet and went scooting down the shiny tin.</p><p>The other dolls followed his example and scooted along behind him.</p><p>When Raggedy Andy came to the place where he expected to find the penny dolls lying, they were nowhere about.</p><p>“Perhaps you scooted them farther than you thought!” Uncle Clem said.</p><p>“Perhaps I did!” Raggedy Andy said, “We will look around the bend in the eave!”</p><p>“Oh dear!” he exclaimed when he had peeped around the corner of the roof, “the gutter ends here and there is nothing but a hole!”</p><p>“They must have scooted right into the hole,” Henny, the Dutch doll said.</p><p>Raggedy Andy lay flat upon the shiny tin and looked down into the hole.</p><p>“Are you down there, penny dolls?” he called.</p><p>There was no answer.</p><p>“I hope their heads were not broken!” Raggedy Ann said.</p><img src='https://xcx.mdavid.cn/img/illus-048.jpg'></img><p>“I’m so sorry I scooted them!” Raggedy Andy cried, as he brushed his hand over his shoe button eyes.</p><p>“Maybe if you hold to my feet, I can reach down the hole and find them and pull them up again!” he added.</p><p>Uncle Clem and Henny each caught hold of a foot of Raggedy Andy and let him slide down into the hole.</p><img src='https://xcx.mdavid.cn/img/illus-050.jpg'></img><p>It was a rather tight fit, but Raggedy Andy wiggled and twisted until all the dolls could see of him were his two feet.</p><p>“I can’t find them!” he said in muffled tones. “Let me down farther and I think I’ll be able to reach them!”</p><p>Now Henny and Uncle Clem thought that Raggedy Andy meant for them to let go of his feet and this they did.</p><p>Raggedy Andy kept wiggling and twisting until he came to a bend in the pipe and could go no farther.</p><p>“I can’t find them!” he cried. “They have gone farther down the pipe! Now you can pull me up!”</p><p>“We can’t reach you, Raggedy Andy!” Uncle Clem called down the pipe. “Try to wiggle back up a piece and we will catch your feet and pull you up!”</p><p>Raggedy Andy tried to wiggle backward up the pipe, but his clothes caught upon a little piece of tin which stuck out from the inside of the pipe and there he stayed. He could neither go down nor come back up.</p><p>“What shall we do?” Uncle Clem cried, “The folks will never find him down there, for we can not tell them where he is, and they will never guess it!”</p><p>The dolls were all very sad. They stayed out upon the shiny new tin gutter until it began raining and hoped and hoped that Raggedy Andy could get back up to them.</p><p>Then they went inside the nursery and sat looking out the window until it was time for the folks to get up and the house to be astir. Then they went back to the position each had been in, when Marcella had left them.</p><p>And although they were very quiet, each one was so sorry to lose Raggedy Andy, and each felt that he would never be found again.</p><p>“The rain must have soaked his cotton through and through!” sighed Raggedy Ann. “For all the water from the house runs down the shiny tin gutters and down the pipe into a rain barrel at the bottom!”</p><img src='https://xcx.mdavid.cn/img/illus-052.jpg'></img><p>Then Raggedy Ann remembered that there was an opening at the bottom of the pipe.</p><p>“Tomorrow night if we have a chance, we dolls must take a stick and see if we can reach Raggedy Andy from the bottom of the pipe and pull him down to us!” she thought.</p><p>Marcella came up to the nursery and played all day, watching the rain patter upon the new tin gutter. She wondered where Raggedy Andy was, although she did not get worried about him until she had asked Mama where he might be.</p><p>“He must be just where you left him!” Mama said.</p><p>“I cannot remember where I left him!” Marcella said.</p><p>“I thought he was with all the other dolls in the nursery, though!”</p><p>All day Sunday it rained and all of Sunday night, and Monday morning when Daddy started to work it was still raining.</p><p>As Daddy walked out of the front gate, he turned to wave good-bye to Mama and Marcella and then he saw something.</p><p>Daddy came right back into the house and called up the men who had put in the new shiny tin gutters.</p><p>“The drain pipe is plugged up. Some of you must have left shavings or something in the eaves, and it has washed down into the pipe, so that the water pours over the gutter in sheets!”</p><p>“We will send a man right up to fix it!” the men said.</p><p>So along about ten o’clock that morning one of the men came to fix the pipe.</p><p>But although he punched a long pole down the pipe, and punched and punched, he could not dislodge whatever it was which plugged the pipe and kept the water from running through it.</p><p> </p><img src='https://xcx.mdavid.cn/img/illus-053.jpg'></img><p>Then the man measured with his stick, so that he knew just where the place was, and with a pair of tin shears he cut a section from the pipe and found Raggedy Andy.</p><p>Raggedy Andy was punched quite out of shape and all jammed together, but when the man straightened out the funny little figure, Raggedy Andy looked up at him with his customary happy smile.</p><p>The man laughed and carried little water-soaked Raggedy Andy into the house.</p><p>“I guess your little girl must have dropped this rag doll down into the drain pipe!” the man said to Mama.</p><p>“I’m so glad you found him!” Mama said to the man.</p><p>“We have hunted all over the house for him! Marcella could not remember where she put him; so when I get him nice and dry, I’ll hide him in a nice easy place for her to find, and she will not know he has been out in the rain all night!”</p><img src='https://xcx.mdavid.cn/img/illus-054.jpg'></img><p>So Mama put Raggedy Andy behind the radiator and there he sat all afternoon, steaming and drying out.</p><p>And as he sat there he smiled and smiled, even though there was no one to see him.</p><p>He felt very happy within and he liked to smile, anyway, because his smile was painted on.</p><p>And another reason Raggedy Andy smiled was because he was not lonesome.</p><p>Inside his waist were the two little penny dolls.</p><p>The man had punched Raggedy Andy farther down into the pipe, and he had been able to reach the two little dolls and tuck them into a safe place.</p><p>“Won’t they all be surprised to see us back again!” Raggedy Andy whispered as he patted the two little penny dolls with his soft rag hands.</p><p>And the two little penny dolls nestled against Raggedy Andy’s soft cotton stuffed body, and thought how nice it was to have such a happy, sunny friend.</p>"}