{"title": "The Laughter House", "author": "Manjari Shukla", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p> “Oh…Look at this house. This is so beautiful,” Piggi said to his brother Giggi.</p><p>Giggi widened his eyes and replied – “Yes…and it seems that it is laughing.”</p><p>“Let’s go inside and see,” Giggi replied.</p><p>And they went inside the house hopping and jumping giggling.</p><p>After entering the house, they felt as if the doors and the windows were smiling and would burst into laughter any moment.</p><p>Piggy asked surprisingly – “I am having a very strange feeling again. I feel as if everything inside the house is smiling.”</p><p>Giggi replied – “And I can hear the sound of giggling also.”</p><p>Just then Piggi looked at the ceiling fan and cried –“Lo and behold! This fan is laughing.”</p><p>“Oh! Since both of you are very innocent and kind-hearted kids and we are quite pleased to see you here,” the fan giggled.</p><p>Piggi smiled back – “Is this a magical house?”</p><p>“May be……may not be….hahaha!” the dining table laughed loudly and replied.</p><p>“Actually we keep watching you in the playground every day. We always feel happy when you help someone.” Pink flowerpot with blue roses came forward and the flowers shook in admiration.</p><p>Piggi and Giggi were puzzled and looked at each other.</p><p>Giggi asked surprisingly – “But we don’t recall what we have done.”</p><p>“On the way, you found one puppy lying injured on the road and you had applied ointment and fed him biscuits.”</p><p>A soft voice came from far corner of the room.</p><p>“Oh! Who is it?” Piggi bent and looked under the dining table.</p><p>“Me..it’s me..Just look at the window over here,” announced Purple curtain and smiled.</p><p>“But we both had forgotten this incident. We did not feel anything special about what we had done,” Giggi replied without any pride.</p><p>“Yeah….because helping others is your nature and this house always welcomes good children like you who are always ready to help others.”</p><p>Giggi asked innocently  -“Can our friends also come? They too are very nice.”</p><p>“Why not? We all will wait for all of you,” said the wall, which was very quite so far.</p><p>Piggi said – “We will tell all our friends about all of you and will bring them here and we will have a lot of fun.”</p><p>Piggi and Giggi burst out in laughter and left for the house to share this wonderful experience with their mother and friends.</p>"}