{"title": "The Kite and the String", "author": "Brian Martin", "level": "6 to 8,9 to12,Teen,", "category": "Fable,Illustrated,Instructional,Modern,Original,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/kite-close-up.jpg'></img><p style=\"text-align: center;\"><strong>Illustrated by Ciara, aged 9</strong></p><p>“How was school, Alex?” asked Grandpa from his chair on the front porch.</p><p>“I wish I didn’t have to go to school, Grandpa,” complained Alex, throwing his bag on the ground and plumping himself down onto the bench beside him. “It’s such a waste of time. I’d much prefer to be out working. I could be earning money already. If I started working now at a restaurant like Big Chicken Al’s Wing Hut I’d be earning good wages, good tips and I’d be able to travel and see the world like you did!”</p><p>“What age are you Alex?” asked Grandpa, frowning. “I am so forgetful.”</p><p>“I’m fifteen, Grandpa. Old enough to know when I’m wasting my time. I want to be free from having to go to school every day. Such a waste of time. I can’t believe I’m stuck here for another three years. I’d like to be up and away! ”</p><p>Grandpa smiled across at Alex and looked at him a moment. “It reminds me of a story I once heard – an old folk-tale from China.”</p><p>“Uh-oh,” said Alex. “Another tale with a deep and inner meaning meant to teach me that going to school is actually a good thing?”</p><p>They both laughed.</p><p>“Listen, and you decide,” said Grandpa.</p><p>“Ok Confucius, Grasshopper is listening.”</p><p>“OK. Good. Once long ago in China, there was a kite. This kite was a large and proud kite and it took much pleasure from being the biggest and high-flying kite in the region.”</p><p>“Great, a kite with an ego problem,” interrupted Alex.</p><img src='https://xcx.mdavid.cn/img/kite.jpg'></img><p>“Yes, a kite with attitude,” responded Grandpa with a grin. “This kite enjoyed nothing more than to soar high into the air, higher that any other kites. It longed to go higher and higher, tugging at the string until there was no more to let out.”</p><p>“A kite with altitude,” quipped Alex.</p><p>“Exactly. Although it wasn’t altogether happy. Although it soared higher than all the other kites, it longed to go higher. MUCH higher. It saw the clouds and the birds way above and resented not being able to get up there. In fact it blamed the string for holding it back.”</p><p>“It wanted a no-strings-attached relationship?” offered Alex.</p><p>Grandpa stopped and examined Alex. “Are you taking this seriously or are you going to throw in gags all the way through?” he asked.</p><p>“Yes,” replied Alex. “Gotta keep the audience entertained grand-pops.”</p><p>“I’ll ignore that. OK, so this kite,” continued Grandpa, “it really resented the string and complained bitterly whenever the string would stop it from flying higher and higher. The string was not happy with this situation and thought it was unfair.”</p><p>“Was the string highly strung?” gagged Alex.</p><p>“Yes, but only in the manual sense,” replied Grandpa, deliberately ignoring the bad pun. “It was usually a relaxed string normally, but didn’t like all this grief it was getting from the kite.”</p><p>“Was the highly-strung string stung by the stinging criticism?”</p><p>“Absolutely. It felt it was undeserved and wanted revenge. So one day, the wind was particularly strong. Almost a gale. The kite ascended rapidly as the string was let out quickly. It wasn’t long before the string hit its limit and the kite rose no more.</p><p>‘Aw, not again, string!’ bellowed the kite to the string. ‘Stop holding me back you long streak of killjoy misery! Let me go higher this once. Let go of me!’</p><p>Well the string had had enough. Normally it would hold on in the face of all the wind pressure to make sure the kite stayed attached. The string let go and dropped towards the earth, no longer pulled up by the kite.</p><p>‘So long sucker!’ exclaimed the kite as it burst upwards on a gust of wind. And what do you think happened next Alex?”</p><p>“Doh – the kite rose up above the clouds and said hello to the birdies – ‘Hi my name is Kite and I’m new around here, will you play with me?’ Oh no, sorry, without the string attached, it dropped to the ground?”</p><p>“Exactly Alex. Without the tension of the string holding it, the air pressure no longer had the resistance of the string to create lift and instead the kite dropped quite quickly down. When it hit the ground quite hard, one of its struts bore the brunt of the landing and cracked. The kite was badly injured.”</p><img src='https://xcx.mdavid.cn/img/kite-on-the-ground.jpg'></img><p>“It wasn’t able to strut its stuff no more?” asked Alex.</p><p>“Well, not for a while. It was sent to the repair shop where they fixed it up with a new strut and was right as rain.”</p><p>“And it learned its lesson that it needed the string to fly and was happy ever after?”</p><p>“No, not really. It was too proud to learn the lesson and never forgave the string for its behaviour. It still complained to the string of holding him back. Do you see the lesson in this for your situation?”</p><p>“YES! Thanks Grandpa! I understand now,” exclaimed Alex.</p><p>“Great,” replied Grandpa, uncertain of the newfound enthusiasm.</p><p>“Yes,” continued Alex. “I should leave school and learn how to fly and repair kites. And I should get some extra long string so that my kite can fly higher and higher. No, wait, the string is really money you want to give me money so that my kite, that is my future success, can be as high as possible! Thanks Grandpa. You can transfer it directly to my bank account.” Alex folded his arms and looked smugly at Grandpa.</p><p>“Eh, that’s not exactly what I was….” started Grandpa.</p><p>“OK, I know,“ confessed Alex. “I’m just yankin’ your chain. What the story is actually saying is that sometimes you need constraints in order to reach your potential. Sometimes it’s the things that you think are holding you back are actually mostly responsible for your growth. The string is having to finish school and the kite is my future potential being realised. And the wind is my education lifting me higher and higher.”</p><p>Grandpa smiled back. “Exactly, Alex. Well done. I thought for a while you were not taking this seriously, but now I see that you have taken in the main lesson of this story. I am proud of you, young man.”</p><p>“Thanks Gramps. You’re the best.” Alex got up and hugged his grandfather right then in the chair. “I’m going in now for a bite, I’m starvin’.”</p><img src='https://xcx.mdavid.cn/img/Alex-and-grandfather.jpg'></img><p>As Alex left the porch Grandpa had a satisfied smile on his face, happy in the knowledge that he had imparted his wisdom on the boy.“Just one thing Grandpa?” said Alex, coming back out from inside the porch door.</p><p>“Yes Alex,” replied Grandpa.</p><p>“If school is the string and the kite is my potential, when school runs out, am I not stuck at that level?“</p><p>Grandpa furrowed his brow and scratched his chin.</p><p>“No Alex, you will just need to find your own string I guess.”</p>"}