{"title": "The Sweet Smelling Skunk", "author": "Artie Knapp", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Skunk,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/The-Sweet-Smelling-Skunk-opt-201x300.jpg'></img><p>“Get out of there!  Go on now, get,” said Mrs. Donnelly to the rabbits.  It wasn’t that Mrs. Donnelly disliked rabbits, she just took great pride in her garden and the rabbits were destroying her array of lush veggies and flowers.</p><p>While inspecting the latest round of destruction to her garden, Mrs. Donnelly cried out, “Oh my beautiful garden; it’s just ruined.”</p><p>Mrs. Donnelly’s outcry startled something in her garden as the last remaining heads of lettuce shook back and forth.  Mrs. Donnelly was startled at first, but knew this could be her last chance to finally confront one of the rabbits face to face.</p><p>“Show yourself you ornery rabbit,” said Mrs. Donnelly. Mrs. Donnelly pushed the heads of lettuce to the side and was surprised to find a little skunk crying his heart out.  It was such a sad sight that Mrs. Donnelly ignored the danger of getting sprayed by the little skunk.</p><p>“What’s wrong with you? Why are you crying?” asked Mrs. Donnelly.</p><p>The little skunk wiped away his tears and said, “Aren’t you going to tell me to leave because of the way I smell? Everyone else does.”</p><p>“Of course not,” said Mrs. Donnelly.  “Anyone who would say such a thing isn’t very polite; besides, your scent and spray are how you protect yourself.”</p><p>“I know, but try explaining that to the other animals in the neighborhood. All day long I get teased by squirrels, rabbits, and raccoons.  Do you know the Chesterfields who live three doors down from you?” asked the little skunk.</p><p>“Yes, they’re a very nice family,” said Mrs. Donnelly. “Surely they don’t make fun of you?”</p><p>“Oh they don’t, but their cat is downright mean.  I guess if I had matted fur and fleas I would be mean too,” laughed the little skunk.</p><p>“That’s the spirit,” said Mrs. Donnelly.  “A sense of humor is a good remedy for when you’re feeling down. Pay no attention to that ole cat or the other animals who tease you.  They’re not worth getting upset over.”</p><p>“Thank you, Mrs. Donnelly,” said the little skunk.</p><p>“How do you know my name?”</p><p>“Every animal in the neighborhood knows who you are.  Your garden is legendary around these parts.”</p><p>“That reminds me, I caught you eating in my garden too,” said Mrs. Donnelly. “I know and for that I am really sorry.  But the rabbits about polished off everything anyway.”</p><p>Mrs. Donnelly just nodded with a smile and said, “What’s your name my little friend?”</p><p>“My name is Skippy,” said the little skunk.</p><p>“Well, follow me, Skippy,” said Mrs. Donnelly. “I have an idea that I believe will take care of both our problems.”</p><p>As Skippy followed Mrs. Donnelly into her house she talked passionately about gardening. She vowed her garden would be better than ever and promised Skippy all the food he could eat if he helped her tend to it.</p><p>“I don’t know anything about gardening,” said Skippy.</p><p>“Don’t worry,” said Mrs. Donnelly. “I’ll take care of that.”</p><p>“How am I going to help then?” asked Skippy.</p><p>Mrs. Donnelly was standing beside a large piano and wistfully stroked the keys with one hand.</p><p>“Do you sing Skippy?”</p><p>“Well, only when I’m in the shower.”</p><p>“Perfect!” said Mrs. Donnelly. “That will do.”  Though Mrs. Donnelly was old and frail, she got behind her piano and moved it across the room.</p><p>“How on earth did you move such a large piano by yourself?” asked Skippy.</p><p>Mrs. Donnelly laughed and said, “Oh wheels can make anything possible.”</p><p>Skippy looked under the piano and sure enough the wheels glided with ease as Mrs. Donnelly continued to push it across the floor.  She didn’t stop pushing the piano until it was parked right next to her garden. Once the piano was placed there, Mrs. Donnelly and Skippy walked back inside the house.  Several animals in the neighborhood gathered around to discuss what was going on.</p><p>“I must be dreaming,” said a rabbit. “Why is there a piano by Mrs. Donnelly’s garden?  And what is Skippy doing in her house?”</p><p>“I don’t have a clue,” said an old and wise raccoon.  “This is most peculiar.”</p><p>At that moment, all the animals’ attention shifted back to Mrs. Donnelly and Skippy as they approached the garden with a wagon full of flowers and seeds in tow.  Mrs. Donnelly took a small shovel from the wagon and started to dig holes throughout her garden.  She took the flowers and seeds and placed them in the holes.  Skippy tapped each hole with his tail to make sure the flowers and seeds were snug. Then he sprayed each side of Mrs. Donnelly’s yard.  He ensured his spray wasn’t too close to the garden, but close enough to give fair warning to any animal close by.</p><p>Mrs. Donnelly clapped her hands and motioned for Skippy to join her.  Skippy ran back as fast as he could and jumped atop the piano.  Mrs. Donnelly gave Skippy a wink and a smile as he sat by her side.  She struck the keys of the piano with all of her might as she and Skippy began to sing:</p><p>“This is our garden, clean without rust,</p><p>Keeping it safe is surely a must;</p><p>Any who try to ruin where it lies,</p><p>Will feel the sting of skunk spray</p><p>Right in their eyes.”</p><p>Over and over again they sang:</p><p>“This is our garden, clean without rust,</p><p>Keeping it safe is surely a must;</p><p>Any who try to ruin where it lies,</p><p>Will feel the sting of skunk spray</p><p>Right in their eyes.”</p><p>As Mrs. Donnelly continued to sing she placed a flower over Skippy’s ear. Skippy jumped off the piano with the grace of an Olympic diver and then flipped over on his back. He smiled at all the animals that were looking on in disbelief. Skippy waved his tail at them and also dangled the flower Mrs. Donnelly gave him. It was a rose that Mrs. Donnelly had given Skippy. And no skunk had ever smelled so sweet.</p>"}