{"title": "The Dressmaker and the Prince", "author": "Bethany Helsel", "level": "6 to 8,9 to12,", "category": "Fairy Tale,Fantasy,Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Once, there was three knights, who one day found themselves lost in a forest, forgotten by their cavalry. They had no horses, nor food, only bronze metal swords to match their armor, and purple cloaks that covered their backside. The knights were: young Crown Prince Donteaus, his cousin Duke Tatianus, and his uncle Archduke Aelfric. They had sided with their countrymen and joined a war against invaders. But a separation from their company caused the three noble knights to journey deep into the misty forest—they were lost—with no direction of camp.</p><p>“We might never reach the camp in time for tomorrow morning’s attack,” said Aelfric. “We will, all we have to do is keep our heads up and search for the company,” said Donteaus.</p><p>“The sun is setting,” warned Tatianus. Time became scant—so they quickly stopped and used their capes as handkerchiefs—to wipe their tears from the chilled air. From a slight sparkle of the sun Donteaus noticed an emerged hill in front of them. He ran fast to the hill leaving Aelfric and Tatianus in bewilderment (so they followed behind him).</p><p>“I say!” exclaimed Aelfric once he reached Donteaus. They viewed a tall tree that was further ahead; the tree was the tallest in the forest.</p><p>“I wonder the height of this tree?” questioned Tatianus.</p><p>“We might get a look at the entire forest at the top of the tree. And look there’s even a tower, do you see?” asked Donteaus.</p><p>“Yes,” Aelfric confirmed.</p><p>“Let’s walk to it,” suggested Donteaus. He began to walk towards the tree with Aelfric and Tatianus.</p><p>“Have you ever heard ‘The Tale of the Wooden Tower’?” asked Aelfric. “No,” answered Donteaus and Tatianus.</p><p>“The tale is about a young dressmaker, from the kingdom, who ventured into the forest to look for a giant sequoia tree. The young girl needed wood from this tree because it was said to be the finest piece of wood and could create the best sewing needles a tailor should have. It’s said that the dressmaker traveled so deep into the forest that by the time she found the tree, she didn’t know how to get back to the kingdom. But the tree had a wooden tower built at the top. And the young dressmaker sits in the tower waiting for a young prince to rescue her and help her back into the kingdom.”</p><p>“And you believe this is the tree?” asked Donteaus. “It’s just a tale,” answered Aelfric.</p><p>As they approached the tree, the sunset had made the sky turn pink. They stared at the tree and noticed that there was a very old rope ladder leading to the tower on the bark.</p><p>“Who will go?” asked Tatianus (who was scared of the task).</p><p>“I will,” Donteaus bravely volunteered. “I will climb up to the wooden tower and look for any signs of the company or the camp.” He fiercely grabbed the rope of the ladder as if he was reaching for his sword.</p><p>“Whatever happens don’t fall down,” warned Aelfric.</p><p>“Worry not Uncle,” said Donteaus. He began climbing, leaving Aelfric and Tatianus watching him nervously. Donteaus climbed and climbed; with every step he took he wasn’t afraid. When he reached the top of the ladder he looked back at the view before stepping into the wooden tower. The view was very lighthearted for the young knight who had seen all but war.</p><p>He saw the landscape of the entire forest and even the beautiful pink sky. Then, he climbed inside of the wooden tower and perceived the smell. It smelled of very old perry. He looked around and the tower appeared occupied with hangings of dresses on the walls, and a figure laid covered in deer fur on a straw bed.</p><p>Who could it have been? A knight sent to stand guard and watch the forest? Donteaus had no clue. So he walked slowly over to the bed. He pulled the deer fur over and there slept a feeble old woman. She had felt the coldness of the air and awakened. Her grey eyes matched the color of the satin dress she wore. And when she saw Donteaus she panicked.</p><p>“Ahh!” she screamed out. She got out of the bed and moved around the tower frantically. Donteaus tried to calm her down but she wouldn’t stop. Until, she backed into a nail that held the ladder.</p><p>“NO!” screamed Donteaus. He ran past her to reach for the ladder. But it was too late, the ladder was gone. He looked down at the view, frightened that he may never reach the ground again.</p><p>“Sorry boy, I thought you were someone else,” the old woman apologized. “It’s gone! The ladder is gone. And now we’re stuck up here.”</p><p>“I’ve been stuck up here for a long time boy,” said the old woman. “You—you’re the dressmaker?” asked Donteaus.</p><p>“Yes, and I’ve been waiting for someone to rescue me and show me the way back to the kingdom. Who are you boy?”</p><p>“Why didn’t you just climb down and walk into the direction you felt the kingdom was in?”</p><p>“Because, boy I didn’t know where I was going. I had walked for miles, in circles and still did not run into the kingdom. Then, I found this tree. The one tree that I needed wood from to make these needles,” said the dressmaker. She pulled out three carved wooden needles, from her pocket. “These wonderful needles were worth it. They create precision for even the most toughest fabric. I’ve created all these dresses you see hanging before you made from the tower’s curtains, rugs, and tapestry.” But Donteaus seemed less interested about the the dresses she created with her wooden needles.</p><p>“How was any of that in this tower? What is this place? How did you survive?” questioned Donteaus.</p><p>“This was an abandoned watch tower created shortly before I arrived, during the time of your father’s father. It was created for knights who were watchers of the forest. I survived by the stock abundance of food and perry that was kept in this watchtower.”</p><p>“A watchtower,” repeated Donteaus. He rapidly walked back over to the ledge and viewed the forest one more time. At that time, the sky had turned purple giving out some light. Donteaus looked beyond the trees and saw smoke further northeast, with light reflecting off of red and purple tents.</p><p>“The camp! They are not far from here!” cheered Donteaus. “Aelfric! Tatianus!” he shouted looking down for them, but heard nothing in return.</p><p>“Why are you shouting boy?” asked the dressmaker disturbed by his loudness.</p><p>“My kin is waiting for me below. We’ve been searching for camp because our company left us behind. If you and I can make it down, then I will take you with us to the camp then back into the kingdom,” suggested Donteaus.</p><p>“But how will we get down?” she asked (Donteaus asked himself that same question). He looked around at her creations and analyzed the fine needlework.</p><p>“We will climb down with your dresses,” answered Donteaus. With the help of the dressmaker the two of them took down all the dresses and tied them all together (all twenty seven dresses). He then tied the dresses to the nail that once held the ladder.</p><p>“Hold onto my back real tight,” demanded Donteaus.</p><p>“I surely will,” said the dressmaker. Donteaus climbed down the tall sequoia tree with the dressmaker on his back. He stared at the wooden tower the entire way down. The tower may have had some misfortune for the knight but also contentment. He not only found the way to camp but also rescued the dressmaker from the wooden tower. When the dressmaker’s feet touched the ground she followed the three knights to camp, and there Donteaus took a horse and the two of them rode to the kingdom—where a celebration for the returned dressmaker paused the war for two days.</p>"}