{"title": "The Fox that Fluffed", "author": "Michael Pollentine", "level": "6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Fox,", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p> Your parents may tell you that you should eat your greens; probably trying all sorts of tricks to get you to eat your broccoli or sprouts or cabbage or even lentils. And they are right, for vegetables are healthy, help you grow and they can be very tasty too! (Honest!) What they might not have taught you – which is the most important bit I think you will agree – is that some of these vegetables can cause some real woofters to escape from your backside. There is nothing funnier than a loud rumbling botty burp that causes the windows to rattle.</p><p>Pepper the fox lived in a little shed near a stream and most of the day she would tend to the allotment that was near to her home. An allotment is a little patch of land where all sorts of tasty vegetables and fruits are grown. She looked after this little patch for her friend Hamish the Hedgehog who was too old to do it alone. Looking after the allotment was tiring work, so she would eat the vegetables, which unknown to her gave her terrible wind.</p><p>It was a beautiful and sunny day. Butterflies and bees darted from flower to flower, birds sang and fed their young safe in their nests in the high trees. A tiny fawn gently sipped from the stream unaware of Pepper the fox sneaking up behind her. Pepper was in the mood for a tasty deer so she tiptoed towards the little fawn. Closer and closer she creeped to the fawn obliviously lapping water from the cool stream. Pepper bent her legs ready to pounce but all of a sudden:</p><p>Fluff!</p><p>The bees and butterflies all fluttered and scattered at the huge scary ripper that erupted from Pepper’s backside. The mother birds and father birds covered the ears of their young. The little fawn saw the hungry fox about to jump at her and scarpered back to her mother in fright.</p><p>Poor Pepper the fox, she always broke wind at the worst possible moment. She skulked off, the cheeks on her face red with embarrassment.</p><p>“I fancy sinking my teeth into a nice juicy bit of beef and washing it down with a cool glass of moo juice,” Pepper announced to a cabbage she was chewing.</p><p>So Pepper the fox went hunting again spotting a cow sitting calmly alone on a hill. Cows can be pretty silly sometimes and this cow was just sat down chewing the grass with its eyes closed.</p><p>“This will be easy,” said Pepper barely able to contain her giggling as she prowled towards the cow.</p><p>But just as she was behind the cow a squeaky noise escaped from her bottom.</p><p>Parp!</p><p>The cow stopped chewing and opened its eyes.</p><p>“Moo!” it said, turning around only to find itself face to face with a young hungry fox. This gave the poor cow such a fright that it jumped back and rolled down the hill in a tumble of black and white coming to a stop shaken but safe at its home in the farm.</p><p>Pepper the fox stamped her feet. It just was not her day. But she refused to wallow in self-pity.</p><p>“I quite fancy a bit of bacon and a few sausages,” she said rubbing her hands together with glee. So she skipped until she arrived at a muddy field. Two pigs stood in a sty gobbling down swill.</p><p>Pepper the fox licked her lips. She was quieter than ever this time. Her paws made not a sound as she crept behind the chomping pigs.</p><p>“Either one will do,” she thought.</p><p>The scoffs and oinks of two pigs guzzling their dinner allowed Pepper to skulk so close she could almost touch their tails. Then it happened again. She felt a gust leave her botty.</p><p>But there was no sound.</p><p>“At last a bit of luck – a silent one,” she thought only to be struck by an awful smell. But this smell wasn’t from the pigs it was the windy pop that she had just let free. It was so bad it brought tears to her eyes.</p><p>Both pigs stopped munching.</p><p>“Cor blimey what’s that awful pong?”</p><p>They looked at each other in disgust and then at their backsides, spotting Pepper the fox behind them.</p><p>“SQUEEEEEEAL!” they screamed and in their panic ran straight over Pepper trampling her into the mud.</p><p>“I think I would like a nice chicken,” she said cleaning herself as the sun began to disappear.</p><p>So Pepper scampered off to Old Fred’s Farm hopping over the fence and to the chicken coop like a ninja.</p><p>All the chickens sat simply, their gormless faces staring into space. Chickens are not the brightest of farm animals. In fact they can be quite dizzy a lot of the time.</p><p>“This will be easy,” she whispered to herself.</p><p>She reached out to grab a rather plump bird but only centimetres from wrapping her paws around it she felt a little rumble in her tummy followed by the loudest ripper you have ever heard erupting from her bottom like an earthquake.</p><p>Feathers and straw flew into the air followed by gobbles and shrieks and the flapping of wings. Pepper the fox tried shushing them to keep them from waking the farmer. But it was too late…</p><p>“Who’s there?” shouted Old Fred reaching for his gun.</p><p>Pepper gulped.</p><p>‘BANG! BANG!’ went the farmer’s shotgun.</p><p>Old Fred the farmer is short sighted and not a very good shot, in fact he actually shot both the tyres on his tractor.</p><p>Pepper made it home to her little shed by the stream safe and sound albeit a little tired, bruised, embarrassed and hungry. Sitting herself down next to her allotment once again having to make do with a dinner of sprouts, lentils, broccoli and cabbage, she could not understand why she kept breaking wind. She bit into a big sprout.</p><p>PARP!</p><p>Pepper couldn’t help but smile.</p>"}