{"title": "The Fox", "author": "Patricia Kings", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "Fox,", "length": "01 - 05 mins,", "body": "<p>The fox looked furtively this way and that, its bushy red tail sweeping the earth. Green eyes glinted in the darkness of the wood as he heard the thundering of hooves and baying of hounds ever nearer.</p><p>His heart thudded in his ribs as they came into view. Weaving in and out of the trees, a picture in their scarlet jackets, black trousers and hats, the horses hooves squelched in the soft peat and leaves.</p><p>Oh dear I will have to be crafty today, thought foxy as he ran through the wet undergrowth from last night’s rain, making his shiny coat soggy.</p><p>Haven’t they any thing better to do, he thought.</p><p>Rabbits scuttled about, startled at the noise, with their white cotton wool tails bobbing, birds chirping in the trees and badgers peeped out of sets in alarm as the horses galloped through the woods.</p><p>Seeing a hollow tree he shot inside.</p><p>They can’t get me in here, he laughed to himself as the hunt went by, but one nosy hound sniffed round the hole, howled so much that one of the huntsmen came back to round him up</p><p>“He cannot be in there; it wouldn’t have the sense,” he said to the hound.</p><p>That’s what you think, thought foxy. As soon as they had gone he climbed out and went the other way.</p><p>One of the hounds spotted him and gave chase.</p><p>“I’ll have you now!” he barked and pelted after foxy who was getting exhausted and scared.</p><p>He managed to clear the woods; cross a field with the hounds and huntsman hot on his tail. He got through the hedge and plunged into a stream on the other side killing his scent</p><p>“Brr, it’s cold!” he shivered. The water had a pungent smell of cow manure and dead leaves. Foxy did not like this one bit.</p><p>“We’ll get him when he gets out,” said a robust woman, who looked awkward on a horse.</p><p>“I hope she falls off,” said foxy wickedly.</p><p>He crept under the bank that hung low over the water. A large brown water rat looked at him strangely.</p><p>“I have never seen a fox swim before,” he said.</p><p>The hounds were getting impatient and no amount of pushing could get them in the icy stream. The hunt moved off reluctantly.</p><p>When they had gone a few yards Foxy scrambled onto the bank and shook the water from his coat, droplets sprayed everywhere. He doubled back to the woods.</p><p>“There he is!” shrieked the woman, as fox slipped through the hedge. The fat woman could not quite make it over the hedge and both horse and rider fell into a rather muddy puddle.</p><p>The fox looked on with glee, then sloped off into the undergrowth with the hunt after him. The poor woman was left to her plight.</p><p>He came out of the wood into someone’s garden the hunt men following. A lady came out of the house after hearing all the noise.</p><p>“I don’t want them animals in my garden, clear off!” she cried, throwing a bucket of water.</p><p>The dogs yelped in surprise, as they didn’t like cold.</p><p>The leader apologised saying it was the fox’s fault. But she wasn’t having any of it.</p><p>“ If you didn’t chase the poor creature it wouldn’t come this way. You should be ashamed of yourselves,” she retorted.</p><p>Meanwhile, foxy was watching with wicked delight, then seeing the door open he slunk into the house to the kitchen where he espied the woman’s dinner on the table. He jumped up and ate it all.</p><p>When she came back, she screamed ”Where’s my dinner? I bet one of those hounds took it while my back was turned!”</p><p>Then she saw him sitting in front of the fire and hadn’t the heart to turn him out when the huntsman were still there, so she shut the door.</p>"}