{"title": "The Rooster that Wouldn’t Crow", "author": "Artie Knapp", "level": "3 to 5,6 to 8,9 to12,", "category": "Funny,Illustrated,Modern,Original,", "tag": "Rooster,", "length": "05 - 10 mins,10 - 15 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Rooster1-opt.jpg'></img><p>It was the driest summer on record, and all the crops were wilting away. Every farmer in the region was reeling from their losses.  Desperate to change his fortunes, Peter Harpole decided to try his luck with poultry farming.  Peter didn’t know much about chickens, but selling eggs would be a great source of food, and hopefully income for him and his family.  If he was successful at it!</p><p>As the sun got closer to rising over the Harpole farm, Toby, the Harpole’s new rooster, took his place atop a wooden fence next to the barn. It was Toby’s first chance to showcase his ability to crow.  Peter purchased Toby the night before from the McHenry farm down the road. The Harpoles were desperate for a good crower, because the other rooster on their farm had laryngitis. With the purchase of Toby, the Harpoles now had a total of two roosters, and twelve hens.</p><p>When the sun broke across the horizon it triggered Toby’s internal clock. He clinched the spurs of his feet against the wood, and then proceeded to belt out the loudest MOOOOOOOOOOO you ever heard. Again, and again, Toby proceeded to belt out  MOOOOOOOOOOO, MOOOOOOOOOOO, and MOOOOOOOOOOO some more.  Toby’s mooing shocked everyone on the farm – especially since the Harpole’s didn’t own a cow.</p><p>“Ma, did you hear that?” asked Peter to his wife.</p><p>“Are you referring to the biscuits in your stomach, or our new cow you forgot to tell me about?”</p><p>“I didn’t buy any cow.”</p><p>Peter got up from the table and proceeded to walk out the front door of his home.  His two daughters, Annie, and Ellie followed him.</p><p>“It’s probably just some old cow that got loose from the McHenry farm, Peter,” shouted Mrs. Harpole from behind the screen door.</p><p>As Peter and his daughters approached the barn, Toby was still sitting atop the wooden fence.</p><p>“Hello, Toby. Where’s the cow at?” asked Peter.</p><p>Toby didn’t say anything.</p><p>“Toby, where did that mooing come from?” asked Peter.</p><img src='https://xcx.mdavid.cn/img/Rooster2-opt.jpg'></img><p>Toby started to shake because he still had some moo left in him.  He tried to keep it inside, but his body started to twitch as if he had been holding his breathe for over two minutes. His shaking became uncontrollable.  Unable to hold it in any longer, Toby let out the loudestMOOOOOOOOOOO ever heard in Brackford County.</p><p>Annie and Ellie jumped up and down with excitement.</p><p>“Daddy, we have a cow now,” said Annie.</p><p>“Yeah, listen to him moo, Daddy,” said Ellie. Both of the girls laughed hysterically.</p><p>“We don’t have a cow. What we’ve got is a rooster with a weird sense of humor.  Girls, go inside with your Mother. I want to talk with Toby alone please.”</p><p>“But, Daddy, I want to play with him,” said Ellie.</p><p>“You heard me. Get along now.”</p><p>As the girls walked away disappointed, Peter looked Toby over and shook his head. “Well, let’s take it from the top,” said Peter. “What’s with the mooing, Toby?”</p><p>“Mr. Harpole, you seem really nice and I hope that you’ll have some patience with what I am about to share with you.”</p><p>“All right, I’m listening,” said Peter.</p><p>“I’ll explain the mooing in a minute, but first there is something I have to tell you. Last night, I was taken from my home, and nobody even asked me if I was okay with it.  I had a life at the McHenry farm and was very happy there.”</p><p>“Toby, this is your home now.  I paid for you.  Mr. McHenry was your rightful owner and he had every right to sell you if he wanted.  If it’s a nice hen you’re looking to settle down with they’re plenty available on this farm.  In case you haven’t already met her, Hazel’s the cute brown-and-white colored hen over in the henhouse.  She’s a little feisty, but I think you two would hit it off once you got to know her.”</p><p>“But I already care about somebody else, and I miss her terribly,” said Toby in a sad voice.</p><p>“Toby, you’re going to have to get used to living here.  This is your home now.  Forget that hen over at the McHenry farm, and move on with your life.”</p><p>“She isn’t a hen,” said Toby.</p><p>“What do you mean?” asked Peter with a puzzled look on his face.</p><p>Toby broke out in tears and said, “My Edna, oh how I miss my dear Edna.”</p><p>“All right, all right, take it easy.  Edna’s very important to you.  I get it.  That’s nice.  I am curious though, Toby – if Edna isn’t a hen, what is she?”</p><p>“She’s a cow, Mr. Harpole.  Edna is a big, beautiful cow.”</p><p>“You’re joking, right?” asked Peter.</p><p>“No, sir, I’m not.  That’s why I’ve been mooing.  I told Edna before I was taken away that I would moo as loud as I could for her.  I want her to hear me so she knows I am thinking of her.”</p><p>“Toby, the first question I have for you, is how did you fall in love with a cow?  You’re a rooster for crying out loud.”</p><p>“Whoever said love was easy, Mr. Harpole.”</p><p>“Well, I’ll give you that.  But Toby, Mr. McHenry doesn’t have any other roosters to sell.  I asked him about that last night.  He’s one of the few farmers close by that even has chickens.  Farmers in this region aren’t looking to sell their roosters right now anyway, because they’re trying to breed them.  If you haven’t noticed the crops aren’t doing so well this year.”</p><p>“I realize that Mr. Harpole, but what’s the problem with me mooing anyway?  Is it really that big a deal?” asked Toby.</p><p>“When it’s coming from a rooster, yes, Toby it is.  Let’s say word gets out around town that my rooster moos instead of crows.  The local grocers would probably quit buying from me, because they think I have defective chickens.”</p><p>“This just isn’t fair, Mr. Harpole.”</p><p>“Toby, I want you to think about everything we’ve discussed.  Bright and early tomorrow morning, when you start to cackle, I’ll be expecting to hear several loud crows out of you.”  As Peter walked back toward the house, Toby collected his thoughts and pondered what he was going to do.</p><p>“Excuse me,” said one of the hens to Toby.  “I hope you don’t mind, but I was listening to your conversation with Mr. Harpole, and I would like to offer you some friendly advice.”</p><img src='https://xcx.mdavid.cn/img/Rooster3.jpg-opt.jpg'></img><p>“Sure, fire away,” said Toby.  “I could use it right now”.</p><p>“Well, first you’ve got to understand Mr. Harpole’s just trying to make an honest living to support his family,” said the hen.</p><p>“And what’s so wrong with our place anyway?  I think you would really like it here if you gave it a chance.”</p><p>“Let me stop you right there.  I completely understand and appreciate Mr. Harpole’s situation.  I really do.  But what kind of life are we living for ourselves, if we just settle for whatever makes everyone else happy?  This is a great farm, and everyone here has been wonderful so far. This isn’t about where I live.  I’m talking about how I live.  I’m talking about being with the one I care about.  Please don’t take this personally.”</p><p>“It’s a little hard not to.  Your wanting to be on a different farm is one thing, but wanting to get back to a cow; well, now every hen on this farm believes you feel you’re too good for them.”</p><p>“That is absolutely not true.  Haven’t you ever been in love?”</p><p>“Yes, Toby, but it wasn’t with a frog, a goat or a tiger.  His name was Charlie, and he was, believe it or not, a rooster.  Look, I’m sorry.  I didn’t mean anything by that.  I know this is tough, but you’ll figure everything out.  My name is Paula, Toby.  If you ever need to talk just come over to the coop and peck three times.”</p><p>“I will, Paula.  And thanks for the advice.”</p><p>Toby couldn’t sleep a wink that night.  He didn’t know what he was going to do.  He thought about running back to the McHenry farm, but was afraid that would get him and Edna both in trouble.  The next morning as the sun peeked over the horizon, Toby followed his heart and let out a very loud MOOOOOOOOOOO.  About ten seconds after doing so, Peter ran out of the house to confront Toby!</p><p>“Toby, what are you doing?  Did you not listen to a thing I said yesterday?”</p><p>“I did, Mr. Harpole.  But I’ve got to do what I believe in.”</p><p>Peter shook his head and went back into his house to get the keys to his truck.</p><p>“Where are you going so early?” asked Mrs. Harpole.</p><p>“I’m going to town to hopefully find a buyer for that crazy rooster.”</p><p>“Daddy, please don’t sell Toby? We love him,” pleaded Annie.</p><p>“I don’t have a choice, Annie.  We’ve got to make a living.” Peter stormed out of the house and sped off in his truck.</p><p>“Mommy, please don’t let Daddy sell Toby? Please, Mommy!” cried Ellie.</p><p>The next month was not the best of times at the Harpole farm.  Peter had failed to find a buyer for Toby, because word had already spread about his mooing rooster.  Every morning Toby mooed with all his might.  People were starting to flock to the Harpole farm like seagulls to see Toby moo his heart out.  When Toby’s unusual behavior was mentioned in the local paper, Peter had all he could stand, and decided he would have to find a buyer for Toby out of the region.  He didn’t care if it meant driving three states away.  Peter wanted to be done with this troublesome bird once and for all.</p><p>One evening during supper, Peter mentioned his intensions to sell Toby out of state. It didn’t sit well with his daughters.</p><p>“Daddy, I am begging you. Can we please keep Toby?” asked Annie.</p><p>“Annie, we’ve already talked about this.  We can no longer have this rooster causing so much disruption in our lives.”</p><p>“He doesn’t cause me dis-rup-tins, Daddy,” cried Ellie.  Peter looked at his daughters’ sad faces and it tore him up inside.</p><p>He got up from the table and walked outside to take a walk.  As Ellie was being consoled by her mother, Annie became excited and blurted out, “I have an idea, Mommy.  I have an idea how we can save Toby.”</p><p>“Well, what is it?” asked Mrs. Harpole.</p><p>“Toby wants to be with Edna more than anything, right?”</p><p>“Yes, I’m listening.”</p><p>“Well, why can’t Toby and Edna be together at the petting zoo in Belvar?”</p><p>Mrs. Harpole was sold on Annie’s idea the moment she suggested it, and was anxious to share it with Peter upon his return.  Mrs. Harpole believed in her heart this could be the solution to their ever-growing dilemma.  And it was.  After a long sit down talk with both Peter and Mr. McHenry, the Belvar petting zoo agreed to take on Toby and Edna as pets.</p><p>Most of the money generated to see this unusual couple would go to the petting zoo, and the rest would be split equally between Peter, and Mr. McHenry.</p><img src='https://xcx.mdavid.cn/img/Rooster4-opt.jpg'></img><p>In no time at all Peter had made more money from the zoo than he would have with twenty roosters on his farm. As for Toby and Edna, well, they’re still together to this day.  They couldn’t be happier.  People who see them now don’t find it that odd anymore. But they do have the strangest looking kids you ever did see.</p>"}