{"title": "The Hummingbird Who Chewed Bubblegum", "author": "Artie Knapp", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Bird,Hummingbird,", "length": "01 - 05 mins,", "body": "<p> </p><img src='https://xcx.mdavid.cn/img/The-Hummingbird-Who-Chewed-Bubblegum-opt.jpg'></img><p>There was a little hummingbird in my neighborhood that usually perched on my windowsill. I enjoyed hearing her sing, but I hadn’t seen the little hummingbird for several days. About a week ago, a bad storm came through and blew all the flowers away. I felt sorry for the little hummingbird. She must be hungry and flew somewhere else, I thought to myself. Then one morning the little hummingbird reappeared on my windowsill.</p><p>“Where have you been?” I asked the little hummingbird.</p><p>“Just out flying around,” replied the little hummingbird.</p><p>“Did you find anything to eat?” I asked.</p><p>“Oh there’s plenty of food, but all the twigs and straw were blown away with last week’s storm,” said the little hummingbird in a sad voice.</p><p>“I am sorry to hear that. What are you going to do?” I asked.</p><p>The little hummingbird shrugged her feathers and said, “Well, I have an idea, but I need a favor from you.”</p><p>“Sure, anything,” I said.</p><p>“Can you please give me some bubblegum?” asked the little hummingbird. I was surprised that a hummingbird would ask for bubblegum, but I was happy to share it with my friend. The little hummingbird chewed the gumballs I gave her, and then blew a bubble bigger than her entire body. She thanked me for the bubblegum and then flew out of sight.</p><p>The very next morning the little hummingbird reappeared on my windowsill, and asked for a couple more pieces of bubblegum. Like before, I was surprised that a little hummingbird would ask for bubblegum, but I was happy to share it with my friend. The little hummingbird chewed the gumballs I gave her, and then blew a big bubble. She thanked me for the bubblegum and then flew out of sight.</p><p>A couple of days passed and I hadn’t seen the little hummingbird. I wondered what she was up to. One sunny day I was outside playing when a voice called out my name. I looked around but didn’t see anyone. The voice called out my name again, and this time I realized it was coming from the oak tree in my back yard. It was the little hummingbird who was calling out my name, and she was sitting in a red, orange, and blue nest.</p><p>“Look what you helped me build,” said the little hummingbird.</p><p>“What do you mean?” I asked.</p><p>“Well, since the storm blew all the straw and twigs away, I had to find something else to lay my eggs in. Because of your wiliness to share your bubblegum with me, I was able to build this nest for me and my family. Thank you,” said the little hummingbird.</p><p>I climbed up the oak tree, and sure enough there were two little eggs the size of jelly beans laying in the nest made of bubblegum. It felt good to share my bubblegum in the first place, and once I realized it helped the little hummingbird build her nest it made sharing feel even better.</p><p style=\"text-align: center;\"><strong>THE END</strong></p>"}