{"title": "The Cucumber Harvest", "author": "Patricia Kings", "level": "3 to 5,6 to 8,", "category": "Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Sam helped his uncle Reg pot the cucumber seeds and water them.</p><p>“These tomatoes smell nice uncle,” Sam said, as he noticed their bright green leaves.  Ever since his father had died he’d taken on the garden with the help of his uncle.  Although only twelve, he grew potatoes, lettuces, carrots and cabbages, runner beans and onions.</p><p>A few weeks later, Sam came running into the house all of a fluster.  “My cucumbers  are flowering!”</p><p>His mum smiled at seeing him so happy.</p><p>“Take off your boots and get your tea.  I will come and look then you must do your homework.”</p><p>Sam’s  mum peeked inside the greenhouse the cucumber plants had lovely yellow flowers.</p><p>The following week Sam shouted  to his mum – “My cucumbers look strange!”</p><p>She was surprised to see that the cucumbers were yellowy, only longer and wider.</p><p>“How did you get them to grow like this?”</p><p>“I only used tomato feed, uncle Reg showed me.”</p><p>Every day Sam tended his vegetables then they went away for a week, leaving his uncle to look after the garden.</p><p>When they came back his uncle stood in the garden with a worried look on his face</p><p>“What’s wrong?” asked Sam.</p><p>“Look at the greenhouse,” Reg said.</p><p>Sam gazed at it in wonder; there was a hole in the greenhouse with cucumbers reaching for the sky bending this way and that.</p><p>“I only  put marrow and cucumber seeds together, we will have to cut them now,” said Sam.  “Can we eat them?”</p><p>“Don’t know,” his uncle said.</p><p>Sam helped Reg cut them then they decided to try one. It tasted like a marrow, but more of cucumber, juicy and slightly sweet,.</p><p>Sam and Reg put a couple of his cucumbers in a wheelbarrow and took them down the village hall for the garden show.</p><p>Everyone stared in surprise as they walked down the street – they were the centre of attention bringing in crowds of people.  They won first prize and had their picture in the paper with the caption: the new vegetable by twelve year old Sam.</p>"}