{"title": "The New Day Underground", "author": "Jeffrey Duchene", "level": "9 to12,Teen,", "category": "Modern,Original,", "tag": "Hedgehog,", "length": "10 - 15 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Hedgehog-1-opt.jpg'></img><h2 style=\"text-align: center;\"><em>The Hum Drum</em></h2><p>Under rolling hills and fertile grounds, beneath all the hustle and bustle of everyday life in the wood, lay the borough of “The Very Happy Home for Dad and Mum.” It’s a lovely little retirement place for the aged of forest creatures all, forgotten and not. Safe and secure, it is nestled under an old potting shed, overgrown and taken back by the forest.</p><p>Here amongst the tired mix, lived four elderly groundhogs. Reunited after a long life of hard work and rearing of children, the four friends seemed mildly pleased, and somewhat content with the fact, that this is where they will live out their lives in peace and quiet. Until one day…</p><p style=\"text-align: center;\">*****</p><p>Jeffrey, had always been a painter, and was quite proud of the grand and opulent dwellings that he had embellished through the years. Daryl was an Indian Chief with great responsibilities until now, but he did still retain humble respect from amongst his tribe. Stanley had been a postman who had delivered mail with steadfast loyalty to every creature, common and royal. And Valeriano. Although a constant seeker of fun and frolic, he had worked in a shop of wood creations.</p><p>After an exhausting day of arts and crafts, classic cinema, and balloon volleyball, the four friends sat reading by the fire. Every now and then, they would silently study each other from behind a good book or the daily papers.</p><p>“What day is it anyway?” Stanley asked.</p><p>“In this place… it doesn’t much matter!” replied Val.</p><p>“Who’s up for a good game of something-or-other?” asked Jeffrey.</p><p>“I’ll pass.” said Daryl.</p><p>“Hey-hey, maybe not.” said Stanley. He kept reading.</p><p>“If its cards again, count me out!” said Val, as he crossed his legs and turned the page of “The Daily Dirt”.</p><p>“Well aren’t we the merry bunch!” said Jeff as he dropped his book to the floor and removed his reading glasses. The others payed no mind. Then Jeff continued… “A breath or two away from “the big sleep”, and here we are then!”</p><p>There was a long silence, then a deep burp from one, and a short trumpety fart from another. This, drew a brief chuckle from all, but Jeff. With the usual frustration, he wasn’t at all amused, and he wasn’t giving up either. He quickly shot up and said… “Let’s look up old Becky, Lorinda, Debbie and Renee. We can head out and… trip the lite fantastic!” (A night of dancing out on the town) Still, there was no reaction.</p><p>Jeff let out a heavy sigh, as not a one of the old boys made a sound, or even looked away from their reading.</p><p>“There must be something!” he thought. “Something to turn around this hum-drum day”.</p><p>Just then, a fellow resident came strolling slowly by, quietly singing to himself the saddest of songs.</p><p>“I’m not half the man I used to be. Oh yesterday, came suddenly.”</p><p>And that was it. Up, sprang Jeff from his chair! The other boys dropped their reading and watched as he danced a silly jig, and cried… “That’s it! That’s it! That’s absolutely it! That’s positively, unequivocally, without a doubt, they’ll twist and shout! That’s it!”</p><p>Stanley was the first to speak as Jeffrey danced about.</p><p>“Hey-hey, what is? What’s positively it?” Daryl and Val were interested now, as they both sat up in their chairs and scratched their heads.</p><p>“The band!” cried Jeff. “We’ll get the old band back together! The New Day Underground!”</p><p>Stan and Val slid back in their chairs and picked up their papers. But not Daryl. His eyes grew a little bigger as he pulled his tobacco pouch, and loaded his pipe.</p><p>“I’ve still got my bass guitar.” he said, as he lit the pipe and blew a perfect ring of smoke into the face of Val, who waved and coughed and said… “That’s preposterous man! Are you quite mad? Are we not too old and slow for that sort of thing? Surely we’ve forgotten all the words of songs, and even, how to play guitar!” This only made Jeffrey all the more determined to roust the boys and do it!</p><p>“One is never too old for music!” he said. “Music is art! Music is timeless! The words will come back! You’ll see. And playing guitar is like… riding a bicycle, you never forget how! Come on Stan, pull out the old drum kit! Come on Val! I know you’ve still got the old “axe” in your closet. Let’s give it a go man! Let’s give it a go!”</p><p>At that moment, the four old comrades slipped off into a daydream of sorts. Their minds went back to a time when they were young teens. The band would rehearsed in Debbie’s garage, with friends all hanging about, singing along and having great fun. And then, there was the performance in the “Battle of The Bands” at the Great Fair. Not to mention all of the concerts at Jolly Road Park, and the many school graduation parties.</p><p>And just when their hearts had come to light with these grand old memories, it all abruptly stopped! Their faces drew a blank, as they then recalled how their young lives were interrupted when they were sent off to fight in the “Great Orchard War.”</p><p>It was a sad and tragic time that was set back in the minds of all, and rarely if ever spoken of. They sat in silence for a long moment, and then…</p><p>“I’ll do it!” said Stanley.</p><p>“You can count me in!” said Daryl.</p><p>And then, all eyes were on Val. Always the holdout, Val had to think just a few seconds longer before he said… “Alright, I’ll do it! But I insist we let Gordon back in the band!” (Gordon was the founder of the band, but an angry sort of fellow that pouted and bullied)</p><p>“Alright if that’s what it takes.” said Jeff. “We’ll look him up!” And with that, they all scurried off to pull out their gear, and pass the word on to the girls.</p><h2 style=\"text-align: center;\">Chapter Two</h2><h2 style=\"text-align: center;\"><em>Gordon the Copper</em></h2><p>The next day, the boys got together and set off. Cross the sunflower fields, and through the apple orchards. Then down around the edge of town, behind the old the flour mill. Back in the day when they were young, a trip like this was a hop, skip and jump for them. But now, it had taken an hour or more, as they stopped several times to rest from sore ankles and aching backs.</p><p>Only Daryl was in the best of shape. He scurried ahead with great ease. And as always, his sharp eye, and keen senses, were invaluable for the safety of all.</p><p>Under the stone slab of the old mill was the borough of their one time bandmate, Gordon. Not as much a likable character, and nowhere near as sociable as the others, his chosen path in life was that of a policeman (Now retired of course).</p><p>After a quick knock, and a pull of the bell, the door swung quickly open. And there, was their old mate. Standing tall with a firm, serious expression, he held a Billy club under his arm. And, he was sporting a clean, crisp, sergeant’s uniform. His eyes grew large at the sight of his old mates. And he spoke not one word.</p><p>“Let’s just cut to the chase then Gord… We’re putting the old band back together… The Underground man!” blurted Jeffrey.</p><p>Gordon just stood there. His eyes scanning back and forth, up and down. His persnickety manner and expression of judgement, unsettling.</p><p>A long moment followed. And then Gord let out a singing shout… “Dying to take you away… take you todaaay!”</p><p>And with that, he slammed the door shut, and could be heard marching off to his study. The boys looked at each other. Then, as if the whole reaction by Gordon had been expected, they just turned and slowly started back toward home.</p><p>“I could have told you.” said Stanley. “Not quite right, that one,” said Daryl.</p><h2 style=\"text-align: center;\">Chapter Three</h2><h2 style=\"text-align: center;\"><em>Like Riding a Bicycle</em></h2><p>In the days that followed, the boys reserved a time slot in the dining hall for their first rehearsal in over forty five years. Becky, Debbie, Lorinda and Renee were there, and sat anxiously waiting as the boys set up their gear and began… a sound check.</p><p>“I want to hear… “Please Mr. Postman!” shouted Lorinda while rapidly clapping her hands with nervous excitement.</p><p>“Play… “Twist and Shout!” said Debbie.</p><p>“No, no, I want to hear… “Mr. Moonlight!” cried Renee.</p><p>The boys were nervously, purposely, taking a painstakingly long time to prepare. Adjusting the microphones up, then down. Then back up again. Their eyes looked up at the ceiling as they tuned their guitars, then they tuned them again. And again.</p><p>Stan sat at his drums reading a book of the collecting of rare postage stamps. Soon the girls began to talk small amongst themselves, catching up on who is still with us, and who is gone. Having a good time with themselves, they lost tract of the band, and sat in happy chatter, sipping tea.</p><p>“Enough boys, let’s do something then!” said Jeff.</p><p>They huddled together for a quick talk, then walked back to the microphone stands. And, in perfect three part harmony, they started to sing…</p><p>“He’s a real nowhere man, sitting in his nowhere land, making all his nowhere plans for nobody.”</p><p>The band kicked in, in perfect time. “Spot on” with every chord and every guitar lick. The first song played in so many years, and it all fell together like magic.</p><p>“Oh my lord.” said Deb.</p><p>“Like riding a bicycle.” said Becky.</p><p>It wasn’t chance that they chose the music of the favorite band of all time. Nor was it chance that they had chosen that song, as it was the first one played for the girls at their graduation dance all those years ago. Appropriate as well, as it described Gordon the old fart who didn’t know what he was missing.</p><h2 style=\"text-align: center;\">Chapter Four</h2><h2 style=\"text-align: center;\"><em>The Gig</em></h2><p>It didn’t take very long before the word was out, and the boys were offered a show at “The Smoke’n Tea Room.” Val was the first to complain.</p><p>“That’s a spot for the youngsters! The Hippety Hoppers!” he said.</p><p>“Not to worry.” responded Jeff. “We’ll just have to show them a thing or two about good music, and good fun!”</p><p>The girls were all about it, and scurried off to find just the right things to wear.</p><p>“Smoke and tea, and youngsters is about right!” thought the boys as they set up their gear on stage the following evening, as this night spot sat in a foggy part of the meadow, giving the look of a smoke all around. And the crowd was all sipping it up, as the tea here comes in all colors and flavors.</p><p>A few of these regulars whispered amongst themselves and giggled when they saw the elderly act that was about to perform.</p><p>“Pay them no mind boys.” said Beck. “You just carry on, keep it tight, and remember… a good song knows no place or time.”</p><p>And then… the boys stepped up, and approached the microphones. With nervous excitement, Val called out to the crowd… “Hello there… we’re The New Day Underground! One, two, three, four… Well she was just seventeen… you know what I mean… And I saw, her, staaan-ding there!”</p><p>The boys were right on with their choice of song! The girls were up dancing, clapping, and singing along. And the crowd of youngsters were… sitting, and smiling, with a glazed look in their eyes as their thumbs fiddled excitedly about… the face of their mobile phones! They’re toes were tapping along to the beat, but they were transfixed, as if hypnotized by the tiny, silly messages that they sent to one another from across the room.</p><p>“Well I’ll be…,” thought Stanley.</p><p>“What the…,” thought Daryl.</p><p>“Son of a gun,” thought Jeffrey.</p><p>And “Go figure!” grumbled Val.</p><p>They played flawlessly through the set of ten songs, and Jeff finishing it off with… “Till… there was yooouuu!” The girls clapped and cheered, and shouted… “Bravo!”</p><p>The young crowd looked up with a smile, sipped their tea, and then, they went right back into thumb twiddling excitement.</p><p>On their way home that night, the girls chatted and gave great compliments as the boys silently took turns pulling the cart with their instruments.</p><p>“It a new day alright.” said Stan.</p><p>“Quite right.” said Daryl.</p><p>“Well I don’t get it!” said Val.</p><p>“You mustn’t take it to heart.” the girls explained. “The kids liked the music. They’re just all wrapped up in themselves for right now! In a short while, they’ll be a little older and look more at their changing world. They’ll listen back on the music of their Dads and Mums, and come to love it as their own. They’ll be just fine.”</p><h2 style=\"text-align: center;\">Chapter Five</h2><h2 style=\"text-align: center;\"><em>All Together Now</em></h2><p>As time carried on, so did the boys. The New Day Underground ended up…underground. Going nowhere… man. And that’s just the way they liked it!</p><p>Classic cinema, balloon volleyball, a good book by the fire. And, on Friday nights… a live show by the band in the dining hall. The girls couldn’t be happier as well. They served multicolored tea for all as the boys played their favorite songs. The elderly crowd nodding, toe tapping, dozing off, and bouncing up from time to time, singing along to…“All Together Now!”</p><p style=\"text-align: center;\">Copyright 2016 Jeffrey Duchene</p><p>A,B,C,D… can I bring my friend to tea? E,F,G-H-I-J… I love you… bum-bum-bum Bum, bum-bum… sail the ship Bum, bum-bum… chop the tree Bum, bum-bum… skip the rope Bum, bum-bum… look at me! All together now!</p>"}