{"title": "The Watcher Society", "author": "Ellen Draper", "level": "6 to 8,9 to12,Teen,", "category": "Fairy Tale,Fantasy,Modern,Original,", "tag": "Bird,Wolf,", "length": "15 - 20 mins,", "body": "<p>Drib had wandered all over the world from big city to little village seeking the gifted ones.   He had met many, but he was hoping before he was taken beyond life to find one with the special gifts spoken of in the prophecies.  He was sure it would be a young one as he easily connected with them more than the old ones – their light radiated much brighter.  The eyes of the young ones always had a glint and radiated an aura of color around their faces.  He could access their minds easier and get them mind-talking quickly.  The minds of the old were cloudy with earth thoughts.  He went undetected because with no verbal communication, the parents just thought a bird was singing.  Everyone else just thought animals sensed their children were nature lovers.</p><p>When he first flew over Egalliv there was a rainbow of aura rising from a multitude of houses; more than he had ever seen.  He felt certain this quaint little village held some special magic.  Not to mention it was beautiful with valleys, mountains, a river which meandered into a small lake, and a dense forest.</p><p>He loved having four seasons, each bringing its unique beauty. In spring the forest was a rainbow of new blossoms.  Autumn brought a golden sunset of yellow, red, and orange.  In the snowy white of winter it became an enchanted forest under the sparkle of the sun and the moon.  His favorite part of the forest was the ancient trees, from strong oaks, aspens that sang with the slightest breeze, to sturdy pines.  A variety of berry bushes grew every few feet.  Velvety green ferns filled the remaining open space.  It was so magical you expected to meet fairies and all sorts of fun creatures.  But best of all, in this thick forest it was easy to find a den to call home, and one big enough to hold many guests.</p><p>He found many watchers mingled with the ordinary birds and since his den was large enough, they could gather to share fun tales of far-away adventures.  Watchers were all different kinds of birds to help them go unnoticed.  They liked to roam the earth looking for gifted ones; the ones whose destiny it was to protect and watch over nature.  They all had been in Egalliv for a long time though, because it was different;, there were more gifted ones, both young and old than anywhere else on earth.</p><p>Drib first saw Elsa as a small baby in her mother’s arms.  She had deep intriguing blue eyes that sparkled with the light and made him feel like he could climb inside and journey to another world.  As she grew to a young lass, her fair skin was softened by her beautiful long white hair.  Her laughter was contagious – it floated through the air making even the grumpiest toad happy.  When he first saw her his feathers shuddered with excitement.  He knew she was special, more gifted than the others and that their destinies were somehow linked together.</p><p>As Elsa got older she sensed she was different from the other children in the village – a feeling that grew – a whisper that told her of a mystery that would someday manifest her destiny.  She wondered if it was something about her family.  But, they were not exceptional – father was a carpenter, mother a seamstress, and her brother was like every other boy in the village.  She was shy, but she had many friends she spent lots of time with.  Nothing different that anyone would call special.</p><p>When she turned ten, she was old enough to travel to her grandmother, Nana’s, house alone.   Mother asked if she wanted to take a fresh batch of cookies to Nana.  She was so excited.  This meant mother trusted her and it made her feel so grown up.  What a grand adventure.  She loved Nana, and her house was on the other side of the village in the middle of the forest.  She loved being in the forest with all the beautiful flowers, animals, and the arched pathway made by the ancient trees.  It was like being in a magical land.   It was spring and everything would be fresh and new, and she might even see some baby animals along the way which she could feed the crumbs she would tuck in her pockets.  After she finished her morning chores, mother loaded her bag and off she went.</p><p>As she entered the forest she heard the lively song of a new bird, one she had never heard before. The music was loud and seemed to be following her.  She turned around to see what kind of bird she had discovered, but jumped back with a start because a black bird with a crown of orange feathers was flying straight toward her face.  She raised the bag to block her face when she suddenly heard in her mind:</p><p>“Hi, my name is Drib, what is yours?”</p><p>I must be imagining things.  Did I just hear the bird talking in my mind?  What should I do?  Am I in a dream?</p><p>“No dream, and don’t’ be afraid. What is your name?”  Drib pleaded.</p><p>“Elsa,” she said out loud.</p><p>“Glad to meet you Elsa.  By your thoughts, I see that I’m the first watcher you have ever encountered.”</p><p>“What is a watcher, how can I hear your thoughts, and how can you read my mind?” Elsa stammered.</p><p>““Watchers are special birds who can transfer thoughts into the minds of gifted ones.  When a gifted one is upset, we can sometimes hear their thoughts.  Whole conversations go undetected by the non-gifted ones,” Drib explained.</p><p>Intrigued by his explanation, Elsa wanted to see if it was true.  “So I can send you thoughts, like, I’m not a gifted one; I just have a vivid imagination?</p><p>“Exactly,” he said, “You ARE a gifted one, though, and have much to learn, so if you don’t mind the company, I’ll sit on your shoulder and explain while we finish the walk to your grandmother’s house,” Drib pleaded.</p><p>Her new acquaintance he seemed harmless and friendly, but she was hoping her insides would stop shaking and her brain would start making sense before they started walking.  So, she said, “Ok, I guess you can join me, but before we go, I’d like to sit for a while and feed the crumbs I brought to my animal friends.”</p><p>As she on a tree stump, she started humming, and soon birds and animals were frolicking around her.  She was easily distracted seeing all the baby rabbits, squirrels and other small animals  The animals easily distracted her and her mind and body started to relax, but her peace was quickly interrupted by Drib.</p><p>“Have you never found it interesting that the animals and birds always come close and eat out of your hands?”  he asked.</p><p>“No,” she said, “I just thought it was because they were used to me.”</p><p>“Oh, no,” Drib replied, “only gifted ones have the ability to make such good friends of the forest animals.”</p><p>“How did you know I was a gifted one?” Elsa asked.</p><p>“I have been watching you since I first saw you as a baby in your mother’s arms.  You radiated a strong aura of color.  I’ve been silently waiting and watching until your aura was strong enough and the opportunity arose to introduce myself – and today is my day,” Drib shared.</p><p>While Elsa was feeding the crumbs she brought to her friends, a baby rabbit scampered over and jumped onto her lap. Still confused she asked Drib, “What are gifted ones supposed to do with their gifts?”</p><p>“Gifted ones,” Drib explained, “tell the watchers what dangers are lurking and what mankind has planned that might endanger nature.  For instance, if someone was going to cut down part of the forest, dam up a river, we would need to move our homes, or anything else that might harm us.”</p><p>As Drib spoke, she realized this was her mystery, the thing that made her feel special. She giggled, though, at the thought that a bird was the messenger. Suddenly, she was startled by a rustling in the undergrowth behind her.   She jumped to her feet, scaring off her little friends and Drib, who flew up to the nearest branch.  As she turned, a silver wolf with a black lightning bolt between his eyes was creeping toward her, eyes red with anger, teeth exposed, growling, like he was ready for the kill.  Fear and panic seized her whole being and she felt her legs and arms go stiff.   Her heart was beating so loud she thought it would drown out her very thoughts.  She could not outrun the wolf and her mind was racing with random thoughts that offered no plan of escape.  Tears started to trickle down her face; her mind telling her this was a horrific way to die.</p><p>Drib yelled at her “Raise your arms and jump up to the bottom branch of the tree.”</p><p>It was a large pine tree with the bottom branch at least six feet off the ground.  She was small, and there was no way that she could jump that high.  The adrenaline was racing and the wolf was getting closer.  She heard “Just JUMP.”  What happened next was like a dream – she found herself standing on the branch!  She grabbed another branch in front of her to steady her balance while she tried to think.  The wolf jumped with all his force hoping to reach the branch, but instead only made the tree swagger slightly.  Elsa hung onto the branch with all her might.</p><p>How did she get from the ground into the tree?  Was it merely the fear of being attacked by the wolf that had poured adrenaline into her body that allowed superhuman strength in her legs?  Was it magic? Did she have an unknown guardian angel or fairy godmother that came to her aid in her time of need?  Was Drib a magical bird and had the power to help her jump higher than humanly feasible? </p><p>She climbed up one more branch to put extra space between her and the wolf, which allowed her to gather her thoughts:  “Drib did you do this?”</p><p>He replied “No, my child I do not possess that kind of power.”</p><p>Suddenly, a flash of black feathers swooped past her and flew straight into the wolf’s forehead.  The wolf snarled at its attacker, but Drib was quick and had already flown up, turned around, and was headed back down to attack again.  After several failed attempts to catch Drib, and several good solid pecks to his head, the wolf yelped, and turned and ran off into the forest.</p><p>Elsie was too scared to move.  After her heart slowed to its normal beat, she realized she needed to get going or she would be late getting home from Nan’s house, and mother would be worried.  She was also anxious to get far away from the wolf.  She dropped her bag to the ground, and was going to slide off the limb as far as possible and then drop to the ground, hoping to break anything.  As she was getting into position Drib said: “Just jump down and see what your gift will do.”</p><p>“That’s crazy,” she said.  It is too far to the ground and I will surely break something.”</p><p>“Trust your gifts.  They got you up out of danger, so they can certainly bring you back down to safety,” Drib offered.</p><p>Elsa thought, this is crazy, but nothing was logical about the last few minutes, and it seemed Drib knew more than she did, so she jumped.  It was like a feather floating in the air gently lowering her to the ground.  Her landing startled her so much she stood still for several seconds.</p><p>Drib interrupted her thoughts with a joyful song,</p><p>““I have found one of the special ones! I knew it, you are more than gifted – you can fly!”</p><p>“That is ridiculous.  No one flies except the birds,” she responded.</p><p>“I have waited all my life to see the prophesy fulfilled that one day there would be gifted ones who had talents beyond our imagination,” Drib shared excitedly.</p><p>Elsa heard a rustle in the bushes and the fear of the returning wolf panicked her and she grabbed her bag and darted off through the remaining trail to Nana’s house telling Drib</p><p>“I’ve got to get to grandmother’s house and then back home before it gets late and mother starts to worry.”</p><p>Drib flew behind her.  When Nana opened the door she exclaimed “Elsa, whatever is the matter, you look like you’ve just seen a ghost.  Sit down and tell me what is the matter while you have some cookies and milk.</p><p>Elsa gladly sat in her chair at the kitchen table.  On top of everything that just happened now she was overwhelmed with what she should tell grandmother.  If she told the real story and how she flew up in the tree to escape the wolf, grandmother would think she was crazy.  Her parents would send her away or lock her up.  She was scared and confused.</p><p>Grandmother sat down at the table beside her and said, “Our friend, Drib, tells me something amazing happened.”</p><p>Elsa looked up with big open eyes and said, “Our friend – you can hear him?”</p><p>“Yes my child, I also have gifts,” grandmother said, “and Drib is the very bird that helped me find them.  But before we talk about me, let me hear your story.”</p><p>Elsa told her about the wolf and Drib and when she looked up, grandmother had tears rolling down her face.   Grandmother enveloped Elsa in a reassuring hug and said:  “I never imagined that one of my grandchildren would be a special gifted one like me.  This is the happiest day of my life and we have much to talk about.</p><p>Grandmother took Elsa in her arms and whispered in her ear “When you were born I saw the aura of color around you and always knew you were gifted, but today, I see that you inherited my secret.  I have never told anyone.”</p><p>Elsa had so many questions she couldn’t think straight, but she managed to say, “Are mom and dad gifted, and do they know?”  .  That is why I like living out here alone in the forest away from the village so I can use my gifts.”</p><p>“How did you learn you were special, grandmother?”  Elsa asked as she consumed several cookies.</p><p>“As a little girl, I always felt like there was something different about me, but I didn’t know what it was.  I was much like you – timid, but talented.  I had a connection with animals and thought this is what made me feel different than my friends.  One day when I was slightly older than you, my mother and father went to the village to sell vegetables.  They would not be back until dark and told me to do the gardening, light a fire under the pot of stew so it would be ready for dinner, and they would be back about the time it got dark.</p><p>I had done all my chores and was having a great time feeding bunnies and squirrels when suddenly I saw a silver wolf with a black lightening mark between his eyes hunched down, glaring at me with deathly red eyes.  He was creeping straight toward me, teeth bared, growling so ferociously my body started to shake.  All my forest friends scampered down their holes and I froze in my tracks thinking that my life was over.  Suddenly I heard a voice in my mind say jump.  I laughed out loud as I wasn’t under a tree and there was nothing to jump to.  But the voice shouted “JUMP” so I gathered all my strength and ended up on the roof of the house.   I sat down to calm my nerves and after a couple futile jumps, the wolf gave up and headed back into the forest.  The sound of my heart beating finally quieted down so I could hear myself think.  I sat perched on the roof for a long time trying to figure out what happened and how to get down.  I wondered if it was magic and did I have a fairy godmother or a guardian angel that had somehow put me on the roof.  I noticed the sun was starting it’s descent toward dusk and I knew that if I didn’t do something soon mother and father would be home and see me sitting on the roof.  How would I ever explain how I got up there?  They would never leave me alone again.  Just then Drib landed on the roof next to me.</p><p>“Well, if you jumped up here, just jump down,”  he said.</p><p>All could think was I’ve gone crazy.  I’m hearing voices.  Tears were streaming down my cheeks.</p><p>“You are not crazy, you are a gifted one, and I’m a watcher.  My job is to help you use your special talents.  Just trust yourself,” he pleaded.</p><p>“I’ll break something ,” I cried.</p><p>No you won’t.  Just trust me,” Drib pleaded.</p><p>“You flew up, so just sit on the edge of the roof and jump.  Focus on floating to the ground and see what happens,” Drib commanded.</p><p>Since I knew I was crazy I did as he said and to my astonishment I found myself standing on the ground.  I felt like an autumn leaf gliding, floating downward to the ground.  I said</p><p>“Thank you,” but I was so scared about everything that had happened that I ran inside the house and locked the doors.  I spent the next hour convincing myself I was ok and trying to get the panic off my face and get my body to relax so I would feel normal when my parents returned.  I never told anyone what happened, but as I got older and could wander off alone I would experiment and learned how to control my movements.  Drib was right.  I can fly.</p><p>Drib jumped up and sang excitedly:  “Blessed me, I wondered what happened to you.  How amazing that our lives have come full circle and our paths are again intertwined!”</p><p>“Yes,” grandmother said.  “It is strange, or maybe mystical, that we both had our mystery revealed to us at the feet of a dangerous wolf and you.”</p><p>“Oh, no mystery about the wolf,” Drib offered.  “He is a special one that only appears when it is time for one of the prophetic special ones to learn who they are.  Actually you were never in any danger, but you had to think you were or else you never would have followed my suggestions.  My being present to witness this miracle with both of you, however, is providence and a special unexpected blessing for me.”</p><p>Nancy grabbed Elsa’s hands and said “come, let me show you something.”  When they reached the clearing past her flower garden she said “sit on the bench and watch carefully.”</p><p>Elsa sat down and Drib perched on her shoulder.  Then Nana was in the air, flying in circles above them.  She eased herself down so she was standing facing them and grabbed Elsa’s hands.</p><p>“Now it’s your turn. I’m going to hold your hand and not let go, but you need to let your brain go and just pretend you are a butterfly or a bird,” Nana whispered softly,</p><p>When Nana took off, Elsa was hanging below her, but after a couple minutes, her body felt lighter and she found herself beside Nana, flying in circles with her.</p><p>“Ok,” Nana said, “Enough fun for today.  We are going to circle lower until we can stand up and then float to the ground.  Just relax and do what I do.  Keep your body even with mine.”</p><p>“Oh, Nana, that was amazing,” and with tears rolling down her cheeks, she cried, “I’m not crazy after all.”</p><p>Grandmother raised Elsa’s face up to hers and said, “Elsa, you and I, and Drib, if he decides to stick around, will have many long talks and fun adventures together.”</p><p>“I wouldn’t miss this for anything.  I’ve waited my whole life for this!” Drib exclaimed.</p><p>“Keep our secret close to your heart.  I’ll teach you everything I have learned about my gifts and Drib can explain your role in protecting the nature you so love.  But, right now,” grandmother said, “we are getting you home.”</p><p>They walked back through the forest in silence; grandmother holding Elsa’s hand, Drib sitting on Elsa’s shoulder; each consumed with their own dreams.  Elsa with visions of her and Nana flying off to explore other parts of the world she had never seen, and meeting all of the Watchers!  Nana, feeling ten years younger, sharing similar visions of teaching Elsa; rejoicing that she had been able to share her secret after so many years.  Drib finding it difficult to contain his excitement envisioning the shock on the faces of the other members of the Watcher Society when he announced tonight that he had found two special gifted ones right here in Egalliv!</p><p>Life would never be the same for any of them.</p>"}