{"title": "The Lazy Loppin Goat", "author": "Artie Knapp", "level": "6 to 8,9 to12,", "category": "Funny,Modern,Original,", "tag": "Goat,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/The-Lazy-Loppin-Goat-opt-200x300.jpg'></img><p>The grass was tall – very, very, tall – but it shouldn’t have been. Alfred Lambert had the worst luck with lawnmowers, you see, and no matter how many new lawnmowers Alfred bought none ever worked for him. Alfred’s luck was so bad that the store he bought lawnmowers from made sure to have a new one waiting for him every day; they just knew he would be coming back for another.</p><p>At first, Alfred’s neighbors were mad at the way his yard made the whole neighborhood look. Many folks in town were so fed up that they offered to cut Alfred’s grass for free, but Alfred refused any help. He was determined to cut his own lawn.</p><p>As Alfred’s grass grew to historic heights, the whole town of Belvar eventually embraced the jungle known as Alfred’s yard. The Mayor of Belvar even declared Alfred’s yard a town landmark. Next to the clouds in the sky, Alfred’s yard was the tallest thing in town. Alfred didn’t like all of the attention his yard was receiving though, and he felt embarrassed at how tall his grass had become.</p><p>One evening, after yet another failed attempt to buy a working lawnmower, Alfred was ready to give up on finding a way to mow his jungle-of-a-yard. Then out of nowhere a faint little bleat from a goat could be heard in the distance. Alfred’s face lit up like a Christmas tree upon hearing the goat’s bleat. Alfred felt he found the solution to cutting his lawn, because goats love to eat grass, and any goat would be thrilled to feast in Alfred’s yard.</p><p>After climbing up the grass in his yard and looking down at the telephone poles, Alfred worked his way out of his yard and darted to the nearest farm. The Cline family lived down the road from Alfred, and they had several kinds of animals on their farm. In addition to chickens, cattle and hogs, the Clines had one little caramel colored goat with dark stockings. She was a friendly little goat, but the Cline family seldom paid her much attention. The little goat felt lonely and spent most of her days walking aimlessly in the green pasture. When Alfred approached the Cline family about his idea, Mr. Cline and his entire family started to laugh hysterically. And it didn’t stop there! The chickens, cattle and hogs nearby all laughed, too.</p><p>“That’s one lazy loppin goat,” declared Mr. Cline. “You can have her for free.”</p><p>“May I ask why you feel the goat is lazy?” asked Alfred.</p><p>“It doesn’t want to work. It doesn’t want to do much of anything,” said Mr. Cline.</p><p>“Well, since you’re offering her for free, I don’t have anything to lose,” said Alfred.</p><p>“Very well,” said Mr. Cline. “She’s all yours.”</p><p>As Alfred walked across the Cline’s farm in search of the little goat, several of the farm animals were still laughing.</p><p>“Good luck with that goat. You’re going to need it,” said one of the chickens.</p><p>The chicken’s comment made all the other animals laugh even harder. Alfred ignored the animals’ laughter and spotted the little goat down on the meadow. As Alfred approached the little goat, she lifted her head out of the creek she was drinking from to see what he wanted.</p><p>“Excuse me, my name is Alfred, and I live down the road from here.”</p><p>“How do you do?” asked the little goat.</p><p>“I am fine, thanks. Do you have a name?” asked Alfred.</p><p>“Yes,” replied the little goat. “My name is Irene.”</p><p>“Well, very nice to meet you, Irene. I just spoke with Mr. Cline, and he said that I could be your new owner.”</p><p>“What do you mean?” asked the little goat. “What did he get in return?”</p><p>“Nothing, he gave you to me for free. Mr. Cline said you’re lazy and don’t like to work. Is that true?”</p><p>“No, sir, it’s not,” replied the little goat. “I love to work, but nobody on this farm understands that.”</p><p>“Well, I’ve got a situation I was hoping you could help me with. Come with me and we’ll discuss it along the way,” said Alfred.</p><p>The little goat’s feelings were hurt that the Cline family was so willing to give her away for free, but she thought moving might be the new start she was looking for. As Alfred and the little goat walked toward his home, Alfred’s yard became visible almost immediately.</p><p>“What in the world is that?” asked the little goat.</p><p>“That’s my yard,” replied Alfred.</p><p>“Wait a minute. I’ve heard of you. You’re that Lambert fellow with the yard that touches the sky.”</p><p>Alfred couldn’t believe that his yard had become gossip even among farm animals.</p><p>“Yes, that’s my yard,” replied Alfred. “The height of my grass is why you’re coming with me. I need my grass to be down to a respectable height.”</p><p>“First of all, you don’t need a goat for that, Alfred, you need about 25 combines,” said the little goat. “Secondly, I am allergic to grass.”</p><p>“You’re joking, right?” asked Alfred.</p><p>“No, I’m not,” replied the little goat.</p><p>Alfred became upset at the little goat, because he thought she was lying to him.</p><p>“How can a goat be allergic to grass? Don’t you live for that stuff?”</p><p>“Grass isn’t cotton candy, Alfred,” replied the little goat. “And since when do any of us decide what we’re allergic to?”</p><p>“I don’t buy this for one second,” said Alfred. “It’s like Mr. Cline said – you’re a lazy loppin goat.”</p><p>Fed up with Alfred not believing her, the little goat walked over to the side of Alfred’s yard and took a huge bite out of it. Almost immediately after taking the bite of grass, the little goat broke out in green and purple polka dots.  Alfred couldn’t believe his eyes. After just one bite of grass, Alfred had a rainbow-colored goat on his hands.</p><p>“I’m really sorry,” said Alfred. “I should have believed you. Can I get you anything?”</p><p>“Yes,” replied the little goat. “I need some fresh water and something to help settle my stomach.”</p><p>“I thought goats were supposed to be garbage disposals,” said Alfred.</p><p>“That’s what everyone at the Cline farm thought too,” said the little goat. “I’m not a lazy loppin goat, Alfred, I just happen to be a goat that’s allergic to grass.”</p><p>“Well, you’re more than welcome to stay here anyway. I’ll just find something else for you to do if you can’t eat grass,” said Alfred.</p><p>“I’ll tell you what, Alfred, I’ll help you mow this yard, and all I’ll need in return is just two things,” said the little goat.</p><p>“Just two things?” asked Alfred. “Name it. Anything you want.”</p><p>“As you now know, I can’t eat grass, but what I do love to eat is lima beans. I can’t get enough of them,” said the little goat. “That’s the first thing I’ll need.”</p><p>“Well, that’s easy enough,” said Alfred. “What’s the second thing you’ll need?”</p><p>“The second thing is really more for us than just me,” said the little goat.</p><p>“What is it?” asked Alfred.</p><p>The little goat tapped her hoof on Alfred’s lawnmower and said, “We’ll need gas for the lawnmower, Alfred. We’ll need gas for the lawnmower.”</p>"}