{"title": "The Wild Battle", "author": "Om Kokane, aged 10", "level": "3 to 5,6 to 8,", "category": "By Children,Modern,Original,", "tag": "Ant,Frog,Snake,", "length": "01 - 05 mins,", "body": "<p>One day, in the middle of a silent forest, there was an anthill where ants lived .Two ants were guarding the entrance when suddenly, one of them saw an arrow, with a note on it. When the arrow felt down the ants unrolled it and took it to the king of ants. It read:</p><p>The ant king thought They want to take us over! Suddenly an idea flashed in his mind, and he rushed in the announcement room and blurted out the whole plan to all of his soldiers.</p><p>“So are we ready to attack?” he asked and he heard nothing but a loud “yeeaahh!!”</p><p>The following day, there was a huge and fierce attack on the FROG TREE by the ants. Each and every soldier frog was captured including the frog king.</p><p>“So,” said the ant king, “we are battling with the snakes, and we’ve come to ask for help if you’re in, you saved your skin, if you’re not, you’ll DIE AND ROT!”.</p><p>“I’m …i….n,” stuttered the frog king.</p><p>The ant king said “good!” and whispered him his plan. Then the king praised the ant king, “Smart fellow” and tells the plan to all of his soldiers.</p><p>The next day the king of drones was taking a stroll in his park a big, fat and ugly (and I mean ugly!!) toad jumped out of a tree and landed on the drone king, he fainted at the spot. The toad took the drone king at the frog tree. In drone land the news of the king being kidnapped spread like wildfire.</p><p>Meanwhile, in the frog tree the king said “So, we are battling with the snakes, and we’ve come to ask for help if you’re in, you saved your skin, if you’re not, you’ll DIE AND ROT!”. The drone king readily agreed.</p><p>The next day (the day of the battle, of course) the ant king came with 100 soldiers and the snake king came with 100 soldiers as well.</p><p>“HA!HA!HA!HA!HA!HA!What a coward army! Buuaahahahahahaha!!!” said the snake king.</p><p>The ant king replied “who said there are only a hundred of us???”</p><p>Suddenly from the trees, frogs emerged, and then the drones.</p><p>The snake king said “hey! Bu…..”</p><p>“You forgot to mention ‘don’t bring your allies’,” interrupted the ant king.</p><p>The snake king hissed in fury and said” Ataaaaaacck!!!!!!!!!!!!!” The battle had begun!</p><p>It was a thrilling battle, they bit and scratched they killed and fought. In the last the snake king was left wriggling with pain because the ants were biting him.</p><p>The ant king climbed onto his head and said “This is for my kingdom” and he gave his most powerful bite.</p><p>And there, died the vile king of snakes, then there was silence……..then suddenly an ant screamed “We won!!!!!” then the pomp begun. Yes you read that right they had won!!!! and as the king of the snakes was dead and THEY LIVED HAPPILY EVER AFTER.</p>"}