{"title": "The Rabbit Chase", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Fantasy,Illustrated,Original,", "tag": "Dog,Rabbit,", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/illus-038.jpg'></img><h2><a id=\"THE_RABBIT_CHASE\" name=\"THE_RABBIT_CHASE\"></a>THE RABBIT CHASE</h2><p>“Well, what shall we play tonight?” asked Henny, the Dutch doll, when the house was quiet and the dolls all knew that no one else was awake.</p><img src='https://xcx.mdavid.cn/img/illus-037.jpg'></img><p>Raggedy Andy was just about to suggest a good game, when Fido, who sometimes slept in a basket in the nursery, growled.</p><p>All the dollies looked in his direction.</p><p>Fido was standing up with his ears sticking as straight in the air as loppy silken puppy dog ears can stick up.</p><p>“He must have been dreaming!” said Raggedy Andy.</p><p>“No, I wasn’t dreaming!” Fido answered. “I heard something go, ‘Scratch! Scratch!’ as plain as I hear you!”</p><p>“Where did the sound come from, Fido?” Raggedy Andy asked when he saw that Fido really was wide awake.</p><p>“From outside somewhere!” Fido answered. “And if I could get out without disturbing all the folks, I’d run out and see what it might be! Perhaps I had better bark!”</p><p>“Please do not bark!” Raggedy Andy cried as he put his rag arm around Fido’s nose. “You will awaken everybody in the house. We can open a door or a window for you and let you out, if you must go!”</p><p>“I wish you would. Listen! There it is again: ‘Scratch! Scratch!’ What can it be?”</p><p>“You may soon see!” said Raggedy Andy. “We’ll let you out, but please don’t sit at the door and bark and bark to get back in again, as you usually do, for we are going to play a good game and we may not hear you!”</p><p>“You can sleep out in the shed after you have found out what it is,” said Raggedy Andy.</p><p>As soon as the dolls opened the door for Fido, he went running across the lawn, barking in a loud shrill voice. He ran down behind the shed and through the garden, and then back towards the house again.</p><img src='https://xcx.mdavid.cn/img/illus-040.jpg'></img><p>Raggedy Andy and Uncle Clem stood looking out of the door, the rest of the dolls peeping over their shoulders, so when something came jumping through the door, it hit Uncle Clem and Raggedy Andy and sent them flying against the other dolls behind them.</p><p>All the dolls went down in a wiggling heap on the floor.</p><p>It was surprising that the noise and confusion did not waken Daddy and the rest of the folks, for just as the dolls were untangling themselves from each other and getting upon their feet, Fido came jumping through the door and sent the dolls tumbling again.</p><p>Fido quit barking when he came through the door.</p><p>“Which way did he go?” he asked, when he could get his breath.</p><p>“What was it?” Raggedy Andy asked in return.</p><p>“It was a rabbit!” Fido cried. “He ran right in here, for I could smell his tracks!”</p><p>“We could feel him!” Raggedy Andy laughed.</p><p>“I could not tell you which way he went!” Uncle Clem said, “Except I feel sure he came through the door and into the house!”</p><p>None of the dolls knew into which room the rabbit had run.</p><p>Finally, after much sniffing, Fido traced the rabbit to the nursery, where, when the dolls followed, they saw the rabbit crouching behind the rocking horse.</p><p>Fido whined and cried because he could not get to the rabbit and bite him.</p><p>“You should be ashamed of yourself, Fido!” cried Raggedy Ann. “Just see how the poor bunny is trembling!”</p><p>“He should not come scratching around our house if he doesn’t care to be chased!” said Fido.</p><img src='https://xcx.mdavid.cn/img/illus-041.jpg'></img><p>“Why don’t you stay out in the woods and fields where you really belong?” Raggedy Andy asked the rabbit.</p><p>“I came to leave some Easter eggs!” the bunny answered in a queer little quavery voice.</p><p>“An Easter bunny!” all the dolls cried, jumping about and clapping their hands. “An Easter bunny!”</p><p>“Well!” was all Fido could say, as he sat down and began wagging his tail.</p><p>“You may come out from behind the rocking horse now, Easter bunny!” said Raggedy Andy. “Fido will not hurt you, now that he knows, will you, Fido?”</p><p>“Indeed I won’t!” Fido replied. “I’m sorry that I chased you! And I remember now, I had to jump over a basket out by the shed! Was that yours?”</p><p>“Yes, it was full of Easter eggs and colored grasses for the little girl who lives here!” the bunny said.</p><p>When the Easter bunny found out that Fido and the dolls were his friends, he came out from behind the rocking horse and hopped across the floor to the door.</p><p>“I must go see if any of the eggs are broken, for if they are, I will have to run home and color some more! I was just about to make a nice nest and put the eggs in it when Fido came bouncing out at me!”</p><p>And with a squeeky little laugh the Easter bunny, followed by Fido and all the dolls, hopped across the lawn towards the shed. There they found the basket. Four of the lovely colored Easter eggs were broken.</p><p>“I will run home and color four more. It will only take a few minutes, so when I return and scratch again to make a nest, please do not bark at me!” said the Easter bunny.</p><img src='https://xcx.mdavid.cn/img/illus-042.jpg'></img><p> </p><p>“I won’t! I promise!” Fido laughed.</p><p>“May we go with you and watch you color the Easter eggs?” Raggedy Andy begged.</p><p>“Indeed you may!” the Easter bunny answered. “Can you run fast?”</p><p>Then down through the garden and out through a crack in the fence the Easter bunny hopped, with a long string of dolls trailing behind.</p><p>When they came to the Easter bunny’s home, they found Mama Easter bunny and a lot of little teeny weeny bunnies who would some day grow up to be big Easter bunnies like their Mama and Daddy bunny.</p><p>The Easter bunny told them of his adventure with Fido, and all joined in his laughter when they found it had turned out well at the end.</p><p>The Easter bunny put four eggs on to boil and while these were boiling he mixed up a lot of pretty colors.</p><p>When the eggs were boiled, he dipped the four eggs into the pretty colored dye and then painted lovely flowers on them.</p><p>When the Easter bunny had finished painting the eggs he put them in his basket and, with all the dolls running along beside him, they returned to the house.</p><p>“Why not make the nest right in the nursery?” Raggedy Andy asked.</p><img src='https://xcx.mdavid.cn/img/illus-044.jpg'></img><p>“That would be just the thing! Then the little girl would wonder and wonder how I could ever get into the nursery without awakening the rest of the folks, for she will never suspect that you dolls and Fido let me in!”</p><p>So with Raggedy Andy leading the way, they ran up to the nursery and there, ‘way back in a corner, they watched the Easter bunny make a lovely nest and put the Easter eggs in it.</p><p>And in the morning when Marcella came in to see the dolls you can imagine her surprise when she found the pretty gift of the Easter bunny.</p><p>“How in the world did the bunny get inside the house and into this room without awakening Fido?” she laughed.</p><p>And Fido, pretending to be asleep, slowly opened one eye and winked over the edge of his basket at Raggedy Andy.</p><p>And Raggedy Andy smiled back at Fido, but never said a word.</p>"}