{"title": "The Robin’s Nest", "author": "Sharon Krager", "level": "3 to 5,6 to 8,9 to12,", "category": "Modern,Original,", "tag": "Bird,Robin,", "length": "01 - 05 mins,", "body": "<p>Just the other day, I found a bird’s nest in the big oak tree behind our house. Dad says it is a robin’s nest. I climbed halfway up the tree just to get a good look inside the nest. There were three blue eggs all close together lying in it. When Dad saw me up in the tree, he told me to come back down. I got down from the tree.</p><p>Along with Mom and Dad, I helped do some work that we needed to do in the yard. Dad was getting a flower bed ready for Mom to plant flowers in. I was picking up trash next to the fence, and Mom was raking old leaves up that had been in the yard since last autumn. We worked for quite a while and then decided to sit at the picnic table with a cool glass of water. As we sat there, I watched the tree with the robin’s nest in it to see if I could see mama bird fly back to the nest.</p><p>We finished up our work outside and went in to fix some supper. We all got cleaned up, ate supper, watched some TV and went on to bed.</p><p>Morning came quickly with the sun beaming in through the windows. While we ate breakfast we talked about what we needed to do for the day. Since it was the week-end, we wanted to do some more work in the yard to finish the jobs we had started the day before.</p><p>We met outside in the front yard this time to do some touch up work to the front of the house. Dad got out a big bucket of white paint to take care of some chips along the lower edge of the house next to the basement windows. It was another nice sunny day and it looked like it was going to stay that way. As Dad did the paint work, Mom and I picked up rocks out of the grass near the driveway. We moved toys and bikes to the basement , swept sidewalks and picked up fallen pieces of tree limbs from the yard.</p><p>Every once in a while I took a break to go back and take a peek at the robin’s nest.</p><p>A couple of weeks went by and I did keep an eye on that nest. I would climb up to see the nest to make sure the eggs were still there. Mama bird stayed around and made sure nothing or no one bothered her beautiful blue eggs.</p><p>Then one day after school, I snuck up the tree close to the nest. As I got closer, I heard little chirps coming from the nest. There they were. Three tiny heads bobbed up and down. The eggs had hatched. Mom and Dad happened to walk outside about the time I was coming back down.</p><p>“Stay away from the nest,” Dad said. “Mama Robin does not want her little birds to be bothered.”</p><p>“Yea,” Mom said. “You don’t want to disturb the little birds, do you? They have probably hatched by now.”</p><p>“No, I don’t want to bother them.  I just want to make sure they are ok,” I told them. “I did climb up to see if they hatched, and they did.”</p><p>“Great,” Dad said. “We need to leave them alone so that mama robin can take care of them.”</p><p>I did just that. I did not climb back up the tree to look in the nest. I just watched as she brought food to her babies and took care of them.</p><p>Eventually, the Mama Robin began to teach her little ones how to fly. I watched from a distance so she would not see me. One at a time she helped them until they flew off on their own. She was a very good teacher. It took several days and many tries for the little birds to catch on to flying.</p><p>The Robins come and go each year. I will always remember the nest in the big oak tree in our back yard. Maybe one of those Robins that were in the nest will find its way back to our place. I will be looking for them every spring time.</p>"}