{"title": "The Three Little Gnomes", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "Deer,Fox,Owl,", "length": "05 - 10 mins,", "body": "<p>A silvery thread of smoke curled up over the trunk of the old tree and floated away through the forest, and tiny voices came from beneath the trunk of the old tree.</p><img src='https://xcx.mdavid.cn/img/005.jpg'></img><p>Long, long ago, the tree had stood strong and upright and its top branches reached far above any of the other trees in the forest, but the tree had grown so old it began to shiver when the storms howled through the branches. And as each storm came the old tree shook more and more, until finally in one of the fiercest storms it tumbled to the earth with a great crash.</p><p>There it lay for centuries, and vines and bushes grew about in a tangled mass until it was almost hidden from view.</p><p>Now down beneath the trunk of the fallen tree lived three little gnomes, and it was the smoke from their fire which curled up over the trunk of the old tree and floated away through the forest.</p><p>They were preparing dinner and laughing and talking together when they heard the sound of a horn.</p><p>“What can it be?” one asked.</p><p>“It sounds like the horn of a huntsman!” another cried.</p><p>As the sound came nearer, the three little gnomes stamped upon their fire and put it out so that no one would discover their home. Then they climbed upon the trunk of the tree and ran along it to where they could see across an open space in the forest without being seen themselves. And when the sound of the horn drew very close, they saw a little boy climb through the thick bushes.</p><p>As the little boy came out into the open space the three little gnomes saw that he was crying.</p><p>“He must be lost!” said the first little gnome.</p><p>“He looks very tired and hungry!” said the second little gnome.</p><p>“Let us go and ask him!” said the third little gnome.</p><p>So the three little gnomes scrambled down from the trunk of the fallen tree and went up to where the little boy had thrown himself upon the ground. They stood about him and watched him, for he had put his face in the crook of his arm and was crying.</p><img src='https://xcx.mdavid.cn/img/008.jpg'></img><p>Finally one of the little gnomes sat down in front of the little boy and spoke to him.</p><p>“I am lost!” the little boy said. “My father went hunting yesterday with all his men and when they were out of sight I took my little horn and followed them, but I soon lost their track, and I have wandered about with nothing to eat. Last night I climbed into a tree and slept!”</p><p>The three little gnomes wiped the little boy’s eyes and led him to their home under the fallen tree. There they finished preparing the dinner and sat about until the little boy had eaten and had fallen asleep.</p><p>Then the three little gnomes carried him into their house, away back in the trunk of the tree, and placed him upon one of their little beds.</p>"}