{"title": "Thumbelina", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,Illustrated,", "tag": "Beetle,Bird,Mole,Mouse,Swallow,Toad,", "length": "15 - 20 mins,", "body": "<img src='https://xcx.mdavid.cn/img/p077i1.png'></img><p>There was once a woman who wished very much to have a little child. She went to a fairy and said: “I should so very much like to have a little child. Can you tell me where I can find one?”</p><p>“Oh, that’s no problem,” said the fairy. “Here is a seed. It is not like most seeds – plant it into a flowerpot and see what will happen.”</p><p>“Thank you,” said the woman and she paid the fairy. Then she went home and planted it, and in no time up grew a lovely large flower, like a tulip but with its leaves tightly closed, as if it were still a bud.</p><p>“It is a beautiful flower,” said the woman, and she kissed the red and golden-colored petals. As she did so the flower opened and she could see that it was a real tulip. But within the flower, sat a very delicate and graceful little maiden. She was hardly half as long as a thumb so they gave her the name of Little Thumb, or Thumbelina, because she was so small.</p><p>A polished walnut shell was used for her cot, her bed was made of the leaves of violets and her bedcover was a rose-leaf. Here she slept at night, but during the day she played on a table, where the peasant wife had placed a plate full of water.</p><p>A large tulip leaf floated on this plate, which she used as a boat. Here she sat and rowed herself from side to side. It was a very pretty sight. Thumbelina could also sing so softly and sweetly that nothing like her singing had ever been heard before. Thumbelina was very happy in her home.</p><p>One night, while she lay in her pretty bed, a large, ugly, wet toad crept through a broken pane of glass in the window and leaped right upon the table where she lay sleeping under her rose-leaf.</p><p>“What a pretty little wife this would make for my son,” said the toad, and she took up the walnut shell in which Thumbelina lay asleep, and jumped through the window with it, into the garden.</p><p>At the swampy edge of a wide stream in the garden the toad lived with her son. He was even uglier than his mother and when he saw the pretty little maiden in her lovely bed, he could only cry “Croak, croak, croak.”</p><p>“Don’t speak so loud, or she will wake,” said the toad, “and then she might run away. We will place her on one of the water-lily leaves out in the stream. It will be like an island to her, she is so light and small, and then she cannot escape. While she is there we will hurry and prepare the place under the mud where you are to live when you are married.”</p><p>Far out in the stream grew a number of water lilies with wide green leaves which seemed to float on the top of the water. The largest of these leaves seemed farther off than the rest, and the old toad swam out to it with the walnut shell, in which Thumbelina still lay asleep.</p><p>When she woke very early in the morning she began to cry bitterly when she found where she was, for she could see nothing but water on every side of the large green leaf, and no way of reaching the land.</p><p>Meanwhile the old toad was very busy under the mud, decorating the room with rushes and wild yellow flowers, to make it look pretty for her new daughter-in-law. Then she swam out with her ugly son to the leaf on which she had placed poor Thumbelina. She wanted to get the pretty bed, to bring back for the underground room. The old toad bowed low to her in the water and said, “Here is my son. He will be your husband and you will live happily together in the marsh by the stream.”</p><p>“Croak, croak, croak,” was all her son could say for himself. So the toad took up the elegant little bed and swam away with it, leaving Thumbelina all alone on the green leaf, where she sat and cried. She could not bear to think of living with the old toad and having her ugly son for a husband. The little fishes who swam about in the water beneath had seen the toad and heard what she said, so now they lifted their heads above the water to look at the little maiden.</p><p>As soon as they caught sight of her they saw she was very pretty, and it made them angry to think that she must go and live with the ugly toads even though she didn’t want to.</p><p>“No, it must never be!” So they gathered together in the water, round the green stalk which held the leaf on which the little maiden stood, and chewed it away with their teeth. Then the leaf floated down the stream, carrying Thumbelina far away out of reach of land.</p><p>Thumbelina sailed past many towns, and the little birds in the bushes saw her and sang, “What a lovely little creature.” So the leaf swam away with her farther and farther, till it brought her to other lands. A graceful little white butterfly constantly fluttered round her and at last landed on the leaf. He liked the little girl and she was glad, for now the toad could not possibly reach her, and the country through which she sailed was beautiful, and the sun reflected gold upon the water. She took off the long ribbon from her dress and tied one end of it round the butterfly, fastening the other end to the leaf, which now glided on much faster than before, taking Thumbelina with it as she stood.</p><img src='https://xcx.mdavid.cn/img/p083i.png'></img><p>Presently a large beetle flew by. The moment he caught sight of her he seized her round her delicate waist with his claws and flew with her into a tree. The green leaf floated away on the stream, and the butterfly flew with it, for he was fastened to it and could not get away.</p><p>Oh, how frightened Thumbelina felt when the beetle flew with her to the tree! But especially was she sorry for the beautiful white butterfly which she had tied to the leaf. But the beetle did not trouble himself at all about the matter. He seated himself by her side, on a large green leaf, gave her some honey from the flowers to eat, and told her she was very pretty, though not in the least like a beetle.</p><p> </p><p>After a time all the beetles who lived in the tree came to pay Thumbelina a visit. They stared at her, and then the young lady beetles turned up their feelers and said, “She has only two legs! how ugly that looks.” “She has no feelers,” said another. “Her waist is quite slim. Pooh! she is like a human being.”</p><p>“Oh, she is ugly,” said all the lady beetles. The beetles who had run away with her believed all the others when they said she was ugly. He would have nothing more to say to her, and told her she might go where she liked. Then he flew down with her from the tree and placed her on a daisy, and she wept at the thought that she was so ugly that even the beetles would have nothing to say to her. And all the while she was really the loveliest creature you could imagine, and as tender and delicate as a beautiful rose leaf.</p><p>During the whole summer poor little Thumbelina lived quite alone in the wide forest. She made herself a bed with blades of grass and hung it up under a wide leaf, to protect herself from the rain. She sucked the honey from the flowers for food and drank the dew from their leaves every morning.</p><p>The summer and the autumn passed away and then came the winter—the long, cold winter. All the birds who had sung to her so sweetly had flown away and the trees and the flowers had withered. The large plant under the shelter of which she had lived was now shriveled up and nothing remained but a yellow, withered stalk. She felt dreadfully cold, for her clothes were torn, and she was herself so frail and delicate that she was nearly frozen to death. It began to snow, too; and the snowflakes, as they fell upon her, were like a whole shovelful falling upon one of us, for we are tall, but she was only an inch high. She wrapped herself in a dry leaf, but it cracked in the middle and could not keep her warm, and she shivered with cold.</p><p>Near the wood in which she had been living was a large cornfield, but the corn had been cut a long time; nothing remained but the bare, dry stubble, standing up out of the frozen ground. To someone of her size, though, it was to her like struggling through a large wood.</p><p>Oh! how she shivered with the cold. She came at last to the door of a field mouse, who had a little den under the corn stubble. There lived the field mouse in warmth and comfort, with a whole roomful of corn, a kitchen, and a beautiful dining room. Poor Thumbelina stood before the door, just like a little beggar girl, and asked for a small piece of corn, for she had been without anything to eat for two days.</p><p>“You poor little creature,” said the field mouse, for she was really a good old mouse, “come into my warm room and have dinner with me.”</p><p>She liked Thumbelina, so she said, “You are quite welcome to stay with me all the winter, if you like; but you must keep my rooms clean and neat, and tell me stories, for I shall like to hear them very much.” And Thumbelina did all that the field mouse asked her, and found herself very comfortable.</p><p>“We shall have a visitor soon,” said the field mouse one day. “My neighbour pays me a visit once a week. He is richer than I am, he has a big place to live and wears a beautiful black velvet coat. If you could only have him for a husband, you would be well provided for indeed. But he is blind, so you must tell him some of your prettiest stories.”</p><p>Thumbelina did not feel at all interested about this neighbour, for he was a mole. However, he came and paid his visit, dressed in his black velvet coat.</p><p>“He is very rich and clever and his house is twenty times larger than mine,” said the field mouse.</p><p>He was rich and clever, no doubt, but he always said bad things about the sun and the pretty flowers, because he had never seen them. Thumbelina had to sing to him, “Ladybird, ladybird, fly away home,” and many other pretty songs. And the mole fell in love with her because she had so sweet a voice, but he said nothing yet, because he was a careful, slow-moving creature. A short time before, the mole had dug a long tunnel under the earth, which led from where the field mouse lived to his own place, and here she was allowed to walk with Thumbelina whenever she liked. But he warned them not to be worried at the sight of a dead bird which lay in the tunnel. It was a perfect bird, with a beak and feathers, and could not have been dead long. It was lying just where the mole had made his tunnel. Then he went before them to bring them through the long, dark passage. When they came to the spot where the dead bird lay, the mole pushed his broad nose through the ceiling, so that the earth gave way and the daylight shone into the passage.</p><p>In the middle of the floor lay a swallow, his beautiful wings pulled close to his sides, his feet and head drawn up under his feathers – it seemed that the poor bird had died of the cold. It made little Thumbelina very sad to see it, she did so love the little birds. All the summer they had sung and twittered for her so beautifully. But the mole pushed it aside with his crooked legs and said: “He will sing no more now. How miserable it must be to be born a little bird! I am thankful that none of my children will ever be birds, for they can do nothing but cry ‘Tweet, tweet.'”</p><p>“Yes, you may well say that, as a clever man!” exclaimed the field mouse. “What is the use of his twittering if, when winter comes, he must either starve or be frozen?”</p><p>Thumbelina said nothing, but when the two others had turned their backs upon the bird, she stooped down and stroked aside the soft feathers which covered his head, and kissed the closed eyelids. “Perhaps this was the one who sang to me so sweetly in the summer,” she said, “and how much pleasure it gave me, you dear, pretty bird.”</p><p>The mole now closed up the hole through which the daylight shone, and then brought the ladies home. But during the night Thumbelina could not sleep, so she got out of bed and made a large, beautiful rug of hay. She carried it to the dead bird and spread it over him, with some down from the flowers which she had found in the field mouse’s room. It was as soft as wool, and she spread some of it on each side of the bird, so that he might lie warmly in the cold gound.</p><p>“Goodbye, pretty little bird,” she said, “goodbye. Thank you for your delightful singing during the summer, when all the trees were green and the warm sun shone upon us.” Then she laid her head on the bird’s breast, but she was alarmed, for it seemed as if something inside the bird went “thump, thump.” It was the bird’s heart, he was not really dead, only numb with cold, and the warmth had restored him to life. In autumn all the swallows fly away into warm countries, but if a bird stays on too long, the cold suddenly arrives and it becomes chilled and falls down as if dead. It remains where it fell, and the cold snow covers it.</p><p>Thumbelina trembled very much. She was quite frightened, as the bird was a large one, a great deal larger than herself. But she was brave, laid the wool more thickly over the poor swallow, and then took a leaf which she had used for her own bedcover and laid it over his head.</p><p>The next night she again sneaked out to see him. He was alive, but very weak. He could only open his eyes for a moment to look at Thumbelina, who stood by. “Thank you, pretty little maiden,” said the sick swallow; “I have been so nicely warmed that I shall soon get back my strength and be able to fly about again in the warm sunshine.”</p><p>“Oh,” said she, “it is cold outside now, it snows and freezes. Stay in your warm bed, I will take care of you.”</p><p>She brought the swallow some water in a flower leaf, and after he had drunk, he told her that he had hurt one of his wings in a thorny bush and could not fly as fast as the others, who were soon far away on their journey to warm countries. At last he had fallen to the earth, and could remember nothing else.</p><p>All winter the swallow remained underground and Thumbelina nursed him with care and love. She did not tell either the mole or the field mouse anything about it, for they did not like swallows. Very soon the springtime came, and the sun warmed the earth. Then the swallow said farewell to Thumbelina, and she opened the hole in the ceiling which the mole had made. The sun shone in upon them so beautifully that the swallow asked her if she would like to go with him. She could sit on his back, he said, and he would fly away with her into the green woods. But she knew it would be sad for the field mouse if she left her like that, so she said, “No, I cannot.”</p><p>“Goodbye, then, goodbye, you good, pretty little maiden,” said the swallow, and he flew out into the sunshine.</p><p>Thumbelina looked after him, and the tears came to her eyes. She was very fond of the poor swallow.</p><p>“Tweet, tweet,” sang the bird, as he flew out into the green woods, and Thumbelina felt very sad. She was not allowed to go out into the warm sunshine. The corn which had been sowed in the field over the house of the field mouse had grown up high into the air and formed a thick wood to Thumbelina.</p><p>“You are going to be married, little one,” said the field mouse. “My neighbor has asked for you. What good luck for a poor child like you! Now we will make your wedding clothes. Nothing must be wanting when you are the wife of the mole.”</p><img src='https://xcx.mdavid.cn/img/p093i.png'></img><p>Thumbelina had to turn the spindle, and the field mouse hired four spiders, who were to weave day and night. Every evening the mole visited her and kept talking about when the summer would be over. Then he would have his wedding day with Thumbelina but now the heat of the sun was so great that it burned the earth and made it hard, like stone. As soon as the summer was over the wedding would take place. But Thumbelina was not at all pleased, for she did not like the mole.</p><p>Every morning when the sun rose and every evening when it went down she would creep out at the door, and as the wind blew aside the ears of corn so that she could see the blue sky, she thought how beautiful and bright it seemed out there and wished so much to see her dear friend, the swallow, again. But he never returned, for by this time he had flown far away into the lovely green forest.</p><p>When autumn arrived Thumbelina had her outfit quite ready, and the field mouse said to her, “In four weeks the wedding must take place.”</p><p>Then she wept and said she would not marry the dull, dreary mole.</p><p>“Nonsense,” replied the field mouse. “Now don’t be stubborn, or I will bite you with my white teeth. He is a very handsome mole, the queen herself does not wear more beautiful velvets and furs. His kitchens and cellars are quite full. You ought to be very thankful for such good fortune.”</p><p>So the wedding day was fixed, on which the mole was to take her away to live with him, deep under the earth, and never again to see the warm sun, because he did not like it. The poor child was very unhappy at the thought of saying farewell to the beautiful sun, and as the field mouse had given her permission to stand at the door, she went to look at it once more.</p><p>“Goodbye, bright sun,” she cried, stretching out her arm towards it. She walked a short distance from the house, for the corn had been cut, and only the dry stubble remained in the fields. “Goodbye, goodbye,” she repeated, wrapping her arm around a little red flower that grew just by her side. “Greet the little swallow from me, if you should see him again.”</p><p>“Tweet, tweet,” sounded over her head suddenly. She looked up, and there was the swallow himself flying close by. As soon as he saw Thumbelina he was delighted. She told him how she didn’t want to marry the ugly mole, and to always live beneath the earth, never again to see the bright sun. And as she told him, she cried.</p><p>“Cold winter is coming,” said the swallow, “and I am going to fly away into warmer countries. Will you go with me? You can sit on my back and fasten yourself on. Then we can fly away from the ugly mole and his dark rooms—far away, over the mountains, into warmer countries, where the sun shines more brightly than here. Where it is always summer and the flowers bloom with such beauty. Fly now with me, dear little one. You saved my life when I lay frozen in that dark, gloomy passage.”</p><p>“Yes, I will go with you,” said Thumbelina and she seated herself on the bird’s back, with her feet on his outstretched wings, and tied herself to one of his strongest feathers.</p><p>The swallow rose in the air and flew over forest and over sea—high above the highest mountains, covered with snow. Thumbelina would have been frozen in the cold air, but she crept under the bird’s warm feathers, keeping her little head uncovered, so that she might admire the beautiful lands over which they passed. Finally they reached the warm countries, where the sun shines brightly and the sky seems so much higher above the earth. Here on the hedges and by the roadsides grew purple, green, and white grapes, lemons and oranges hung from trees in the fields, and the air was fragrant with orange blossoms. Beautiful children ran along the country lanes, playing with large butterflies and as the swallow flew farther and farther, every place appeared still more lovely.</p><p>At last they came to a blue lake, and by the side of it, shaded by trees of the deepest green, stood a palace of dazzling white marble, built in the olden times. Ivy wrapped around its tall pillars, and at the top were many swallows’ nests, and one of these was the home of the swallow who carried Thumbelina.</p><p>“This is my house,” said the swallow; “but it would not do for you to live there—you would not be comfortable. You must choose for yourself one of those lovely flowers, and I will put you down upon it, and then you shall have everything that you can wish to make you happy.”</p><p>“That will be delightful,” she said, and clapped her little hands for joy.</p><p>A large marble pillar lay on the ground, which, in falling, had been broken into three pieces. Between these pieces grew the most beautiful large white flowers, so the swallow flew down with Thumbelina and placed her on one of the wide leaves. But how surprised she was to see in the middle of the flower a tiny little man, as white and see-through as if he had been made of glass! He had a gold crown on his head, and lovely wings at his shoulders, and was not much bigger than was she herself. He was the angel of the flower, for a tiny man and a tiny woman dwell in every flower, and this was the king of them all.</p><p>“Oh, how beautiful he is!” whispered Thumbelina to the swallow.</p><p>The little prince was at first quite frightened at the bird, who was like a giant compared to such a tiny little creature as himself, but when he saw Thumbelina he was delighted and thought her the prettiest little maiden he had ever seen. He took the gold crown from his head and placed it on hers, and asked her name and if she would be his wife and queen over all the flowers.</p><p>This certainly was a very different sort of husband from the son of the toad, or the mole with his black velvet and fur, so she said yes to the handsome prince. Then all the flowers opened, and out of each came a little lady or a tiny lord, all so pretty it was quite lovely to look at them. Each of them brought Thumbelina a present, but the best gift was a pair of beautiful wings, which had belonged to a large white fly, and they fastened them to Thumbelina’s shoulders, so that she might fly from flower to flower.</p><p>Then there was much celebrating, and the little swallow, who sat above them in his nest, was asked to sing a wedding song, which he did as well as he could, but in his heart he felt sad, for he was very fond of Thumbelina and would have liked never to leave her.</p><p>“You must not be called Thumbelina any more,” said the spirit of the flowers to her. “You are so very lovely, we will call you Maia.”</p><p>“Goodbye, goodbye,” said the swallow, with a heavy heart, as he left the warm countries, to fly back into Denmark. There he had a nest over the window of a house where the writer of fairy tales lived. The swallow sang “Tweet, tweet,” and from his song came this whole story.</p>"}