{"title": "Tiktok and the Nome King", "author": "L. Frank Baum", "level": "6 to 8,9 to12,", "category": "Classic,Fairy Tale,Fantasy,Illustrated,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/image19.jpg'></img><img src='https://xcx.mdavid.cn/img/dropt.jpg'></img><p>he Nome King was unpleasantly angry. He had carelessly bitten his tongue at breakfast and it still hurt; so he roared and raved and stamped around in his underground palace in a way that rendered him very disagreeable.</p><p>It so happened that on this unfortunate day Tiktok, the Clockwork Man,visited the Nome King to ask a favor. Tiktok lived in the Land of Oz, and although he was an active and important person, he was made entirely of metal. Machinery within him, something like the works of a clock, made him move; other machinery made him talk; still other machinery made him think.</p><img src='https://xcx.mdavid.cn/img/image20.jpg'></img><p>Although so cleverly constructed, the Clockwork Man was far from perfect. Three separate keys wound up his motion machinery, his speech works, and his thoughts. One or more of these contrivances was likely to run down at a critical moment, leaving poor Tiktok helpless. Also some of his parts were wearing out, through much use, and just now his thought machinery needed repair. The skillful little Wizard of Oz had tinkered with Tiktok’s thoughts without being able to get them properly regulated, so he had advised the Clockwork Man to go to the Nome King and secure a new set of springs, which would render his thoughts more elastic and responsive.</p><p>“Be careful what you say to the Nome King,” warned the Wizard. “He has a bad temper and the least little thing makes him angry.”</p><p>Tiktok promised, and the Wizard wound his machinery and set him walking in the direction of the Nome King’s dominions, just across the desert from the Land of Oz. He ran down just as he reached the entrance to the underground palace, and there Kaliko, the Nome King’s Chief Steward, found him and wound him up again.</p><p>“I want to see the King,” said Tiktok, in his jerky voice.</p><p>“Well,” remarked Kaliko, “it may be safe for a cast-iron person like you to face his Majesty this morning; but you must announce yourself, for should I show my face inside the jewel-studded cavern where the King is now raving, I’d soon look like a dish of mashed potatoes, and be of no further use to anyone.”</p><p>“I’m not a-fraid,” said Tiktok.</p><p>“Then walk in and make yourself at home,” answered Kaliko, and threw open the door of the King’s cavern.</p><img src='https://xcx.mdavid.cn/img/image21.jpg'></img><p>Tiktok promptly walked in and faced the astonished Nome King, to whom he said: “Good morn-ing. I want two new steel springs for my thought-works and a new cog-wheel for my speech-pro-du-cer. How a-bout it, your Maj-es-ty?”</p><p>The Nome King growled a menacing growl and his eyes were red with rage.</p><p>“How dare you enter my presence?” he shouted.</p><p>“I dare an-y-thing,” said Tiktok. “I’m not a-fraid of a fat Nome.”</p><img src='https://xcx.mdavid.cn/img/image22.jpg'></img><p>This was true, yet an unwise speech. Had Tiktok’s thoughts been in good working order he would have said something else. The angry Nome King quickly caught up his heavy mace and hurled it straight at Tiktok. When it struck the metal man’s breast, the force of the blow burst the bolts which held the plates of his body together and they clattered to the floor in a score of pieces. Hundreds and hundreds of wheels, pins, cogs and springs filled the air like a cloud and then rattled like hail upon the floor.</p><p>Where Tiktok had stood was now only a scrap-heap and the Nome King was so amazed by the terrible effect of his blow that he stared in wonder.</p><p>His Majesty’s anger quickly cooled. He remembered that the Clockwork Man was a favorite subject of the powerful Princess, Ozma of Oz, who would be sure to resent Tiktok’s ruin.</p><p>“Too bad! too bad!” he muttered, regretfully. “I’m really sorry I made junk of the fellow. I didn’t know he’d break.”</p><p>“You’d better be,” remarked Kaliko, who now ventured to enter the room. “You’ll have a war on your hands when Ozma hears of this, and the chances are you will lose your throne and your kingdom.”</p><p>The Nome King turned pale, for he loved to rule the Nomes and did not know of any other way to earn a living in case Ozma fought and conquered him.</p><p>“Do—do you think Ozma will be angry?” he asked anxiously.</p><p>“I’m sure of it,” said Kaliko. “And she has the right to be. You’ve made scrap-iron of her favorite.”</p><p>The King groaned.</p><p>“Sweep him up and throw the rubbish into the black pit,” he commanded; and then he shut himself up in his private den and for days would see no one, because he was so ashamed of his unreasoning anger and so feared the results of his rash act.</p><p>Kaliko swept up the pieces, but he did not throw them into the black pit. Being a clever and skillful mechanic he determined to fit the pieces together again.</p><p>No man ever faced a greater puzzle; but it was interesting work and Kaliko succeeded. When he found a spring or wheel worn or imperfect, he made a new one.</p><img src='https://xcx.mdavid.cn/img/image23.jpg'></img><p>Within two weeks, by working steadily night and day, the Chief Steward completed his task and put the three sets of clockworks and the last rivet into Tiktok’s body. He then wound up the motion machinery, and the Clockwork Man walked up and down the room as naturally as ever. Then Kaliko wound up the thought works and the speech regulator and said to Tiktok:</p><p>“How do you feel now?”</p><p>“Fine,” said the Clockwork Man. “You have done a ve-ry good job, Kal-i-ko, and saved me from de-struc-tion. Much o-bliged.”</p><p>“Don’t mention it,” replied the Chief Steward. “I quite enjoyed the work.”</p><p>Just then the Nome King’s gong sounded, and Kaliko rushed away through the jewel-studded cavern and into the den where the King had hidden, leaving the doors ajar.</p><p>“Kaliko,” said the King, in a meek voice, “I’ve been shut up here long enough to repent bitterly the destruction of Tiktok. Of course Ozma will have revenge, and send an army to fight us, but we must take our medicine. One thing comforts me: Tiktok wasn’t really a live person; he was only a machine man, and so it wasn’t very wicked to stop his clockworks. I couldn’t sleep nights, at first, for worry; but there’s no more harm in smashing a machine man than in breaking a wax doll. Don’t you think so?”</p><p>“I am too humble to think in the presence of your Majesty,” said Kaliko.</p><p>“Then get me something to eat,” commanded the King, “for I’m nearly starved. Two roasted goats, a barrel of cakes and nine mince pies will do me until dinnertime.”</p><p>Kaliko bowed and hurried away to the royal kitchen, forgetting Tiktok, who was wandering around in the outer cavern. Suddenly the Nome King looked up and saw the Clockwork Man standing before him, and at the sight the monarch’s eyes grew big and round and he fell a-trembling in every limb.</p><p>“Away, grim Shadow!” he cried. “You’re not here, you know; you’re only a hash of cogwheels and springs, lying at the bottom of the black pit. Vanish, thou Vision of the demolished Tiktok, and leave me in peace—for I have bitterly repented!”</p><img src='https://xcx.mdavid.cn/img/image24.jpg'></img><p>“Then beg my pardon,” said Tiktok in a gruff voice, for Kaliko had forgotten to oil the speech works.</p><p>But the sound of a voice coming from what he thought a mere vision was too much for the Nome King’s shaken nerves. He gave a yell of fear and rushed from the room. Tiktok followed, so the King bolted through the corridors on a swift run and bumped against Kaliko, who was returning with a tray of things to eat. The sound of the breaking dishes, as they struck the floor, added to the King’s terror and he yelled again and dashed into a great cavern where a thousand Nomes were at work hammering metal.</p><img src='https://xcx.mdavid.cn/img/image25.jpg'></img><p>“Look out! Here comes a phantom clockwork man!” screamed the terrified monarch, and every Nome dropped his tools and made a rush from the cavern, knocking over their King in their mad flight and recklessly trampling upon his prostrate fat body. So, when Tiktok came into the cavern, there was only the Nome King left, and he was rolling upon the rocky floor and howling for mercy, with his eyes fast shut so that he could not see what he was sure was a dreadful phantom that was coming straight toward him.</p><p>“It oc-curs to me,” said Tiktok calmly, “that your Maj-es-ty is act-ing like a ba-by I am not a phan-tom. A phan-tom is unreal, while I am the real thing.”</p><p>The King rolled over, sat up and opened his eyes.</p><p>“Didn’t I smash you to pieces?” he asked in trembling tones.</p><p>“Yes,” said Tiktok.</p><p>“Then you are nothing but a junk-heap, and this form in which you now appear cannot be real.”</p><p>“It is, though,” declared Tiktok. “Kal-i-ko picked up my piec-es and put me to-geth-er a-gain. I’m as good as new, and perhaps bet-ter.”</p><p>“That is true, your Majesty,” added Kaliko, who now made his appearance, “and I hope you will forgive me for mending Tiktok. He was quite broken up, after you smashed him, and I found it almost as hard a job to match his pieces as to pick turnips from gooseberry bushes. But I did it,” he added proudly.</p><p>“You are forgiven,” announced the Nome King, rising to his feet and drawing a long breath. “I will raise your wages one specto a year, and Tiktok shall return to the Land of Oz loaded with jewels for the Princess Ozma.”</p><p>“That is all right,” said Tiktok. “But what I want to know is, why did you hit me with your mace?”</p><p>“Because I was angry,” admitted the King. “When I am angry I always do something that I am sorry for afterward. So I have firmly resolved never to get angry again; unless—unless—”</p><p>“Unless what, your Majesty?” inquired Kaliko.</p><img src='https://xcx.mdavid.cn/img/image26.jpg'></img><p>“Unless something annoys me,” said the Nome King. And then he went to his treasure-chamber to get the jewels for Princess Ozma of Oz.</p>"}