{"title": "Tim Tim Tamytam", "author": "", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>“This looks like an excellent place, Tim Tim!” Mrs. Tamytam said, as she threw her little bonnet back from her head. “An excellent place!” Tim Tim Tamytam scrambled up the root of the tree and peered into the dark hole in the tree trunk. “HMMM!” he said by way of reply, “Did you bring the candle with you, Tum Tum?”</p><p>“Oh, I forgot it, Tim Tim!” his little wife replied, “I will run right back and get it!”</p><img src='https://xcx.mdavid.cn/img/057.jpg'></img><p>“No, Tum Tum! I will run home and get it! You sit down upon this soft little toad-stool and wait until I return. It will take me but a moment!”</p><p>So Mrs. Tamytam sat down to wait upon the little soft toad-stool, with her bonnet hanging over her shoulders, and she sang and knitted.</p><img src='https://xcx.mdavid.cn/img/058.jpg'></img><p>Now, Mrs. Tamytam was a delightful little elfish lady, and she and Tim Tim were very, very happy together, even though they were only six inches tall.</p><p>So, while she sang and knitted, Tim Tim ran down the tiny path made by the woodfolk, past the bubbling spring and around the bend in the bank of the tumbling brooklet until he came to his home, which was another hole in the trunk of an old tree.</p><p>As Tim Tim climbed into his doorway, he stood and looked with dismay at what had been his cozy living room, for now it was filled with sawdust and small pieces of sticks and twigs, for the whole top of the old tree had broken off and now the rain would splash right down on everything the first time there was a shower.</p><p>Tim Tim Tamytam searched about in the sawdust and twigs until he found a tiny bit of bayberry candle, and, putting this in his pocket, he turned to go out of the hole. But just then Tom Tom Teenyweeny walked in the door.</p><p>“Hello, Tom Tom Teenyweeny!” Tim Tim cried cheerily.</p><p>“Hello, Tim Tim Tamytam!” Tom Tom cried at the same time, “What ever has happened to your lovely home, Tim Tim?”</p><p>“Well, I will tell you, Tom Tom,” Tim Tim answered, “You know Mrs. Fuzzytail lived with her grandchildren squirrels up in the top of the tree, and they had a very cozy den up there, too, but Mrs. Fuzzytail wished to make some small improvements, such as a new peep-hole window and a little cupboard for Chinkapins and hickory nuts. So last summer she sent for the carpenter ants and arranged with them to do the carpenter work. And do you know, Tom Tom,” and here Tim Tim Tamytam put his hand upon Tom Tom’s shoulder and got very confidential, “those mischievous carpenter ants, when they once got started, they sawed and chipped, until they had cut almost all of the shell of the tree away, and when it blew so very hard last night the top of the tree broke right in two, where the ants had made their tunnels, and down it fell with a great crash and made this great pile of sawdust and sticks!” “Dear me!” said Tom Tom. “Was anyone hurt when the top of the tree fell?”</p><p>“Fortunately no one was injured!” Tim Tim replied, “But our home was ruined and so was Mrs. Fuzzytail’s and Wally Woodpecker’s, the bachelor and we have been out looking for another home. If you will come with me, Tom Tom, I will show it to you, for now I have a candle and can look about inside!”</p><p>So Tim Tim and Tom Tom ran back along the tiny wood-folk path until they came to the place where Tim Tim had left Mrs. Tamytam.</p><p>There hung her knitting bag upon the stem of a flower, but Tum Tum Tamytam was no where about.</p><p>“OOOHooooo!” Tim Tim called, putting his hands to his mouth and forming a sort of horn. Charley Chipmunk stopped whittling upon a hickory nut and peeped over the limb to see who called.</p><img src='https://xcx.mdavid.cn/img/059.jpg'></img><p>Mrs. Tamytam did not answer, so Tom Tom took a leaf and rolled it into a horn. Across the small end he strung a fibre from a piece of moss and with this elfin horn he blew the Tim Tim Tamytam wood-call: “Tahoo Tahoo Tahoo-hoo-hoo!”</p><p>“That’s the Tim Tim Tamytam call!” all the wood creatures, said, as they listened.</p><p>“Tahoo Tahoo Tahoo-hoo-hoo!”</p><p>And as Tim Tim and Tom Tom listened, they heard away off the answering Tamytam wood-call: “Toowoo-toowoo-tooawoooooo!” sounding like the plaintive notes of the turtle dove but was easily distinguished by any of the woodfolk.</p><p>Tim Tim and Tom Tom followed the sound of the answering call until they came to a beautiful woodland glade. There, where the sweet ferns and fragrant flowers grew in profusion and a carpet of velvety moss spread upon the ground, they saw Mrs. Tom Tom Teenyweeny and Mrs. Tim Tim Tamytam with tiny brooms sweeping out a little hole in a great blue-gray beech tree.</p><img src='https://xcx.mdavid.cn/img/060.jpg'></img><p>“I came upon Mrs. Tamytam sitting upon the toad stool,” said Mrs. Teenyweeny, “and as I had just heard of this lovely home for rent, she came with me to see it and we decided to take it!”</p><p>“And will Tom Tom and Mrs. Teenyweeny live with us, Tum Tum?” Tim Tim asked.</p><p>“They have the little nook right across the hall!” Mrs. Tamytam replied. Upon hearing this Tom Tom and Tim Tim caught hold of hands and danced about, kicking up their heels with pleasure.</p><p>“Just wait until you see inside, Tom Tom and Tim Tim!” Mrs. Teenyweeny and Mrs. Tamytam cried, and then they led the way inside the trunk of the great blue-gray beech tree.</p><p>And after they had inspected Mrs. Tamytam’s home, Mrs. Teenyweeny’s Tom Tom and Tim Tim were as delighted with the new homes as their tiny wives had been, so Tim Tim and Tom Tom ran to their old homes and brought all their furniture and placed it about the large living rooms.</p><p>When all was finished and the tiny rugs had been placed just right, they heard a stamping of tiny feet in the hallway.</p><p>And as they ran to the door a merry, laughing crowd of tiny creatures like themselves, each carrying an acorn basket, trooped into the living room.</p><p>“It’s a surprise party!” they all shouted and then one, Tee Tee Tubbytee, a great speaker, said: “We watched you moving in, and decided to have a nice, fine, lovely party for you, so I called all the neighbors together and here we are!”</p><p>Some of the tiny creatures had brought their tiny violins and some their elfin flutes, and as all were in a merry mood they played rollicking airs such as “The Wind Tinkles the Fairy Bells” and “Mother Hulda Picks Her Geese.”</p><p>Tim Tim and Tom Tom danced and sang elfin songs. And then the merry tiny creatures ate the goodies brought in the acorn baskets.</p><img src='https://xcx.mdavid.cn/img/061.jpg'></img><p>After the dinner all the tiny creatures went outside, and upon the soft, mossy carpet they held a wood-folk dance while the silvery moon peeped down through the leaves of the woodland glade and bathed the scene in fairy light.</p><p>When the first rooster crowed, far away in a distant farm yard chicken coop, the tiny creatures, after planning another surprise party the next moonlit night, bade each other good night and went to their tree trunk homes.</p><p>So upon soft summer evenings, should you pass near the woodland glade, you may hear the “Tahoo Tahoo Tahoo-hoo-hoo!” and the answering notes of plaintive melody, “Toowoo-toowoo Tooawoooooo!” For the tiny creatures have adopted the Tamytam call as the call to the evening parties. And you must step quietly and approach softly so as not to disturb the tiny creatures, when you wish to see one of their moonlight surprise parties.</p><img src='https://xcx.mdavid.cn/img/062.jpg'></img>"}