{"title": "Time to Grow", "author": "Michael Kozubek", "level": "6 to 8,9 to12,", "category": "Fantasy,Funny,Modern,Original,", "tag": "", "length": "01 - 05 mins,", "body": "<p>Dark Interior. Light Above.</p><p>Girl Bulb : I think it’s finally warming up above. Almost time to push out.</p><p>Boy Bulb : What’s the rush? I like it here. It’s warm enough. There’s still plenty to eat.</p><p>Girl: You really have no choice.</p><p>Boy: Why? Is this my fate?</p><p>Girl: It is– for both of us. And you’re an early bloomer.</p><p>Boy: I want more from life than living a short dull life, then shriveling up and die. I want to soar on winds or be king of the jungle, conquering all before me.</p><p>Girl : You’re a TULIP!</p><p>Boy: A daffodil actually, narcissus type. I don’t know how I got tossed in with this group.</p><p>Girl : You still bring beauty to others.</p><p>Boy: I don’t see the beauty in standing around all day in one place, swaying in the wind with bees poking at you.</p><p>Girl : Basking in the sun, looking at the trees and all the other flowers. That’s heavenly. Didn’t your mother teach you this?</p><p>Boy: I’ve heard stories of Uncle Ralph getting trampled by children and Grandma Lorraine eaten by a deer. Ghastly! It’s not safe out there. It’s safe here in our beds.</p><p>Girl : There’s nothing more sad than having an animal or human dig you out of the ground before you’ve had a chance to bloom.</p><p>Boy: This is what I was made to do, is what you’re saying.</p><p>Girl : That’s right. Push on.</p><p>Boy: You’ll miss me.</p><p>Girl : Some of us will be right behind you. I’m a late bloomer. I’ll see you in late Spring.</p><p>Boy: When I’m shriveled and old, ready to fade to nothing.</p><p>Girl : You can be re-planted and grow again next year. And if you’ve been a good flower, eventually you go to heaven. Or perhaps you prefer your karma? You be a good tulip and in a few generations or so, you can maybe become an oak tree or even a frog.</p><p>Boy: Sounds exhausting! Can I stay in bed just a couple more days?</p><p>Girl : It’s your time. Go!</p><p>Boy: Well, maybe I’ll see other daffodils out in the sunlight.</p><p>Girl : That’s the spirit!</p><p>Boy: Adios, my friends. May your short Spring be sweet.</p><p>Girl : You leave here a bulb. Soon you become a flower!</p><p>(short silence)</p><p>Boy: Stay back! Rabbits!</p><img src='https://xcx.mdavid.cn/img/Flower-image.jpg'></img>"}