{"title": "Tom Thumb", "author": "Leonard Leslie Brooke", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Fairy Tale,Illustrated,", "tag": "", "length": "05 - 10 mins,", "body": "<img src='https://xcx.mdavid.cn/img/g076.png'></img><img src='https://xcx.mdavid.cn/img/g077.png'></img><img src='https://xcx.mdavid.cn/img/g0078.jpg'></img><p>Long ago, in the merry days of good King Arthur, there lived a farmer and his wife. They were very poor, but would have been contented and happy if only they could have had a little child. One day, having heard of the great fame of the magician Merlin, who was living at the Court of King Arthur, the wife persuaded her husband to go and tell him of their trouble. Having arrived at the Court, the man begged Merlin with tears in his eyes to give them a child, saying that they would be quite happy even if it was to be no bigger than his thumb. Merlin decided to grant the request, and what was the farmer’s astonishment to find when he reached home that his wife had a son, who, wonderful to tell, was no bigger than his father’s thumb!</p><img src='https://xcx.mdavid.cn/img/g079.png'></img><img src='https://xcx.mdavid.cn/img/g080.png'></img><img src='https://xcx.mdavid.cn/img/g0081.jpg'></img><p>The parents were now very happy, and the christening of the little fellow took place with great ceremony. The Fairy Queen, attended by all her company of elves, was present at the feast. She kissed the little child, and, giving it the name of Tom Thumb, told her fairies to fetch the tailors of her Court, who dressed her little godson according to her orders. His hat was made of a beautiful oak leaf, his shirt of a fine spider’s web and his stockings were made with the rind of a delicate green apple, and the garters were two of the finest little hairs imaginable, plucked from his mother’s eyebrows, while his shoes were made of the skin of a little mouse. When he was dressed, the Fairy Queen kissed him once more, and, wishing him all good luck, flew off with the fairies to her Court.</p><img src='https://xcx.mdavid.cn/img/g082.png'></img><img src='https://xcx.mdavid.cn/img/g083.png'></img><img src='https://xcx.mdavid.cn/img/g0084.jpg'></img><p>As Tom grew older, he became very amusing and full of tricks, so that his mother was afraid to let him out of her sight. One day, while she was making a batter pudding, Tom stood on the edge of the bowl, with a lighted candle in his hand, so that she might see that the pudding was made properly. Unfortunately, however, when her back was turned, Tom fell into the bowl, and his mother, not missing him, stirred him up in the pudding, tied it in a cloth, and put it into the pot. The batter filled Tom’s mouth, and prevented him from calling out, but he had no sooner felt the hot water, than he kicked and struggled so much that the pudding jumped about in the pot, and his mother, thinking the pudding was bewitched, was nearly frightened out of her wits. Pulling it out of the pot, she ran with it to her door, and gave it to a tinker who was passing.</p><p>He was very thankful for it, and looked forward to having a better dinner than he had enjoyed for many a long day. But his pleasure did not last long, for, as he was getting over a fence, he happened to sneeze very hard, and Tom, who had been quite quiet inside the pudding for some time, called out at the top of his little voice, “ACHOO!” This so terrified the tinker that he flung away the pudding, and ran off as fast as he could. The pudding was all broken to pieces by the fall, and Tom crept out, covered with batter, and ran home to his mother, who had been looking everywhere for him, and was delighted to see him again. She gave him a bath in a cup, which soon washed off all the pudding, and he was none the worse for his adventure.</p><img src='https://xcx.mdavid.cn/img/g085.png'></img><img src='https://xcx.mdavid.cn/img/g086.png'></img><p>A few days after this, Tom accompanied his mother when she went into the fields to milk the cows, and, fearing he might be blown away by the wind, she tied him to a thistle with a little piece of thread. While she was milking, a cow came by, bit off the thistle, and swallowed up Tom. Poor Tom did not like her big teeth, and called out loudly, “Mother, mother!” “But where are you, Tommy, my dear Tommy?” cried out his mother, wringing her hands. “Here, mother,” he shouted, “inside the red cow’s mouth!” And, saying that, he began to kick and scratch till the poor cow was nearly mad, and at length tumbled him out of her mouth. On seeing this, his mother rushed to him, caught him in her arms, and carried him safely home.</p><img src='https://xcx.mdavid.cn/img/g0087.jpg'></img><img src='https://xcx.mdavid.cn/img/g0088.jpg'></img><img src='https://xcx.mdavid.cn/img/g089.png'></img><img src='https://xcx.mdavid.cn/img/g090.png'></img><img src='https://xcx.mdavid.cn/img/g0091.jpg'></img><img src='https://xcx.mdavid.cn/img/g092.png'></img><p>Some days after this, his father took him to the fields to plough and gave him a whip, made of a straw, with which to drive the oxen; but little Tom was soon lost in the field. An eagle seeing him, picked him up and flew with him to the top of a hill where stood a giant’s castle. The giant put him at once into his mouth, intending to swallow him up, but Tom made such a great disturbance when he got inside that the monster was soon glad to get rid of him, and threw him far away into the sea. But he was not drowned, for he had scarcely touched the water before he was swallowed by a large fish, which was shortly afterwards captured and brought to King Arthur, as a present, by the fisherman. When the fish was opened, everyone was astonished at finding Tom inside. He was at once carried to the King, who made him his Court dwarf.</p>Long time he lived in happiness,<br/> <span>Loved by the Court,<br/> </span> And none like Tom was so respected<br/> <span>Amongst the better sort.<br/> </span><p>The Queen was delighted with the little boy, and made him dance on her left hand. He danced so well that King Arthur gave him a ring, which he wore round his waist.</p><img src='https://xcx.mdavid.cn/img/g093.png'></img><img src='https://xcx.mdavid.cn/img/g0094.jpg'></img><img src='https://xcx.mdavid.cn/img/g095.png'></img><p>Tom soon began to long to see his parents again, and begged the King to allow him to go home for a short time. This was readily allowed, and the King told him he could take with him as much money as he could carry.</p>And so away goes jolly Tom,<br/> <span>With three pence at his back—<br/> </span> A heavy burden which did make<br/> <span>His very bones to crack.<br/> </span><p>He had to rest more than a hundred times by the way, but, after two days and two nights, he reached his father’s house in safety. His mother saw him coming, and ran out to meet him, and there was great celebration at his arrival. He spent three happy days at home, and then set out for the Court once more.</p><img src='https://xcx.mdavid.cn/img/g096.png'></img><img src='https://xcx.mdavid.cn/img/g0097.jpg'></img><p>Shortly after his return, he one day did something to displease the King, so, afraid of the royal anger, he crept into an empty flower-pot, where he lay for a long time. At last he braved to peep out, and, seeing a fine large butterfly on the ground close by, he sneaked out of his hiding-place, jumped on its back, and was carried up into the air. The King and nobles all tried to catch him, but at last poor Tom fell from his seat into a watering-pot, in which he was almost drowned, only luckily the gardener’s child saw him, and pulled him out. The King was so pleased to have him safe once more that he forgot to give out to him, and made a fuss of him instead.</p><img src='https://xcx.mdavid.cn/img/g098.png'></img><p>Tom afterwards lived many years at Court, one of the best beloved of King Arthur’s knights.</p>Thus he at tilt and tournament<br/> <span>Was entertainèd so,<br/> </span> That all the rest of Arthur’s knights<br/> <span>Did him much pleasure show.<br/> </span> With good Sir Launcelot du Lake,<br/> <span>Sir Tristram and Sir Guy,<br/> </span> Yet none compared to brave Tom Thumb<br/> <span>In acts of chivalry.<br/> </span><img src='https://xcx.mdavid.cn/img/g099.png'></img>"}