{"title": "Tree House in my Back Yard", "author": "Sharon Krager", "level": "6 to 8,9 to12,", "category": "Modern,Original,Scary,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Two years ago my Dad and Uncle Jack built a beautiful tree house in the big oak tree at the edge of our property in my back yard. I have spent more time in that tree house than I have in my bedroom. It is a place to go when I want to be alone. It works for all of my friends and me to hang out in. We have even slept there all night long.</p><p>It is a little spooky being out there all alone when it is dark, but everything is pretty safe in our neighborhood. We all look out for each other. Or at least my friends and I do.</p><p>This last spring, we painted it blue. Mom says it is the brightest blue we could have picked out. I think it is great. Mom helped us find some old furniture to put in it and she put some curtains up to the window. The window doesn’t go up and down, but it lets in light.</p><p>Just a few weeks ago when we got out for summer break from school, I invited my two best friends to come over and have a sleep over. That meant that we would be staying in the tree house. They were so excited. They brought sleeping bags and pillows and I brought out snacks and games for us to play.</p><p>I had my cell phone and so did one of the other guys in case we needed anything from the house before mom and dad went to bed.</p><p>We played lots of games. We talked a lot, sang songs and told stories till about one thirty in the morning. The subject of our favorite sports was at the top of the list to talk about. We all loved to play baseball and were trying to get a team together with some other boys in our school. After a little while we all began to get tired and decided to call it a night. The battery lantern that we used for light was left on low, and we all started getting into our sleeping bags.</p><p>The tree house was big inside. It measured eight feet by eight feet. I guess it was a little crowded with all three of us in it, but we liked it. My friends thought I was so lucky to have it. One of them lived with other people, some lived in apartments. They didn’t have big yards and lots of space like I did. So, my house was usually the hang out. Sometimes it was only one or two of my friends that I had over and other times it was three or four of them.</p><p>We did everything together, but this was our favorite thing to do when the weather was nice enough for us to hang out in the tree house.</p><p>After we all got into our sleeping bags for the night we laid awake for a while talking. About fifteen minutes later we heard what sounded like someone climbing the ladder to the tree house.</p><p>“Listen,” I whispered. “I hear something. Do you hear it?”</p><p>“I hear someone coming up the ladder,” said Luke.</p><p>We all listened quietly, and thought we heard the door knob turn. It was very slowly. Thank goodness there was a lock on the door, and we had locked it a long time ago.</p><p>We heard a creaking sound just outside the door like someone was standing there. We were all too afraid to say anything. Again we heard creaking sounds. I grabbed my cell phone from my pocket and started to dial our house number. Just as I started to, the door knob turned again. This time it was a little more forceful. My heart was beating out of my chest. I could feel it in my throat. I finally got the number dialed. All of us guys were huddled close together just waiting to see what was going to happen. Who would be bothering us up here in the tree house this time of the morning?</p><p>All of a sudden BANG….BANG. Something hit the side of the tree house and we all jumped up.</p><p>“I’m scared,” said Joey. “What could that be, or who could that be?”</p><p>“I do not know.” Luke said. I said the same thing at the same time.</p><p>We heard heavy breathing. The breathing did not sound like a person breathing. It sounded like an animal of some kind. We also heard it pace back and forth by the front door on the step before you come in.</p><p>Then without thinking I dialed the house number again. It had not gone through the first time. I did not finish getting it dialed before.</p><p>“Hello, Mom.” I whispered. “We have a problem out here in the tree house.”</p><p>“What kind of a problem,” she said sleepily.</p><p>“Something or someone is just outside our door out here, and we need you and Dad to come help us.” I said.</p><p>“Alright, we will be there in a couple of minutes,” she said. “Just hang on we will come out and find out what is going on. You know that it is getting pretty windy outside, and I think a storm might be on its way.</p><p>We continued to hear the creaking and breathing, but we knew Mom and Dad would be coming soon. We stayed very quiet.</p><p>We could see lights flashing in the window. Mom and Dad were coming and shining lights to see what they could see. We heard one of them coming up the ladder. Dad said, “It’s me Conner, let me in.”</p><p>I opened to see Dad at the door and Mom coming up the ladder behind him.</p><p>“Conner, what did you hear?” Dad asked</p><p>We all tried to talk at once telling him what we had heard. It must have been hard for Mom and Dad to understand with all of us talking.</p><p>Dad asked us to come out of the tree house. He had something he wanted to show us. There were branches twisting and turning this way and that way. The wind had gotten up to a pretty good speed. Branches were coming down to the door and hitting it, brushing up against it, and making screeching sounds against the door that sounded like someone was turning the door knob. We all could see that it was the wind and branches making the noises. A big branch was lying in the ground that had probably hit the tree house on its way down.</p><p>“With all of this wind and the branches causing creaking and brushing noises, it sounded like someone was at the door.” Dad explained. “ I don’t know, there may be a storm coming, and I think it may start raining soon.”</p><p>“Would you boys feel safer inside?” Mom asked.</p><p>We all decided that might be the best thing to do at that time. We grabbed our sleeping bags, pillows, snacks, and games. My bedroom felt like a very safe place to be after we all got settled in. Two of us slept in my bed while the other friend bunked out on the floor. It took us a while to go to sleep with all of the excitement we had just had. Eventually we drifted off to sleep.</p><p>The tree house is still our most favorite place to be. I guess our imaginations were running wild that night with all the wind stirring things up outside. We still spend a lot of time out there, but not so much at night time. I still love my tree house and like to share it with my friends.</p>"}