{"title": "The Twin Sisters", "author": "Johnny Gruelle", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>Everybody in the little village called them the twin houses because they were built exactly alike. But the two little cottages looked different even if they were built alike, for one was covered with climbing vines and beautiful scarlet roses while the other had no vines or flowers about it at all.</p><p>Everybody called the two cottages the twin houses for another reason: the owners were twins. One of the twins was Matilda and the other Katrinka and they were as much alike on the outside as their two cottages were alike; but as their two cottages differed, so did the two twins differ.</p><p> </p><img src='https://xcx.mdavid.cn/img/046.jpg'></img><p> </p><p>Matilda could not be told from Katrinka should you just see them walking down the street, but the minute either of them spoke you would know which was Matilda and which was Katrinka. Matilda, who lived in the bare cottage, was sour and disagreeable, while Katrinka was happy and cheery.</p><p>So the people in the little village called Matilda “Matilda Grouch” and they called Katrinka “Katrinka Sunshine”. All the children of the little village loved Katrinka, for she always had a cooky or a dainty in her apron pocket to give them, or she would pat them on their curly heads and smile cheerily at them through her glasses. And all the children avoided Matilda, for, sometimes mistaking her for Katrinka and running close to greet her, they would have their noses tweeked for their trouble.</p><p> </p><img src='https://xcx.mdavid.cn/img/047.jpg'></img><p> </p><p>Matilda’s life was lonely and cold; no one went to see her. She was always unhappy.</p><p>Katrinka’s house always echoed with the laughter of children; everyone went to see her. She was always joyful and cheery.</p><p>One night while Matilda sat at her dark window looking across at Katrinka’s house, she saw a crowd of people tip-toeing up to the stoop with baskets under their arms and flowers in their hands and when all had crowded upon the porch they stamped their feet and made a great noise.</p><p> </p><img src='https://xcx.mdavid.cn/img/048.jpg'></img><p> </p><p>Matilda was very angry, but Katrinka ran laughing to the door and greeted all with her kindliest smile. It was a surprise party for Katrinka, for it was her birthday.</p><p>Matilda watched the party from her dark window and the longer she watched, the more angry she grew, for the longer the party lasted, the louder grew the happy laughter.</p><p>Finally when all the guests had gone, Matilda saw Katrinka gather up half of the presents and put them in a basket.</p><p>Then Katrinka stole softly up to Matilda’s stoop and stamped her feet. Matilda sat scowling by the dark window a long time before she finally went to the door, for she was very peevish.</p><p>“This is a fine time to come stamping upon a person’s stoop!” she scolded, as Katrinka walked into the living room.</p><p>“Oh, sister,” Katrinka cried, as she tried to kiss Matilda. “This is our birthday and I have brought you half of the presents which were given me! See?” and she piled the presents high upon the table.</p><p>“I do not wish them!” said Matilda, frowning at her sister. But Katrinka could see that Matilda did wish them.</p><p>“The presents were not for me, Katrinka!” she said.</p><p>“Oh yes they are!” Katrinka replied. “They were given to me and I give them to you! I have saved one half for myself! But you should have been to the party!” said Katrinka, “We had such a happy time!”</p><p>“I do not enjoy being with people!” Matilda scolded, “I wish to be left to myself!”</p><p>“Yes, but Matilda,” her sister said, “you do not know the happiness in being kind and friendly to others!”</p><p>“Pooh!” sniffed Matilda.</p><p>“I just wish you could take my place and know the happiness that is in my heart tonight,” Katrinka smiled.</p><p>“I just wish you could take my place and know the unhappiness that is in my heart tonight!” said Matilda, “You would see that a lot of children screeching about the house with all their presents could not bring me happiness!”</p><p>Katrinka thought a moment, “I have it, Matilda! We will change places! You must live in my house and pretend that you are me, and I will live in your house and pretend that I am you! And you must smile and be friendly just as I would do.”</p><p>After a great deal of coaxing, Matilda finally agreed that she would change places with Katrinka and try to smile when anyone came to see her.</p><p>“But only for three days!” she said.</p><p>So Matilda went over to Katrinka’s cottage and went to bed and Katrinka stayed in Matilda’s cottage, but she did not go to bed.</p><p>Instead she went all over the house and tidied everything up and placed pretty white curtains at the windows. In the morning neighbors came to Katrinka’s house, and Matilda, taking Katrinka’s place met them with a smile, and soon in spite of herself she was laughing and enjoying herself.</p><p>And when they left, Matilda felt that she enjoyed having them there.</p><p>But what was the callers’ surprise when they passed Matilda’s cottage to see someone planting flowers around the stoop. They stopped in wonderment and, as Katrinka looked up at them with a cheery “Good Morning!” and a happy smile they could scarce believe their eyes and ears, for they thought it was Matilda.</p><p>And these callers told other neighbors and they called at Katrinka’s house and visited with Matilda and Matilda was so pleased she laughed as cheerily as Katrinka could laugh. And as the neighbors left they saw Katrinka in Matilda’s front yard planting flowers and stopped in open mouthed wonder to gaze at her, for they thought she was Matilda.</p><p>And when Katrinka smiled at them and said her cheery “Good morning” they could scarcely believe their eyes and ears.</p><p>The neighbors all put their heads together, and that evening they filled their baskets with goodies and presents and, with large bouquets of flowers, they tiptoed up to Matilda’s front stoop and stamped their feet.</p><p>Now Katrinka had called Matilda over to her own house to see the changes she had made and Matilda was beginning to see what she had missed all along. And as they were talking, there came a noise at the front stoop.</p><p>“Shall I go to the door, Matilda?” asked Katrinka.</p><p>“No, I will go, Katrinka!” Matilda replied, her face alight with happiness. So Matilda welcomed her guests as cheerily as Katrinka had done the evening before and the laughter lasted until ‘way in the night.</p><p>And when the last guest had left, Matilda took Katrinka in her arms and said, “I will not need to change places with you again, Katrinka, for I have found that there is far more pleasure in being happy than in being unhappy!” “Of course there is, Matilda!” Katrinka replied. “You see, in order to be happy ourselves we must reflect happiness to others, and the more cheer we give to others the more joy we receive ourselves, so we must continue to change from one house to another every other day so that no one will know which of us is Matilda and which is Katrinka and we will share our happiness with each other.”</p><p>So Matilda’s house was soon surrounded with beautiful flowers and her house echoed with the fun and laughter of happy children.</p><p> </p><img src='https://xcx.mdavid.cn/img/049.jpg'></img><p> </p><p>And the two sisters who looked alike now acted alike and could not be told apart, and they changed about so often people never knew whether they were visiting Katrinka or whether they were visiting Matilda, for one was as cheery as the other and was as happy in the love of all the people in the little village.</p><p>And, as they could not be told apart, everyone called Matilda or Katrinka the Cheery Twins whenever they spoke of either.</p>"}