{"title": "The Ugly Duckling", "author": "Hans Christian Andersen", "level": "3 to 5,6 to 8,", "category": "Classic,Illustrated,", "tag": "Duck,Swan,", "length": "15 - 20 mins,", "body": "<img src='https://xcx.mdavid.cn/img/Ugly-Duckling-11.gif'></img><p>It was the summer time in the country and so beautiful. The wheat fields were golden, the oats were green, and the hay stood in great stacks in the green meadows. The stork paraded about among them on his long red legs, chatting away in a foreign language he had learned from his mother.</p><p>All around the fields grew thick woods, and in the middle of the forest was a deep lake. Yes, it was beautiful, it was delightful in the country.</p><p>In that wild, sunny spot stood a lovely old farmhouse surrounded by water and from the walls down to the water’s edge grew great tall plants.</p><p>In this snug place sat a duck upon her nest, watching for her eggs to hatch, but the pleasure she had felt at first was almost gone. She had begun to get tired, for the little ones were so long coming out of their shells and hardly anyone came to visit. The other ducks liked much better to swim about in the canals than to climb the slippery banks and sit under the plant leaves to gossip with her. It was a long time to stay so much by herself.</p><p>Finally, however, one shell cracked, and soon another, and from each came a little creature that lifted its head and cried “Peep, peep!”</p><p>“Quack, quack!” said the mother and then all the chicks tried to say it too as well as they could, as they looked around them at the tall green leaves. Their mother allowed them to look about as much as they liked.</p><p>“What a great world it is, to be sure,” said the little ones, when they found how much more room they had than when they were in the eggshell.</p><p>“Do you think this is all the world?” said the mother. “Wait till you have seen the garden. Far beyond that it stretches down to the farmer’s field, though I have never gone such a distance. Are you all out?” she asked. “No, not all. The largest egg is still lying there. I wonder how long this is going to take. I’m really beginning to get tired of it,” she replied to her own question. But for all that she sat down again.</p><p>“Well, how are you to-day?” quacked an old duck that came to pay her a visit.</p><p>“There’s one egg that takes a lot of hatching. The shell is hard and will not break,” said the fond mother, who still sat upon her nest. “But just look at the others. Have I not a pretty family? Are they not the prettiest little ducklings you ever saw? They look so like their father – the good-for-nothing! He never comes to see me.”</p><p>“Let me see the egg that will not break,” said the old duck. “I’ve no doubt it’s a wild bird’s egg. The same thing happened to me once, and the amount of trouble it gave me, they are afraid of the water. I quacked and clucked, but it was no good. Let me take a look at it. Yes, I am right, it’s a wild bird, I’m sure of it. Take my advice and leave it where it is. Come to the water and teach the other children to swim.”</p><p>“I think I will sit a little while longer,” said the mother. “I have sat this long, so a day or two more won’t matter.”</p><p>“Very well, please yourself,” said the old duck, rising and she went away.</p><p>At last the great egg broke and the latest bird cried “Peep, peep,” as he crept forth from the shell. How big and ugly he was! The mother duck stared at him and did not know what to think. “Really,” she said, “this is an enormous duckling, and it is not at all like any of the others. I wonder how he will turn out. Well, we shall see when we get to the water—for into the water he must go, even if I have to push him in myself.”</p><p>On the next day the weather was delightful. The sun shone brightly on the green leaves and the mother duck took her whole family down to the water and jumped in with a splash. “Quack, quack!” she cried and one after another the little ducklings jumped in. The water closed over their heads, but they came up again in an instant and swam about quite prettily, with their legs paddling under them as easily as possible. Their legs went on their own and the ugly grey one was also in the water, swimming with them.</p><p>“Oh,” said the mother, “that is not one of the wild birds. See how well he uses his legs, and how straight up he holds himself! He is my child and he is not so very ugly after all, if you look at him properly. Quack, quack! Come with me now. I will introduce you to the farmyard, but you must keep close to me or you may be trodden upon. Above all, beware of the cat.”</p><p>When they reached the farmyard, there was a big fight going on. Two families were arguing over a piece of fish, which in the end was carried off by the cat.</p><p>“See, children, that is the way of the world,” said the mother duck, looking jealously at the cat, for she would have liked the fish for herself.</p><p>“Come, now, use your legs, and let me see how well you can behave. You must bow your heads prettily to that old duck over there, she is the most important. Don’t you see she has a red cloth tied to her leg, which is something very grand and a great honour for a duck. It shows that everyone want to make sure not to lose her. Come, now, don’t turn in your toes. A well-bred duckling spreads his feet wide apart, just like his father and mother, in this way. Now bend your necks and say ‘Quack!'”</p><p>The ducklings did as they were told, but the other ducks stared and said, “Look, here comes another duck family—as if there were not enough of us already! And bless me, what a queer looking object one of them is! We don’t want him here.” One flew out and bit him in the neck.</p><p>“Leave him alone,” said the mother, “he is not doing any harm.”</p><p>“Yes, but he is so big and ugly,” said the spiteful duck, “and he must be sent away. A little bite will do him good.”</p><p>“The others are very pretty children,” said the old duck with the red cloth on her leg. “All except that grey one. I wish his mother could make him look better, he is not nice to look at.”</p><p>“That is impossible,” replied the mother. “He is not pretty, but he is very nice and swims as well as the others or even better. I think he will grow up pretty and perhaps even be smaller. He stayed too long in the egg and so is not the right shape yet.” Then she stroked his neck and smoothed the feathers, saying “He is not a girl duck, so he doesn’t have to look pretty. I think he will grow up strong and able to take care of himself.”</p><p>“The other ducklings are graceful enough,” said the old duck. “Now make yourself at home and if you find a piece of fish you can bring it to me.”</p><img src='https://xcx.mdavid.cn/img/Ugly-Duckling-2.gif'></img><p>And so they made themselves comfortable, but the poor duckling who had crept out of his shell last of all and looked so ugly, was bitten and pushed and made fun of. He was made fun of, not only by the ducks, but by all the chickens and other birds.</p><p>“He is too big,” they all said. The turkey, who fancied himself really as an emperor, puffed his chest out and attached the duckling. The poor little thing did not know where to go and was quite miserable because he was so ugly he was laughed at by the whole farmyard.</p><p>So it went on from day to day. It got worse and worse. The poor duckling was chased by everyone. Even his brothers and sisters were unkind to him and would say, “Ah, you ugly creature, I wish the cat would get you.” His mother had been heard to say she wished he had never been born. The ducks pecked him, the chickens beat him, and the girl who fed the poultry pushed him with her feet.</p><p>At last he could take it no more. So he ran away, frightening the little birds in the hedge as he flew over the fence. “They are afraid because I am so ugly,” he thought. So he flew still farther, until he came to a large moor, which is an area with lots of grass and wet ground and water. There were many wild ducks living there. He stayed the whole night, feeling very sad and lonely.</p><p>In the morning, when the wild ducks rose into the air, they stared at their new neighbour. “What sort of a duck are you?” they all said, coming round him.</p><p>He bowed to them and was as polite as he could be, but he did not reply to their question. “You are really very ugly,” said the wild ducks, “but that will not matter as long as you do not want to marry one of our family.”</p><p>Poor thing! He had not thought about marriage. All he wanted was to lie among the rushes and drink some of the water on the moor. After he had been on the moor two days, two young wild geese arrived. They were in fact goslings (the name for a young goose), for they had not been out of the egg for very long. This meant they were a bit cheeky.</p><p>“Listen, friend,” said one of them to the duckling, “you are so ugly that we actually like you. Will you go with us? Not far from here is another moor where there are some wild geese and none of them are married. It is a chance for you to get a wife. You may make your fortune, even though you are ugly.”</p><p>“Bang, bang,” sounded in the air and the two wild geese fell to the ground. “Bang, bang,” echoed far and wide in the distance and whole flocks of wild geese rose up from the rushes.</p><p>The sound continued from every direction, for hunters had surrounded the moor and some were even sitting on branches of trees overlooking the moor. The blue smoke from the guns rose like clouds over the dark trees. As it floated away across the water, hunting dogs bounced in among the long grass. The poor duckling was very scared! He turned away his head to hide it under his wing and at the same moment a large, terrible dog passed quite near him. His jaws were open, his tongue hung from his mouth, and his eyes glared. He stuck his nose close to the duckling, showing his sharp teeth and then jumped into the water with a splash, without touching him.</p><p>“Thank goodness for being so ugly” thought the duckling, “even a dog won’t bite me.”</p><p>And so he lay quite still, while the shots rattled through the rushes and gun after gun was fired over him. It was late in the day before all became quiet, but even then the poor young thing did not dare to move. He waited quietly for many hours and then, after looking carefully around him, moved away from the moor as fast as he could. He ran over field and meadow until a storm broke, and he could hardly move it was blowing so hard.</p><p>Towards evening he reached a poor little cottage that seemed ready to fall down and only seemed to remain standing because it could not decide on which side to fall first. The storm continued so strongly that the duckling could go no farther. He sat down by the cottage and then he noticed that the door was not quite closed, as one of the hinges was broken. There was a narrow opening near the bottom, big enough for him to slip through, which he did very quietly, and got a shelter for the night. Here, in this cottage, lived a woman, a cat, and a hen. The cat, who was called “My little son,” was a great favourite of the owner. He could raise his back, and purr, and could even throw out sparks from his fur if it were stroked the wrong way. The hen had very short legs, so she was called “Chickie Short-legs.” She laid good eggs, and her owner loved her as if she had been her child. In the morning the strange visitor was discovered. The cat began to purr and the hen to cluck.</p><p>“What is that noise about?” said the old woman, looking around the room. But her sight was not very good. When she saw the duckling, she thought it must be a fat duck that had strayed from home. “Oh, what a prize!” she exclaimed. “I hope it’s a girl duck, for then I will be able to have some eggs. I must wait and see.”</p><p>So the duckling was allowed to remain on trial for three weeks, but there were no eggs.</p><p>Now the cat and hen thought they owned the house. The cat thought he was the master of the house and the hen was the mistress. The duckling thought that other people might not agree, but the hen would not listen to such doubts.</p><p>“Can you lay eggs?” she asked. “No,” he replied. “Then stop talking,” said the hen back.</p><p>“Can you raise your back, or purr, or throw out sparks?” said the cat. “No,” he replied. “Then you are not allowed to speak when we are speaking,” said the cat.</p><p>So the duckling sat in a corner, feeling very alone, but when the sunshine and the fresh air came into the room through the open door, he began to feel such a great longing for a swim that he could not help talking about it.</p><p>“What a silly idea!” said the hen. “You have nothing else to do, so you have foolish ideas. If you could purr or lay eggs, you wouldn’t have them.”</p><p>“But it is so lovely to swim about on the water,” said the duckling, “and so refreshing to feel it close over your head while you dive down to the bottom.”</p><p>“Delightful, indeed! It must be a strange sort of pleasure,” said the hen. “Why, you must be crazy! Ask the cat—he is the smartest animal I know. Ask him how he would like to swim about on the water, or to dive under it. Ask our owner, the old woman, there is no one in the world more clever than she is. Do you think she would enjoy swimming and letting the water close over her head?”</p><p>“I see you don’t understand me,” said the duckling.</p><p>“We don’t understand you? Who can understand you, I wonder? Do you consider yourself more clever than the cat or the old woman?—I won’t even mention myself. Don’t imagine such nonsense, child and thank your luck that you have been looked after so well here. Are you not in a warm room and in a place you can learn things? But you are a chatter-box, and you are not nice to have around. Believe me, I only say these things to help you. I may tell you things you don’t want to hear, but that proves I am your friend. I advise you to lay eggs and learn to purr as quickly as possible.”</p><p>“I believe I must go out into the world again,” said the duckling.</p><p>“Yes, do,” said the hen. So the duckling left the cottage and soon found water where it could swim and dive, but he was avoided by all other animals because of his ugliness.</p><p>Autumn came, and the leaves in the forest turned to orange and gold. Then, as winter approached, the wind caught the leaves as they fell and blew them around. The clouds, heavy with snow, hung low in the sky, and a bird stood among the reeds, crying, “Croak, croak.” All this was very sad for the poor little duckling.</p><p>One evening, just as the sun was setting, there came a large flock of beautiful birds out of the bushes. The duckling had never seen any like them before. They were swans. They curved their graceful necks, while their soft feathers shone with a beautiful whiteness. They cried out their sound as they spread their wings and flew away from those cold areas to warmer countries across the sea. They flew higher and higher in the air, and the ugly little duckling had a strange sensation as he watched them. He whirled himself in the water like a wheel, stretched out his neck towards them, and made a cry so strange that it frightened even himself. Could he ever forget those beautiful, happy birds! And when at last they were out of his sight, he dived under the water and rose again almost beside himself with excitement. He didn’t know the names of these birds or where they had flown, but he felt towards them as he had never felt towards any other bird in the world.</p><p>He was not jealous of these beautiful birds, he didn’t even begin to wish to be as lovely as they were. Poor ugly creature, how gladly he would have lived even with the ducks, had they only been nice to him.</p><p>The winter grew colder and colder. He had to swim about on the water to keep it from freezing, but every night the space on which he swam became smaller and smaller. Finally, it froze so hard that the ice in the water crackled as he moved, and the duckling had to paddle with his legs as well as he could, to keep the space from closing up. He became very tired and lay still and helpless, frozen in the ice.</p><p>Early in the morning a man who was passing by saw what had happened. He broke the ice in pieces with his wooden shoe and carried the duckling home to his wife. The warmth of the house helped the poor little creature get better, but when the children wanted to play with him, the duckling thought they would hurt him, so he jumped up in fright, fluttered into the milk pan, and splashed the milk about the room. Then the woman clapped her hands, which frightened him even more. He flew first into the butter, then into a barrel and out again. The woman screamed and tried to hit him. The children laughed and screamed and tumbled over each other in trying to catch him, but luckily he escaped. The door was open, the poor creature could just manage to slip out among the bushes and lie down tired in the snow.</p><p>It would be very sad to tell all the hard things which the poor little duckling had to survive during the hard winter, but when it had passed he found himself lying one morning in a moor, among the long grasses. He felt the warm sun shining and heard birds singing and saw that all around it was beautiful spring.</p><p>Then the young bird felt that his wings were strong, as he flapped them against his sides and rose high into the air. His wings carried him on until, before he knew how it had happened, he found himself in a large garden. The apple trees were in full blossom, and other lovely-smelling trees bent their long green branches down to the stream. Everything looked beautiful in the early spring. From the bushes close by came three beautiful white swans, rustling their feathers and swimming lightly over the water. The duckling saw these lovely birds and felt more unhappy than ever.</p><p>“I will fly to these royal birds,” he said, “and they will finish me off because they will think that an ugly duck like me should not try to speak to them. But it does not matter. It is better than being pecked by the ducks, beaten by the hens, pushed about by the maiden who feeds the chickens, or starved with hunger in the winter.”</p><p>Then he flew to the water and swam towards the beautiful swans. The moment they saw the stranger they rushed to meet him with outstretched wings.</p><p>“Finish me off,” said the poor bird and he bent his head down to the surface of the water and waited for them to strike.</p><p>But what did he see in the clear water below? Himself — no longer a dark-grey bird, ugly and horrible to look at, but a graceful and beautiful swan.</p><p>The great swans swam round him and stroked his neck with their beaks as a welcome. After a while some little children came into the garden and threw bread and cake into the water.</p><p>“See,” cried the youngest, “there is a new one.” The rest were delighted and ran to their father and mother, dancing and clapping their hands and shouting happily, “There is another swan, come, a new one has arrived.”</p><img src='https://xcx.mdavid.cn/img/Ugly-Duckling-3.gif'></img><p>Then they threw more bread and cake into the water and said, “The new one is the most beautiful of all, he is so young and pretty.” And the old swans bowed their heads before him. Then he felt quite ashamed and hid his head under his wing, for he did not know what to do, he was so happy—yet he was not at all proud. He had been hated and attacked for his ugliness, and now he heard them say he was the most beautiful of all the birds. Even the old tree bent down into the water before him, and the sun shone warm and bright.</p><p>He shook his feathers, curved his slender neck, and cried joyfully, from the depths of his heart, “I never dreamed of such happiness as this while I was the ugly duckling.”</p>"}