{"title": "Unforeseen Adventures and Hidden Treasures", "author": "Antje Hergt", "level": "9 to12,Teen,", "category": "Modern,Original,", "tag": "", "length": "05 - 10 mins,", "body": "<p>When I was six, Dad left us. Mum was pretty upset and big brother, well, he ignored me as always.</p><p>I was mad!</p><p>And I was done with Dads and swore never to have one again, but after I had just turned seven, Mum met my Stepdad and this whole story began.</p><p> </p><p>I hated his place. It was so boring. It was summer when we moved into Stepdad’s house. Mum said it was bigger and we had an extra playroom, which was fun. Now we could build castles or houses without having to put them away – ever, but all my friends lived close to our old home. We had a garden now; all pretty with flowers for Stepdad loves gardening, but we couldn’t run around or climb trees. There weren’t any kids either, at least none I could see in these high-walled houses.</p><p>Bored, I roamed the house. The playroom was BORING! My brother was at soccer camp somewhere – what a stupid game. I kicked his actions figures off their fortress, payment for leaving me. I went to look for Mum and found her at her desk working.</p><p>“Why don’t you go and play in your room,” she rubbed my head absentmindedly.</p><p>“Boring,” I said and put on my best pouting face so she would feel sorry for me. Didn’t work.</p><p>“Go into the garden. It’s nice out,” she said, kissed my head and pushed me towards the door.</p><p>“It’s too loud,” I sulked.</p><p>“Oh, yes – the construction next door,” she stared hard at the computer. “Run on. They’ll finish soon.”</p><p>I dragged my feet over the floor, hands deep in my pockets.</p><p>“And don’t forget,” Mum said over her shoulder. “Don’t go to Chris’ study!”</p><p>A smile formed on my face. The perfect place to go exploring.</p><p>“Did you hear me?” she called after me.</p><p>“Heard you!” I shouted back as loud as I could already tiptoeing up the stairs. Stepfather’s study was in the attic – one large room with huge tilted windows in the roof, all way too high for me to look out. The room was stuffed with old smelly books, ant-hic – what ever that means – furniture and huge treasure trunks. Chris and Mum took us up there once before Mum declared it off limits.</p><p>“You seeeeeeee,” Mum had said in her special voice. “There is nothing interesting here,” she took my hand.</p><p>“Puh, these old books stink,” my brother said and went back to his computer game.</p><p>“But I don’t mind,” Chris added trying to be nice. I ignored him.</p><p>Mum raised her eyebrows. That always meant trouble. “You won’t be as generous when your First Editions will be used to built castles or serve as doll tables with pop spilled over them.”</p><p>He grinned. “You got a point, there.” And kissed her! Yuk! Right in front of me, I tucked her hand quickly and pulled her down the stairs.</p><p> </p><p>Well, I admit I tried a couple of times to sneak up there, but moms have super senses or something for she always caught me. Finally one night before my bedtime story, she told me the truth about the room.</p><p>“You know, Lizzy.” Mum tugged me in. “The study is very dangerous.”</p><p>“It’s just a room with ole books,” I said, but Mum looked very serious.</p><p>“It looks like that,” Mum said. “But the room is one big Time Machine.”</p><p>Never heard of such a thing. “A What?”</p><p>Mum looked me in the eyes. “It transports you in time. To the future or the past.”</p><p>“Woauh!” I wanted to try that. “To see dinosaurs?”</p><p>“Maybe, but once the door closes behind you, the study will spin through time. You won’t feel a thing since the inside wouldn’t move, but if you step out of the door…” She paused and I held my breath excitedly. “You won’t be on the stairs, but maybe on a mountain with a Triceratops or out in space with spaceships zooming around you.”</p><p>“Cool!” I clapped my hands.</p><p>“Yes,” Mum whispered, “but how will you get back to me?”</p><p>“Don’t tell her stories, love.” Stepdad’s voice came from the door and Mum flashed him an odd look. He leaned in the doorframe and blew me a Good Night kiss since I would squirm every time he tried to hug or kiss me. He was NOT my dad after all.</p><p> </p><p>I reached the landing. It was stuffy and dust flew lazily in the air. I hesitated in front of the dark oak door. I looked over my shoulder holding my breath. No, Mum was still in front of the computer; I could hear her fingers flying over the keyboard. I took a big breath and pushed the handle down. The door swung open without a sound and I slipped through.</p><p>The room lay in silence. Not even a fly buzzed in the hot afternoon air and I crept into the middle where a heavy table stood half-hidden by a dark-green cover with golden toddles.</p><p>It was gloomy in here – where was the sun? Through the windows I could only see a part of the sky. Dark clouds were chasing each other. Expectantly, I studied the room and waited – nothing happened.</p><p>“Hah, just one of Mum’s stories!”</p><p>She writes them for a living. I knew it. I laughed aloud and strolled around the table when a draft brushed my neck. I twisted my head. The door moved very slowly as if elves pushed it and then it slammed shut. The heavy wood rattled in the frame and then silence smothered the room. I held my breath, but nothing happened. So I took all my courage and walked towards the door. My knees wobbled so much; I thought I never make it.</p><p>CRASH! The room shook. My heart jumped to my ears as I sprinted back to the table. A bright light flashed past one of the windows and a roar thundered. The whole room swayed now and I crawled under the table as quickly as I could.</p><p>The Time Machine had activated!</p><p>I closed my eyes and clasped my hands over my ears, but the tumult would not stop. I cowered on the ground wishing I had listened to Mum. Then as quickly as it started it stopped. An eerie silence filled the room and I dared to look out from under the heavy tablecloth. The room lay in twilight, but looked the same. I edged out and listened.</p><p>Where was I? Better when was I?</p><p>I took a step towards the door when a horrible screech rebounded through the room. My heart stopped. Then silence. I edged closer to the door. Another scream filled the air, followed by a sound of gigantic teeth munching on bones. Dinosaurs, shot through my head. Eating one another.</p><p>BOOM! The room shook. BOOM, BOOM. The window glass vibrated in its frame and I looked up. A huge shadow swished over me. I screamed and darted under the table.</p><p>Lights flashed followed by a low grumble as I rolled into a ball as tight as I could.</p><p>The door flew open. “Lizzy, are you in here?”</p><p>“Chris?” I whispered. No, he was back in my time.</p><p>A shadow fell over me. “Don’t eat me.”</p><p>“Now, why would I do that?” Chris said and I peeked out from under my arms.</p><p>“You came to save me,” I launched forward and nearly knocked him over. His big arms engulfed me as I hid my face in his chest.</p><p>“I was so scared. The dinosaurs were out there. To get me. I couldn’t get back. Never see Mum again!”</p><p>“Now, now,” he rubbed my back.</p><p>“How did you find me?” I sniffled.</p><p>He shrugged his shoulders. “Remote control.”</p><p>I looked up. “You brought the Time Machine back with a remote?”</p><p>He said with a smile. “Couldn’t leave you as dino food, could I?”</p><p>“No,” I answered solemnly.</p><p>“Your Mum was so worried and sad,” he said. “So I set the dials and jumped in the room as soon as it stopped. Luckily, you are a smart girl and didn’t leave the room.”</p><p>“The T- Rex was just outside, smashing his gigantic tail against the wall to get in and eat me!” I blinked away the tears.</p><p>Chris nodded gravely. “If you had left the room, I wouldn’t have been able to save you, since the Time Machine never lands twice in the same spot.”</p><p>“I’d be lost forever,” I mumbled.</p><p>He winked. “But you aren’t.”</p><p>He scooped me up into his arms and carried me downstairs to Mum.</p><p> </p><p>Now, of course, I know there are no Time Machines and the dinosaur was only the crane next door. I know that now being so much older. I’m nine! But my Stepdad is still my secret hero. I don’t make life any easier for him, but he stayed and I love him for that.</p>"}