{"title": "Uraschima Taro and the Turtle", "author": "", "level": "6 to 8,9 to12,", "category": "Classic,Fairy Tale,Folk Tale,Japanese,", "tag": "Turtle,", "length": "05 - 10 mins,", "body": "<p>URASCHIMA Taro, which means in Japanese “Son of the Island,” was the only and dearly beloved son of an old fisherman and his wife.</p><p>He was a fine, strong youth, who could manage a boat more cleverly than any one else on the neighboring coast. He often ventured so far out to sea that neighbors warned his parents that he would sometime go too far and never return.</p><p>His parents knew, however, that he understood his boat and the sea very well, and they were never much concerned about him. Even when he failed to come back as soon as he was expected, they awaited his return without worry. They loved him better than their own lives, and were proud that he was braver and stronger than their neighbors’ sons.</p><p>Early one morning, Uraschima Taro went to haul in his nets, which had been set the night before. In one of them, among some fishes, he found a small turtle. This he placed in the boat, by itself, where it would safely keep, until he could take it home. To his amazement, the turtle begged for its life in most pitiful tones. “Of what use am I to you?” it asked. “I am too small to eat, and so young that it will take me a long time to grow. Have mercy and put me back into the sea, for I do not want to die.” Uraschima Taro had a very kind heart and could not bear to see anything that was small and helpless suffer; so he did as the turtle asked him.</p><p>Several years after this, when Uraschima Taro was one day far out at sea, a terrible whirlwind struck his boat and shattered it. He was a good swimmer, and managed for a long time to make progress toward the land; but as he was so far from shore in the rough sea, his strength at last gave out and he felt himself sinking. Just as he had given up hope, and thought that he would never see his dear parents again, he heard his name called and saw a large turtle swimming toward him.</p><p>“Climb on my back,” shouted the turtle, “and I will carry you to land.” When Uraschima Taro was safely sitting on the turtle’s back it continued: “I am the turtle whose life you saved when you found me, little and helpless, in your net, and I am glad of this opportunity to show that I am not ungrateful.”</p><p>Before they reached the shore, the turtle asked Uraschima Taro how he would like to be shown some of the wonderful beauties hidden under the sea. The young fisherman replied that the experience would please him. In a moment they were shooting down through the green water. He clung to the turtle’s back, who carried him many, many fathoms below. After three nights they reached the bottom of the sea, and came to a wonderful palace of gold and crystal. Coral and pearls and precious stones dazzled his eyes; but inside, the palace was more beautiful still, and blazing fish scales lighted it.</p><p>“This,” said the turtle, “is the palace of the sea-god. I am a waiting-maid to his lovely daughter, the Princess.”</p><p>The turtle went to announce the arrival of Uraschima Taro to the Princess, and soon returning, led him to her presence. She was so beautiful that when she asked him to remain in the palace he gladly consented.</p><p>“Do not leave me, and you shall always be as handsome as you are now, and old age cannot come to you,” she said.</p><p>So it happened that Uraschima Taro lived in the marvelous palace at the bottom of the sea with the daughter of the sea-god. He was so happy that the time passed by unheeded. How long he dwelt there he could not have told. But one day he thought of his parents; then he remembered that they must be troubled by his absence. The thought of them kept coming to him continually, and the longing to see them grew so strong that at last he told the Princess he must go to visit them. She begged him not to leave her and wept bitterly.</p><p>“If you go, I shall never see you again,” she sobbed.</p><p>But he told her that he must see his father and mother once again; then he would return to the palace in the sea, to be with her always. When she found that she could not persuade him to remain, she gave him a small gold box, which, she told him, he must on no account open.</p><p>“If you heed my words,” said she, “you may come back to me. When you are ready, the turtle will be there to bring you; but if you forget what I have told you, I shall never see you again.”</p><p>Uraschima Taro fondly assured her that nothing in the world should keep him from her, and bade her farewell. Mounting the turtle’s back, he soon left the palace far below. For three days and three nights they swam, and then the turtle left him on the familiar sands near his old home.</p><p>He eagerly ran to the village and looked about for some of his comrades. All of the faces were strange, and even the houses seemed different. The children, playing in the street where he had lived, he had never seen before. Stopping in front of his own house, he regarded it with a sinking heart. There was the sound of music from a window above, and a strange woman opened the door to him. She could tell him nothing of his parents, and had never heard their names. Every one whom he questioned looked at him curiously. At last he wandered from the village and came to the burying ground. Searching about among the graves, he soon found himself beside a stone bearing the dear names he sought. The date showed him that his father and mother had died soon after he left them; and then he discovered that he had been away from his home three hundred years. Bowed with sorrow, he went back to the city. At each step he hoped to wake and find it all a dream, but the people and streets were real.</p><p>He thought of the Princess, and remembered the gold box she had given to him. It might be that he was under some cruel enchantment, and that this box contained the charm to break the spell. He eagerly raised the cover, and a purple vapor escaped and left the box empty. To his alarm, he noticed that the hand that held it had shriveled and grown suddenly old. Trembling with horror, he ran to a stream of water which ran down from the mountain, and saw reflected in its waters the face of a mummy.</p><p>He crawled fearfully back to the village, and no one recognized him as the strong youth who had entered it a few hours before. Nearly exhausted; he finally reached the shore, where he sat wearily on a rock and cried to the turtle. But he called to it in vain; the turtle never came, and soon his quavering voice was hushed in death.</p><p>Before he died, the people of the village gathered about him and listened to his strange story. Long afterward they told their children of the young man who, for the love of his parents, left a marvelous palace in the sea, and a Princess more beautiful than the day.</p>"}