{"title": "The Visit to Santa Claus Land", "author": "", "level": "3 to 5,6 to 8,", "category": "Christmas,Classic,", "tag": "", "length": "01 - 05 mins,05 - 10 mins,", "body": "<p>JACK and Margaret were growing more excited each day, because Christmas was so near. They talked of nothing but Santa Claus.</p><p>“Don’t you wish you could see him?” they said over and over.</p><p>One night, just before Christmas, Mother tucked them in bed and left them to go to sleep. But Jack wiggled, Margaret wriggled. At last they both sat up in bed.</p><p>“Jack,” Margaret whispered, “are you asleep?”</p><p>“No,” said Jack, “I can’t go to sleep. Margaret, don’t you wish you could see Santa Claus? What’s that?”</p><p>They both listened, and they heard a little tap, tap on the window. They looked, and there, right in the window, they saw a funny little Brownie.</p><p>“What’s that I heard you say? You want to see Santa Claus? Well, I am one of his Brownies. I am on my way back to Santa Claus Land. I’ll take you with me if you want to go.”</p><p>Jack and Margaret scrambled from their beds.</p><p>“Come on, show us the way!” they cried in great excitement.</p><p>“No, indeed,” said the Brownie. “No one must know the way to Santa Claus Land. Kindly wait a moment.”</p><p>Then the Brownie took something soft and thick and dark, and tied it around Jack’s eyes. Next he took something soft and thick and dark, and tied it around Margaret’s eyes.</p><p>“How many fingers before you?” he asked.</p><p>Both of them shook their heads. They could not see a wink.</p><p>“Very well, now we’re off,” said the Brownie.</p><p>He took Jack’s hand on one side, and Margaret’s on the other. It seemed as if they flew through the window. They went on swiftly for a little while, then the Brownie whirled them round and round until they were dizzy, and off they went again. The children could not tell whether they were going north, south, east, or west. After a time they stopped.</p><p>“Here we are,” said the Brownie.</p><p>He uncovered their eyes, and the children saw that they were standing before a big, thick gate.</p><p>The Brownie knocked and the gate was swung open. They went through it, right into Santa Claus’s garden.</p><p>It was a very queer garden. There were rows and rows of Christmas trees, all glittering with balls and cobwebby tinsel, and instead of flower beds there were beds of every kind of toy in the world. Margaret at once ran over to a bed of dolls.</p><p>“Let’s see if any of them are ripe,” said the Brownie.</p><p>“Ripe?” said Margaret in great surprise.</p><p>“Why, of course,” said the Brownie. “Now if this one is ripe it will shut its eyes.”</p><p>The Brownie picked a little doll from the bed and laid it in Margaret’s arms. Its eyes went half shut, and then stuck.</p><p>“No, it’s not ripe yet,” said the Brownie. “Try this one.”</p><p>He picked another one, and this one shut its eyes just as if it had gone to sleep.</p><p>“We’ll take that one,” he said, and he dropped it into a big sack he was carrying.</p><p>“Now this one cries, if it’s ripe,” he said as he picked a lovely infant doll. The Brownie gave it a squeeze, and the doll made a funny squeaking noise.</p><p>“Not quite ripe,” he said, and he put it back into the bed. He tried several others, and he picked a good many. Some of them cried, some said “Mamma” and “Papa,” and some danced when they were wound up.</p><p>“Oh, do come over here, Margaret!” Jack called.</p><p>Margaret ran over to another bed and there were drums—big drums, little drums, and middle sized drums; yellow drums, blue drums, green drums, red drums.</p><p>“Can we gather some of these?” said Jack to the Brownie.</p><p>“Why, of course. Let’s see if this one is ripe.”</p><p>The Brownie took up a little red drum, and gave it a thump with a drum stick. But it made such a queer sound that Jack and Margaret both laughed out loud. The little red drum was put back into the bed, and the Brownie tried another big one. It went Boom! Boom! Boom! Boom! Boom! and Jack and Margaret marched all along the bed, keeping step to it.</p><p>When they had finished picking drums, they went over to a bed filled with horns. That was the most fun of all. Some of them made very queer noises, and on some the Brownie played jolly little tunes.</p><p>The next bed they came to was filled with toys which could be wound up. There were trains, automobiles, dancing dolls, climbing monkeys, hopping birds, funny wobbling ducks, and every kind of toy you could think of. The children stayed at this bed for a long time.</p><p>At last Margaret said: “But where is Santa Claus? We wanted to see him.”</p><p>“Oh, to be sure,” said the Brownie. “Come along,” and he led them down a long, winding walk, to the edge of the garden. Then he pointed to a hill in the distance.</p><p>“Do you see that large white house? There is where he lives.”</p><p>The children stared at it. It was so white that it seemed to shine in the distance.</p><p>“Walk right across here,” said the Brownie, “then up the hill to Santa Claus’s house.”</p><p>“Oh, must we walk across there?” said Margaret. She stared down into the deep dark chasm, a scary drop between the garden and the hill. Across it was stretched a narrow plank.</p><p>“Walk carefully,” said the Brownie, “and mind you don’t look down; for if you do, I’m afraid you won’t see Santa Claus to-night.”</p><p>“We’ll be very careful,” said Jack. “Come along, Margaret,” and he took his little sister’s hand and they started across the plank.</p><p>They had almost reached the middle of it when Jack looked down.</p><p>“Oh!” he said, and gave Margaret a pull.</p><p>She looked down too, and cried “Oh, Oh!” and down, down, down they went.</p><p>Suddenly they landed with a thump. They sat up and rubbed their eyes. There they were right in their own beds at home. Mother opened the door.</p><p>“Are you awake, children?” she said.</p><p>“Oh, Mother, we haven’t been asleep. We’ve been to Santa Claus Land, and we nearly saw Santa Claus!”</p><p>Then they told her all about it, and Mother just smiled.</p>"}