{"title": "Walter Takes a Break", "author": "David Lambert", "level": "3 to 5,6 to 8,", "category": "Fantasy,Modern,Original,", "tag": "Spider,weezle-wobbler,", "length": "05 - 10 mins,", "body": "<p>One bright sunny day, Walter set off to visit his friend at the seaside. He packed 2 squirrel-snot sandwiches and a bottle of fizzy tomato pop into his small magic travelling bag, pulled on his best pair of bright orange underpants, combed his bushy blue toes and began his short journey to see his friend Webster the spider.</p><p>Walter’s friend Webster is a friendly little blue spider who lives in a disused drainpipe at the bottom of pebble cliff right on the sea front. He has lived there since he was 4 and he has made the drainpipe very comfortable to live in. It has an old empty Crab shell that Webster uses for a seat and a bit of green coloured fishing net for a curtain over the entrance. It has a mattress made of dried-out seaweed and his blankets are made out of old sweet papers that some people have screwed up and thrown away. It’s a comfortable little pipe and hopefully there will be lots of room for Walter when he comes to visit.</p><p>Walter caught bus number 96b to Mabel’s miniature railway and then hopped on to the first train headed to the seaside.</p><p>Buses and trains from Weezle-ville are very fast and by the time Walter had eaten one of his tasty squirrel-snot sandwiches with a sprinkle of custard powder on the top and a bag of frog-flavoured crispy meatballs the train had arrived at the little seaside town called Sandilands. Walter was very excited as he stepped foot on to the platform and was delighted to see Webster the spider sitting on the wall waiting for him.</p><p>Walter’s big furry blue hand gently shook Webster’s tiny blue furry leg and after the friends had greeted each other, Webster jumped on to Walter’s shoulder and off they headed in the direction of Pebble cliff to settle down for tea in Webster’s comfy little drainpipe.</p><p>Walter wasn’t very hungry, as he had eaten one of his sandwiches on the train, but when they arrived they both sat on top of the drainpipe were they shared a jam-stick. Jam-sticks are one of Webster’s favourite foods and are made of seagull feathers wrapped in banana chips, smothered in liquorice and covered in orange marmalade. They are a big favourite of lots of creatures at the seaside and Walter and Webster both love jam-sticks.</p><p>After they had washed them down with a glass of mashed apple tea they settled down inside the drainpipe for a good night’s sleep. Webster snored a lot for such a little spider and Walter’s left foot was left hanging out of the pipe a little but apart from having his toes nibbled by a lonely lobster passing by, he had a pretty good night’s sleep.</p><p>The two friends got up at 6.26 exactly, brushed their teeth and wandered down to the sea for their morning baths. Walter paddled in up to his hairy knees before sitting his big furry blue bum down on big rock and let the waves hit him in the face. He had forgotten to bring his wobble-soap from home, so had to borrow some from Webster. Of course the borrowed soap was very small and it kept slipping from his pointy blue furry fingers. Luckily every time he dropped it, the little bar of soap landed near a family of passing crabs out for their morning walk and each time between them and with all their strength they manage to throw it up as high as they could and Walter was able to catch it and was then able to finish having his wash. Webster was much cleverer than Walter and he simply stood on a big rock and let the waves splash into his face as he scrubbed his 8 furry legs and little pink face with the soft sand…easy when you know how!</p><p>After a scrumptious breakfast of roasted rats’ tails with fried rabbit’s whiskers washed down by mashed apple tea the two furry friends went for a long walk on the beach. Webster climbed on top of Walter’s head and was able to see for miles to show Walter which way to go.</p><p>They hadn’t got very far when swooping down out of the bright blue sky came Spencer the seagull. He was the King of all the seagulls and because of his daily diet of Sandworms and crickets he had grown much bigger and much stronger than all the others.</p><p>“Hey guys!” called Spencer.  “If you have a few minutes to spare and a couple of juicy sandworms for me, I will take you on a little flight around the coast.”</p><p>Walter looked all around and found two little sandworms hiding near a discarded lollipop stick. He picked them up and gave them to Spencer and then put Webster on the back of the Seagull’s neck. Spencer lowered his huge bill to suck on his sandworms and Walter was able to climb gently onto his back.</p><p>Gripping hold of the bird’s huge feathers, they held on with all their strength as Spencer soared high into the bright morning sky. They trembled and shook as up they went, up and up, higher and higher, soaring gracefully in and out of the fluffy white clouds. Looking down, the spider and the weezle-wobbler watched all the people get smaller and smaller as they turned from huge giants into tiny black spots running around like ants on the yellow beach below.</p><p>They soared a little higher before Spencer’s huge wings banked gently to the right. Far over past the smallest cloud on the right they could see Sandyhook lighthouse and Larry the Lobster, the lighthouse keeper. To the left, just off the shore near Sandyhook, Webster and Walter could see warglenorks swimming slowly in the huge blue ocean. Walter had never seen a warglenork before but they were instantly recognisable with their huge square jaws, massive sharp teeth, lime green skin and a tail the size of a London bus. They also had an incredible smell about them. It’s very difficult to explain, but best described as a smell that is a cross between the stuff that runs out of a cow’s bum on a hot day and one of your big sister’s burps after she has been eating broccoli and cheese sandwiches….Ughh!</p><p>Soaring back down towards the coast they could now make out Luigi’s lollipop lorry parked at the end of the lane. A perfect end to the day would be for all of them to have a nice refreshing jam-stick before heading back to the drainpipe.</p><p>“Forget jam-sticks!” yelled Spencer, “I know something much more refreshing.”</p><p>And then, suddenly he dived towards the ground heading straight for an old little fat bald man in a red shirt and yellow shorts sat on a bench outside the sweet shop eating a huge ice cream covered in raspberry sauce..</p><p>Down and down they went, faster and faster and closer and closer until they reached the old man …Suddenly, Spencer’s huge bill opened and he stole the ice-cream straight off the top of the man’s ice cream cone, chocolate flake and all.</p><p>Flying briskly away, Spencer landed nearby on top of a little wall near the park and the three of them all enjoyed a fine mouthful of banana flavoured ice-cream…mmm!</p><p>They couldn’t eat it all as it was so big, but they really enjoyed the cold tingle on their tongues and it was even nice to stand in the raspberry sauce and let it cool their feet down.</p><p>After licking their fingers and toes clean, Spencer gave them a ride back to the beach and then he headed off to the sand dunes in search of some juicy crickets to have for his supper later before he went to bed.</p><p>Sadly it was time for Walter and Webster to say goodbye. It had only been a very short visit but they had really enjoyed their time together and they both hoped that they could do it again very soon. Perhaps next time Webster could come to Weezle-ville and Walter could show him around the town and introduce him to all of his weezle-wobbler friends.</p><p>Walter fetched his magic travelling bag, waved goodbye to Webster and set off for the station. It wasn’t too long before his train arrived and by the time he had eaten his other squirrel-snot sandwich he was back home on the platform of Mabel’s miniature railway just across the road from the old tin mine and very close to home.</p><p>He had really enjoyed his time at the seaside, but now he wanted to get to his plastic bucket and lay down his big heavy furry blue head and do nothing but;</p><p>SLEEP….ZZZZZZZZZZZZZZzzzzzzzzzzz</p>"}