{"title": "Was Moti Clever or Stupid?", "author": "Srijaya Char", "level": "3 to 5,6 to 8,9 to12,", "category": "Classic,Folk Tale,Indian,", "tag": "Monkey,", "length": "01 - 05 mins,", "body": "<p> Moti was a monkey. He did all his housework himself. He always swept his house with his own tail. One day while sweeping the floor a thorn got into his tail. Try what may, he could not get it out. He went in search of a barber.</p><p>“Dear barber, a thorn has got into my tail. I am unable to take it out. It is very painful. Can you help me?” he asked.</p><p>“Sure, I can do it in no time,” said the barber and took out his knife. He pushed his knife as far as possible into the tail of the monkey, but the thorn did not come out. The monkey was very angry as he was bleeding. He screamed and threw the knife on a rock and the handle of the knife broke.</p><p>“Will you give me my knife back or shall I cut your tail?” screamed the barber.</p><p>“Okay, cut my tail and give me the knife!” Moti screamed back.</p><p>The barber cut the tail. The monkey managed to contain the blood by sticking some leaves to it and went away with the knife without much fuss.</p><p>He was hungry and climbed a mango tree and plucked some mangoes to eat.  There was a man standing under the tree who begged the monkey to give him some Mangoes to eat. The monkey not only gave him the mangoes but also the handle-less knife to cut.</p><p>Being a kind monkey, Moti gave him the mangoes and also gave him the handle-less knife to cut the mangoes. As the man was cutting the mangoes to eat, he dropped the knife into a pond.</p><p>Moti was angry. Now, what will you give me? “You have lost my knife, what have you got with you to give me?”</p><p>“Will you take the mangoes?” asked the man.</p><p>Moti agreed and took the cut mangoes back from him.</p><p>As Moti was proceeding further eating and enjoying the mangoes, he came across an oil seller. “Dear, dear Monkey, can I have some mangoes? I am very fond of it,” said the oil-seller.</p><p>“Okay, what will you give me instead?” asked Moti.</p><p>“Can I give you some oil? You can use it for today’s cooking,” he said.</p><p>“That’s perfectly okay. Give me some oil in a coconut shell,” he said humbly.</p><p>Moti took the oil from the seller in a coconut shell and went in search of something that he could cook with the oil with.</p><p>To his luck, he saw an old lady making ‘dosas’ (a dosa is a kind of muffin) on a tava (pan) without oil and she was finding it difficult to extract it from the pan.</p><p>Moti went near her and said “Dear old lady, I have some oil with me which will make it easier for you to remove the dosa from the pan. Come on take this. You must give me at least 4 dosas in return for the oil,” he said.</p><p>The old lady was happy and agreed. She made three to four dosas and kept two more for herself to be eaten later. Moti thanked her and felt satisfied after eating the delicious dosas. </p><p>As he was going about with the packed dosa in a leaf, he came across a man with a big drum and a stick. He was fascinated by it. He volunteered to ask him, “Dear drummer, will you take these two dosas and give me the drum and the stick?”</p><p>The drummer was very hungry and he agreed for the barter. He took the dosas and gave him the drum and the stick.</p><p>The monkey now climbed on top of a tall tree and started to beat the drum with the song:</p><p>“I lost the tail and got a knife</p><p>Dum, dum, dum (beats the drum)</p><p>I lost the knife and got a mango,</p><p>Dum, dum, dum (beats the drum)</p><p>I lost the mango and got some oil</p><p>Dum, dum, dum (beats the drum)</p><p>I lost the oil and got some dosas</p><p>Dum, dum, dum (beats the drum)</p><p>I lost the dosas and got the drum</p><p>Dum, dum, dum,dum,dum,dum…………</p><p> </p><p>So, the Moti was satisfied with whatever happened that day and ran away with glee.</p><p>(This is an ancient folktale of Karnataka)</p><p>(dosa – is a kind of muffin)</p>"}