{"title": "The Young Head of the Family", "author": "", "level": "3 to 5,6 to 8,9 to12,", "category": "Chinese,Classic,Fairy Tale,Folk Tale,", "tag": "", "length": "05 - 10 mins,", "body": "<p>THERE was once a family consisting of a father, his three sons, and his two daughters-in-law. The two daughters-in-law, wives of the two elder sons, had but recently been brought into the house, and were both from one village a few miles away. Having no mother-in-law living, they were obliged to request to their father-in-law whenever they wished to visit their former homes, and as they were lonesome and homesick they continuously bothered the old man by asking permission to leave for a time.</p><p>Annoyed by these constant requests, he decided to invent a method of putting an end to them, and at last gave them permission in this way: “You are always begging me to allow you to go and visit your mothers, and thinking that I am very hard-hearted because I do not let you go. Now you may go, but only upon condition that when you come back you will each bring me something I want. The one shall bring me some fire wrapped in paper, and the other some wind in a paper. Unless you promise to bring me these, you are never to ask me to let you go home; and if you go, and fail to get these for me, you are never to come back.”</p><p>The old man did not think that these conditions would be accepted, but the girls were young and thoughtless, and in their anxiety to get away did not consider the impossibility of obtaining the things required. So they made ready with speed, and in great delight started off on foot to visit their mothers. After they had walked a long distance, chatting about what they should do and whom they should see in their native village, the high heel of one of them slipped from under her foot, and she fell down. Owing to this mishap both stopped to adjust the shoe, and while doing this the only conditions under which they could return to their husbands came to mind, and they began to cry.</p><p>While they sat there crying by the roadside a young girl came riding along from the fields on a water buffalo. She stopped and asked them what was the matter, and whether she could help them. They told her she could do them no good; but she continued in offering her sympathy and asking them to explain, till they told their story, and then she at once said that if they would go home with her she would show them a way out or their trouble. Their case seemed so hopeless to themselves, and the child was so sure of her own power to help them, that they finally accompanied her to her father’s house, where she showed them how to comply with their father-in-law’s demand.</p><p>For the first a paper lantern only would be needed. When lighted it would be a fire, and its paper surface would compass the blaze, so that it would truly be “some fire wrapped in paper.” For the second a paper fan would suffice. When flapped, wind would issue from it, and the “wind wrapped in paper” could thus be carried to the old man.</p><p>The two young women thanked the wise child, and went on their way rejoicing. After a pleasant visit to their old homes, they took a lantern and a fan, and returned to their father-in-law’s house. As soon as he saw them he began to vent his anger at their light regard for his commands, but they assured him that they had perfectly obeyed him, and showed him that what they had brought fulfilled the conditions prescribed. Much astonished, he inquired how it was that they had suddenly become so clever, and they told him the story of their journey, and of the little girl who had so fortunately come to their help. He asked whether the little girl was already married, and, finding that she was not, engaged a go-between to see if he could get her for a wife for his youngest son.</p><p>Having succeeded in securing the girl as a daughter-in-law, he brought her home, and told all the rest of the family that as there was no mother in the house, and as this girl had shown herself to be possessed of extraordinary wisdom, she should be the head of the household.</p><p>The wedding celebrations being over, the sons of the old man made ready to return to their usual jobs on the farm; but, according to their father’s order, they came to the young bride for instructions. She told them that they were never to go to or from the fields empty-handed. When they went they must carry fertilizers of some sort for the land, and when they returned they must bring bundles of sticks for fuel. They obeyed, and soon had the land in fine condition, and so much fuel gathered that none need be bought. When there were no more sticks, roots, or weeds to bring; she told them to bring stones instead; and they soon accumulated an immense pile of stones, which were heaped in a yard near their house.</p><p>One day an expert in the discovery of precious stones came along, and saw in this pile a block of jade of great value. In order to get possession of this stone at a small cost, he undertook to buy the whole heap, pretending that he wished to use it in building. The little head of the family asked a huge price for them, and, as he could not convince her to take less, he promised to pay her the sum she asked, and to come two days later to bring the money and to remove the stones. That night the girl thought about the reason for the buyer’s being willing to pay so large a sum for the stones, and concluded that the heap must contain a gem. The next morning she sent her father-in-law to invite the buyer to supper, and she instructed the men of her family in regard to his entertainment. The best of wine was to be provided, and the father-in-law was to lead him to talk of precious stones, and to encourage him to tell in what way they can be recognised from ordinary stones.</p><p>The head of the family, listening behind a curtain, heard how the valuable stone in her heap could be discovered. She hurried to find and remove it from the pile; and, when her guest had recovered from the effect of the banquet, he saw that the value had departed from his purchase. He went to negotiate again with the seller, and she managed it with such skill that she obtained the price originally agreed upon for the heap of stones, and a large sum besides for the one in her possession.</p><p>The family, having become wealthy, built an ancestral hall of fine design and elaborate workmanship, and put the words “No Sorrow” as an inscription over the entrance. Soon after, a mandarin passed that way, and, noticing this remarkable inscription, had his chair set down, that he might inquire who were the people that professed to have no sorrow. He sent for the head of the family, was much surprised on seeing so young a woman thus appear, and remarked: “Yours is a remarkable family. I have never before seen one without sorrow, nor one with so young a head. I will fine you for thinking yourself so great and being so cheeky. Go and weave me a piece of cloth as long as this road.”</p><p>“Very well,” responded the little woman; “so soon as your Excellency shall have found the two ends of the road, and informed me as to the number of feet in its length, I will at once begin the weaving.”</p><p>Finding himself at fault, the mandarin added, “And I also fine you as much oil as there is water in the sea.”</p><p>“Certainly,” responded the woman; “as soon as you shall have measured the sea, and sent me correct information as to the number of gallons, I will at once begin to press out the oil from my beans.”</p><p>“Indeed,” said the mandarin, “since you are so sharp, perhaps you can penetrate my thoughts. If you can, I will fine you no more. I hold this pet bird in my hand; now tell me whether I mean to squeeze it to death, or to let it fly in the air.”</p><p>“Well,” said the woman, “I am an unknown peasant and you are a famed judge. If you are no more knowing than I, you have no right to fine me at all. Now I stand with one foot on one side my threshold and the other foot on the other side; tell me whether I mean to go in or come out. If you cannot guess my riddle, you should not require me to guess yours.”</p><p>Being unable to guess her intention the mandarin took his departure, and the family lived long in wealth and good reputation under its chosen head.</p>"}